{
  "video_id": "x3dJbY0SWdw",
  "url": "https://www.youtube.com/watch?v=x3dJbY0SWdw",
  "title": "GoKollab BETA Mobile App v2 Now Live for Testing!",
  "channel": "HighLevel",
  "channel_id": "UCXFiV4qDX5ipE-DQcsm1j4g",
  "upload_date": "20251030",
  "duration": 108,
  "view_count": 184,
  "like_count": 4,
  "description": "Start your free 30-day trial: https://www.gohighlevel.com/blog-trials?utm_source=youtube\n\nExciting update! 🚀 The GoKollab BETA Mobile App v2 is officially live for testing — bringing you a smoother, faster, and more intuitive experience on the go.\n\nIn this video, explore what’s new in v2 and how it helps teams and creators collaborate, manage communities, and engage seamlessly from anywhere.\n\nHere’s what’s inside:\n✅ Improved UI and performance for better usability\n✅ Easier navigation and faster load times\n✅ Enhanced collaboration tools for course creators and communities\n\nGet early access and experience the future of GoKollab by HighLevel — built for creators who want to stay connected and productive anytime, anywhere!",
  "tags": [],
  "categories": [
    "Education"
  ],
  "transcript": "Hey, happy Thursday everybody. Sean coming at you from High Level. So, this is awesome because it is a brand new rebuild of the Go or the Collab mobile app. Um, so right now it's in beta. So, if you're looking at this and you want to try the beta out, um, this is your announcement. So, what what's the point here? Why do we do this and what's going on? So, basically the idea here is beta version two for both iOS and Android. We've rebuilt the Go Collab app from the ground up to be a lot faster, a lot more intuitive, and a a lot more engaging. The idea here is it's a much more native app experience. So, you're going to get a lot um instant reliable notifications, blazing fast load speeds, rock solid stability, um and it'll be a lot more streamlined for testing and so forth. So, um basically it is Collab, the Collab app as you've known it, but a lot better, a lot faster, and a lot more reliable. So, um the idea here is uh you know, obviously more reliable notifications, native act back app experience here. You're also going to uh get a lot more intuitive navigation, jumping between like courses and communities, events, chats are instant now, no lag. So, all kinds of cool stuff. Um, and then of course, what's up next, we've got a unified feed going live. Go Collab Marketplace. Uh, mobile, the ability to go live in the mobile app. You can do this right now on the web. You can do this on a mobile website or the mobile website version or whatever, but you can't do it in the app. That's coming soon. That's going to be huge. Um, automated QA integration, richer post editing, deep linking, and then finally bringing all of this experience to the branded native apps as well. But as always, we love to get out uh beta and we love to get uh feedback from all of you. Um so when you get a chance um definitely check it out. There is a change log on this. So you're going to go to uh ideas.go.com and go into the change log and right here you see collab mobile app beta version two. Here are the links you need to jump in and join that beta. Um so when you get a chance, definitely check that out. So anyhow, on that note, I hope you're having an amazing Thursday and I'll see you in the next video. Thanks.",
  "transcript_entries": [
    {
      "text": "Hey, happy Thursday everybody. Sean",
      "start": 0.4,
      "duration": 3.279
    },
    {
      "text": "coming at you from High Level. So, this",
      "start": 1.92,
      "duration": 4.24
    },
    {
      "text": "is awesome because it is a brand new",
      "start": 3.679,
      "duration": 5.281
    },
    {
      "text": "rebuild of the Go or the Collab mobile",
      "start": 6.16,
      "duration": 5.12
    },
    {
      "text": "app. Um, so right now it's in beta. So,",
      "start": 8.96,
      "duration": 3.52
    },
    {
      "text": "if you're looking at this and you want",
      "start": 11.28,
      "duration": 3.2
    },
    {
      "text": "to try the beta out, um, this is your",
      "start": 12.48,
      "duration": 4.08
    },
    {
      "text": "announcement. So, what what's the point",
      "start": 14.48,
      "duration": 3.36
    },
    {
      "text": "here? Why do we do this and what's going",
      "start": 16.56,
      "duration": 3.36
    },
    {
      "text": "on? So, basically the idea here is beta",
      "start": 17.84,
      "duration": 4.0
    },
    {
      "text": "version two for both iOS and Android.",
      "start": 19.92,
      "duration": 3.519
    },
    {
      "text": "We've rebuilt the Go Collab app from the",
      "start": 21.84,
      "duration": 3.599
    },
    {
      "text": "ground up to be a lot faster, a lot more",
      "start": 23.439,
      "duration": 4.561
    },
    {
      "text": "intuitive, and a a lot more engaging.",
      "start": 25.439,
      "duration": 4.641
    },
    {
      "text": "The idea here is it's a much more native",
      "start": 28.0,
      "duration": 3.359
    },
    {
      "text": "app experience. So, you're going to get",
      "start": 30.08,
      "duration": 3.44
    },
    {
      "text": "a lot um instant reliable notifications,",
      "start": 31.359,
      "duration": 4.241
    },
    {
      "text": "blazing fast load speeds, rock solid",
      "start": 33.52,
      "duration": 4.0
    },
    {
      "text": "stability, um and it'll be a lot more",
      "start": 35.6,
      "duration": 3.52
    },
    {
      "text": "streamlined for testing and so forth.",
      "start": 37.52,
      "duration": 3.6
    },
    {
      "text": "So, um basically it is Collab, the",
      "start": 39.12,
      "duration": 3.92
    },
    {
      "text": "Collab app as you've known it, but a lot",
      "start": 41.12,
      "duration": 3.84
    },
    {
      "text": "better, a lot faster, and a lot more",
      "start": 43.04,
      "duration": 4.56
    },
    {
      "text": "reliable. So, um the idea here is uh you",
      "start": 44.96,
      "duration": 3.759
    },
    {
      "text": "know, obviously more reliable",
      "start": 47.6,
      "duration": 3.119
    },
    {
      "text": "notifications, native act back app",
      "start": 48.719,
      "duration": 4.241
    },
    {
      "text": "experience here. You're also going to uh",
      "start": 50.719,
      "duration": 3.921
    },
    {
      "text": "get a lot more intuitive navigation,",
      "start": 52.96,
      "duration": 3.04
    },
    {
      "text": "jumping between like courses and",
      "start": 54.64,
      "duration": 3.36
    },
    {
      "text": "communities, events, chats are instant",
      "start": 56.0,
      "duration": 4.0
    },
    {
      "text": "now, no lag. So, all kinds of cool",
      "start": 58.0,
      "duration": 3.6
    },
    {
      "text": "stuff. Um, and then of course, what's up",
      "start": 60.0,
      "duration": 3.199
    },
    {
      "text": "next, we've got a unified feed going",
      "start": 61.6,
      "duration": 4.0
    },
    {
      "text": "live. Go Collab Marketplace. Uh, mobile,",
      "start": 63.199,
      "duration": 3.92
    },
    {
      "text": "the ability to go live in the mobile",
      "start": 65.6,
      "duration": 2.64
    },
    {
      "text": "app. You can do this right now on the",
      "start": 67.119,
      "duration": 2.641
    },
    {
      "text": "web. You can do this on a mobile website",
      "start": 68.24,
      "duration": 3.12
    },
    {
      "text": "or the mobile website version or",
      "start": 69.76,
      "duration": 2.64
    },
    {
      "text": "whatever, but you can't do it in the",
      "start": 71.36,
      "duration": 2.24
    },
    {
      "text": "app. That's coming soon. That's going to",
      "start": 72.4,
      "duration": 3.36
    },
    {
      "text": "be huge. Um, automated QA integration,",
      "start": 73.6,
      "duration": 3.839
    },
    {
      "text": "richer post editing, deep linking, and",
      "start": 75.76,
      "duration": 3.359
    },
    {
      "text": "then finally bringing all of this",
      "start": 77.439,
      "duration": 3.441
    },
    {
      "text": "experience to the branded native apps as",
      "start": 79.119,
      "duration": 4.0
    },
    {
      "text": "well. But as always, we love to get out",
      "start": 80.88,
      "duration": 4.239
    },
    {
      "text": "uh beta and we love to get uh feedback",
      "start": 83.119,
      "duration": 3.68
    },
    {
      "text": "from all of you. Um so when you get a",
      "start": 85.119,
      "duration": 3.441
    },
    {
      "text": "chance um definitely check it out. There",
      "start": 86.799,
      "duration": 3.601
    },
    {
      "text": "is a change log on this. So you're going",
      "start": 88.56,
      "duration": 4.879
    },
    {
      "text": "to go to uh ideas.go.com and go into the",
      "start": 90.4,
      "duration": 4.8
    },
    {
      "text": "change log and right here you see collab",
      "start": 93.439,
      "duration": 3.841
    },
    {
      "text": "mobile app beta version two. Here are",
      "start": 95.2,
      "duration": 4.4
    },
    {
      "text": "the links you need to jump in and join",
      "start": 97.28,
      "duration": 4.24
    },
    {
      "text": "that beta. Um so when you get a chance,",
      "start": 99.6,
      "duration": 3.76
    },
    {
      "text": "definitely check that out. So anyhow, on",
      "start": 101.52,
      "duration": 3.2
    },
    {
      "text": "that note, I hope you're having an",
      "start": 103.36,
      "duration": 3.039
    },
    {
      "text": "amazing Thursday and I'll see you in the",
      "start": 104.72,
      "duration": 4.719
    },
    {
      "text": "next video. Thanks.",
      "start": 106.399,
      "duration": 3.04
    }
  ],
  "duration_seconds": 109.43900000000001,
  "language": "en",
  "is_generated": true,
  "method": "youtube-transcript-api",
  "scraped_date": "2025-11-01T16:06:45.207669",
  "word_count": 429
}