{
  "video_id": "SmN6H-EUyww",
  "url": "https://www.youtube.com/watch?v=SmN6H-EUyww",
  "title": "HighLevel WhatsApp Coexistence Now Live for Everyone!",
  "channel": "HighLevel",
  "channel_id": "UCXFiV4qDX5ipE-DQcsm1j4g",
  "upload_date": "20251030",
  "duration": 89,
  "view_count": 391,
  "like_count": 17,
  "description": "Start your free 30-day trial: https://www.gohighlevel.com/blog-trials?utm_source=youtube\n\nIt’s official — HighLevel’s WhatsApp Coexistence feature is now live for everyone worldwide! 🎉\n\nIn this video, discover how this update makes multi-user WhatsApp access easier than ever. Your entire team can now send, receive, and manage WhatsApp messages simultaneously — without any conflicts or logouts.\n\nHere’s what you’ll learn:\n✅ How WhatsApp Coexistence works in HighLevel\n✅ Benefits for teams managing multiple client conversations\n✅ How to set it up and start using it instantly\n\nEmpower your business with seamless communication — only with HighLevel’s WhatsApp integration!",
  "tags": [],
  "categories": [
    "Education"
  ],
  "transcript": "Hey, happy Thursday everybody. Sean coming at you from high level. So today is an awesome day because WhatsApp has rolled out coexistence for everyone um except South America or South America, South Africa and Nigeria. But overall global this is like their global coexistence release. Now of course what the heck is this all about? So um couple of things. One remember we have an integration with WhatsApp. That's cool. But there was a problem before where you would integrate with WhatsApp and it would basically make it so you could see all of the messages inside high level but you couldn't see it external to high level like back on your phone. Well, coexistence solves that problem. So basically you'll you'll see all the messages you send from your phone in high level and um all the messages you send from high level on your phone, right? So it's kind of the way you'd want it to be, which is awesome. And what are the advantages of of this? Of course, now you can do all the bulk messaging and automations and workflows and analytics and insights and all of that stuff seamlessly um inside high level and not lose any of that history on the phone and vice versa. So, it is now live for everyone except Nigeria and South Africa. I don't know what the deal is there, but I'm sure this will be forthcoming. But for any of you who are holding out um in any of those other countries and we're worried about it, don't worry. Today is your day and is now uh live to everyone. And of course, that means it's also out of beta. It was like a private beta before and now it is um now public to everybody. So, huge props uh for getting this done. Um, this is possible, by the way, because we are an official Meta partner. So, huge thanks to the Meta folks uh for getting us on this early on uh and getting this out and letting us use this because now we can introduce it to all of you today. So, on that note, I hope you're having an amazing Thursday and I'll see you in the next video. Thanks.",
  "transcript_entries": [
    {
      "text": "Hey, happy Thursday everybody. Sean",
      "start": 0.4,
      "duration": 3.76
    },
    {
      "text": "coming at you from high level. So today",
      "start": 1.92,
      "duration": 4.56
    },
    {
      "text": "is an awesome day because WhatsApp has",
      "start": 4.16,
      "duration": 5.76
    },
    {
      "text": "rolled out coexistence for everyone um",
      "start": 6.48,
      "duration": 6.32
    },
    {
      "text": "except South America or South America,",
      "start": 9.92,
      "duration": 5.759
    },
    {
      "text": "South Africa and Nigeria. But overall",
      "start": 12.8,
      "duration": 4.319
    },
    {
      "text": "global this is like their global",
      "start": 15.679,
      "duration": 3.201
    },
    {
      "text": "coexistence release. Now of course what",
      "start": 17.119,
      "duration": 3.441
    },
    {
      "text": "the heck is this all about? So um couple",
      "start": 18.88,
      "duration": 3.04
    },
    {
      "text": "of things. One remember we have an",
      "start": 20.56,
      "duration": 3.28
    },
    {
      "text": "integration with WhatsApp. That's cool.",
      "start": 21.92,
      "duration": 3.04
    },
    {
      "text": "But there was a problem before where you",
      "start": 23.84,
      "duration": 2.56
    },
    {
      "text": "would integrate with WhatsApp and it",
      "start": 24.96,
      "duration": 2.72
    },
    {
      "text": "would basically make it so you could see",
      "start": 26.4,
      "duration": 2.719
    },
    {
      "text": "all of the messages inside high level",
      "start": 27.68,
      "duration": 3.12
    },
    {
      "text": "but you couldn't see it external to high",
      "start": 29.119,
      "duration": 3.201
    },
    {
      "text": "level like back on your phone. Well,",
      "start": 30.8,
      "duration": 3.04
    },
    {
      "text": "coexistence solves that problem. So",
      "start": 32.32,
      "duration": 2.72
    },
    {
      "text": "basically you'll you'll see all the",
      "start": 33.84,
      "duration": 2.96
    },
    {
      "text": "messages you send from your phone in",
      "start": 35.04,
      "duration": 3.199
    },
    {
      "text": "high level and um all the messages you",
      "start": 36.8,
      "duration": 2.88
    },
    {
      "text": "send from high level on your phone,",
      "start": 38.239,
      "duration": 2.64
    },
    {
      "text": "right? So it's kind of the way you'd",
      "start": 39.68,
      "duration": 3.12
    },
    {
      "text": "want it to be, which is awesome. And",
      "start": 40.879,
      "duration": 3.601
    },
    {
      "text": "what are the advantages of of this? Of",
      "start": 42.8,
      "duration": 2.88
    },
    {
      "text": "course, now you can do all the bulk",
      "start": 44.48,
      "duration": 2.8
    },
    {
      "text": "messaging and automations and workflows",
      "start": 45.68,
      "duration": 3.28
    },
    {
      "text": "and analytics and insights and all of",
      "start": 47.28,
      "duration": 4.08
    },
    {
      "text": "that stuff seamlessly um inside high",
      "start": 48.96,
      "duration": 3.759
    },
    {
      "text": "level and not lose any of that history",
      "start": 51.36,
      "duration": 3.359
    },
    {
      "text": "on the phone and vice versa. So, it is",
      "start": 52.719,
      "duration": 4.48
    },
    {
      "text": "now live for everyone except Nigeria and",
      "start": 54.719,
      "duration": 3.68
    },
    {
      "text": "South Africa. I don't know what the deal",
      "start": 57.199,
      "duration": 2.641
    },
    {
      "text": "is there, but I'm sure this will be",
      "start": 58.399,
      "duration": 3.041
    },
    {
      "text": "forthcoming. But for any of you who are",
      "start": 59.84,
      "duration": 3.28
    },
    {
      "text": "holding out um in any of those other",
      "start": 61.44,
      "duration": 3.039
    },
    {
      "text": "countries and we're worried about it,",
      "start": 63.12,
      "duration": 2.88
    },
    {
      "text": "don't worry. Today is your day and is",
      "start": 64.479,
      "duration": 3.121
    },
    {
      "text": "now uh live to everyone. And of course,",
      "start": 66.0,
      "duration": 2.799
    },
    {
      "text": "that means it's also out of beta. It was",
      "start": 67.6,
      "duration": 3.36
    },
    {
      "text": "like a private beta before and now it is",
      "start": 68.799,
      "duration": 4.0
    },
    {
      "text": "um now public to everybody. So, huge",
      "start": 70.96,
      "duration": 3.6
    },
    {
      "text": "props uh for getting this done. Um, this",
      "start": 72.799,
      "duration": 3.121
    },
    {
      "text": "is possible, by the way, because we are",
      "start": 74.56,
      "duration": 3.28
    },
    {
      "text": "an official Meta partner. So, huge",
      "start": 75.92,
      "duration": 3.76
    },
    {
      "text": "thanks to the Meta folks uh for getting",
      "start": 77.84,
      "duration": 3.919
    },
    {
      "text": "us on this early on uh and getting this",
      "start": 79.68,
      "duration": 3.52
    },
    {
      "text": "out and letting us use this because now",
      "start": 81.759,
      "duration": 3.04
    },
    {
      "text": "we can introduce it to all of you today.",
      "start": 83.2,
      "duration": 3.279
    },
    {
      "text": "So, on that note, I hope you're having",
      "start": 84.799,
      "duration": 3.441
    },
    {
      "text": "an amazing Thursday and I'll see you in",
      "start": 86.479,
      "duration": 4.881
    },
    {
      "text": "the next video. Thanks.",
      "start": 88.24,
      "duration": 3.12
    }
  ],
  "duration_seconds": 91.36,
  "language": "en",
  "is_generated": true,
  "method": "youtube-transcript-api",
  "scraped_date": "2025-11-01T16:07:00.382733",
  "word_count": 377
}