{
  "video_id": "dYu_cEZkF9Y",
  "url": "https://www.youtube.com/watch?v=dYu_cEZkF9Y",
  "title": "Manual Import",
  "channel": "HighLevel",
  "transcript": "SEO used to be this super advanced skill\nthat took years of studying and\nexperience to master. But now it's\nbecoming extremely easy with AI tools\nthat can do 99% of the work for us. For\nexample, think of the cars that were\nmass-produced back in the 1900s. They\ncompletely eliminated the need for\npeople to walk everywhere. They were\nmore comfortable than a horse and bucky,\nand they could get people to their\ndestinations faster. These new AI SEO\ntools are the same way, making SEO more\nconvenient, less time inensive, and get\nyou ranked faster. But just like with\ncars, in order to get the best benefits\nfrom these SEO tools, you have to know\nhow to drive them. So, in this video,\nI'm going to show you seven AI SEO cheat\ncodes for getting any local business\nranked number one on Google, getting 10x\nmore website traffic as a result. But\nbefore I show you these hacks, I need to\nintroduce you to the AI SEO software\nthat I use to get these results. And\nit's a software called Search Atlas.\nSearch Atlas does everything from\nbacklink building to blog writing to\nGoogle business profile optimization.\nand it does the majority of it using AI.\nAnd you can start using Search Atlas for\njust $99 a month, which will allow you\nto do SEO for one website and then you\ncan upgrade as you get more clients. And\nAuto SEO Pixel\nif you sign up with my affiliate link\ndown below, you can get an extended\n14-day free trial instead of the normal\n7-day free trial. But the first feature\nwhere Search Atlas helps with SEO is\ntheir auto SEO pixel, which is simply a\nline of code that you can copy and paste\nonto any website, and it'll literally do\nSEO on the website for you. You'll\nsimply fill in as much of this\ninformation here under this knowledge\ngraph section as possible about the\nbusiness. All the top pages of their\nwebsite, any social media profiles, the\nbusiness owner's name, any images and\nlogos. Once you've filled that in as\nmuch as you can, you'll simply go here\nand you'll go to this auto pixel\nintegration and you'll just copy the\ncode right here. It's just all these\nrandom strings of letters and numbers.\nYou'll copy that. You'll go into the\nback end of your website. This is a\nwebsite that we built inside of Goh High\nLevel. We'll go into the settings here\nand then you'll go under the head\ntracking code section and you'll paste\nin your auto pixel code. You can see\nI've already pasted mine in here. Just\nsimply paste it in, save it, and then\nyou'll go back here and you'll click\nengage and then it will engage and it'll\nmake all these updates and changes to\nyour website. Anything that it finds\nwrong with your SEO and ways that it can\nimprove it, it'll change your title\ntags, your meta descriptions, any alt\nimage text that's missing, meta\nkeywords, missing headlines, all these\nthings. It'll change the actual text on\nthe website front end and it'll do stuff\non the back end for your SEO to help you\nget ranked higher in search. The Auto AI\nKeyword Research Tool\nSEO pixel is super powerful for helping\nbusinesses rank on Google, but you need\nto know how to prompt it with the best\ninformation to get the best results from\nit. So, that's where Search Atlas's next\ntool comes in, which is their AI keyword\nresearch tool. If you go to the main\nprojects page in Search Atlas and you\ntype in any niche keyword right here, I\ntyped in landscaping and then click\nsearch, it'll pull up all of the search\ndata for that keyword. It'll tell you\nhow difficult that keyword is to rank\nfor, how many monthly searches it gets\nacross the United States or whatever\ncountry you toggle on right here. And\nthen it'll give you a lot of good search\ndata on this keyword. But even more, we\ncan go to this related keyword section.\nWe can click view all of them. and it'll\npull up a ton of related keywords to the\nmain keyword that we typed in, which in\nthis case was landscaping. And it'll so\nget it'll give us different keyword\nvariations of landscaping like\nlandscaping, landscaping near me, lawn\ncare near me, lawn care, all of these\nother keywords, and we can look at these\nmain keywords that get a lot of\nsearches. Typically, we want to go for\nones that have high search volume and\nlow competition. And so this one right\nhere, landscaping would be a perfect\nexample, gets a lot of monthly searches,\nbut it's very uncompetitive. Landscaping\nnear me is a little bit more\ncompetitive. But when we narrow down\nlandscaping and then within a local\nmarket, there's probably going to be\nonly maybe 20 other landscapers within\na, you know, 20 mile radius that we're\nreally competing with. And so we just\nhave to beat out 20 other landscapers\nwhen we narrow it down to our local area\nand to our local um into our niche,\nwhich is in this case landscaping. And\nso it's really not that hard. Usually\nI'll go after more of the competitive\nkeywords. And then we can jump into our\nauto tool that I showed you before. And\nunder this knowledge graph section, we\ncan give auto these different keywords\nthat we're trying to rank for. So once\nwe pick a few of the different keywords\nthat we want to go after here, you could\npick up to 10 different keywords. You\ncould use all the different services\nthat you offer as your main keywords. Go\nto top pages. You can then fill in and\nadd your pages and add up to three\ndifferent keywords that you're trying to\nrank for for those pages. And now auto,\nthis SEO AI pixel will know exactly how\nto best optimize our website down here\nwith all of its recommendations and\nfixes that it can deploy on our website\ncompletely on autopilot. So now you know\nAI Blog Writer\nhow to apply the auto SEO pixel onto a\nwebsite with the best keyword strategy\nbacking it up. But there are other\nsearch atlas tools on top of these that\ncan help improve SEO rankings. And the\nnext one I'll show you is their AI blog\nwriter. If you go into this content tab\ninside of search atlas, you'll find the\ncontent genius, which is an AI content\nwriter that you can use to write content\nfor the main pages of your website. But\nI like to use it to write the content\nfor my blogs on my website and for my\nclients. So first you want to create a\nfolder here. You'll go under folder\nsettings. You just type in all of the\ninformation about the business. This\ngives the AI really good context about\ndifferent keywords and just what your\nbusiness is called, what you're trying\nto rank for, all that good stuff here.\nOnce you've created that folder, you can\nsee and you can switch into it. And then\nwe'll go to this topical map section and\nwe can create a topical map. I've\nalready got one here. Just create that.\nAnd it'll ask you for all the different\nkeywords you're trying to rank for for\nyour blog. And then we can click view\ntopical map once it's created. And it'll\ngive us all these different um title\noptions based on the keywords that we're\ntrying to rank for. And so it creates\nthese titles for us and it'll build\nthese blogs and it'll generate images,\nparagraphs, everything for us. And so\noff the keyword, you know, Blige,\nGeorgia tourist attractions, it created\na blog called Blueridge, Georgia tourist\nattractions. You can't miss. And so it\nuses the a lot of the keywords in the\ntitles to help you rank. And you'll hit\ngenerate and it'll generate it. And then\nonce it's generated, it takes a few\nminutes. Then you can click view\ncontent. And this is an example of one.\nIt generates a hero image, the H1's,\nparagraphs, it puts it all into proper\nSEO format, which is really good because\nyou want the H1s to have your keywords\nand paragraphs to have your keywords\nthroughout. And just having thing in\neverything in the appropriate formats\nhelps with your SEO. And then you can\nsimply copy everything from top to\nbottom. We'll just drag from the\nheadline here. You'll go down to the\nbottom here. You'll copy all of that.\nAnd then you can take it into your blog\nplatform. I use go high level for all of\nmy blogs and our our websites that we\nbuild as well. And you'll go into the\nblog section and then you can click new\npost and it'll give you a blank page.\nIt'll look kind of like this except\nit'll be blank here. And then you can\nsimply click paste and it'll paste in\nthe entire blog. It'll keep it in proper\nformat. Uh and go high level at least it\nkeeps it all like the H1's, the H2s, the\nparagraphs in the appropriate formats\nwith the appropriate, you know, bolding\nof the text. It puts in all the images\nonto the blog and then you can click\nupdate. And it really is that quick and\nthat easy to post blogs directly onto\nyour website, which will just give you\nmore chances to rank for different\nkeywords cuz all of these blogs target\ndifferent keywords that are related to\nyour niche or your client's niche. Blogs\nCloud Stacks\nare great for getting more keywords and\nkey phrases onto a website, but without\nbuilding your website authority, then it\ndoesn't matter how many keywords you\nstuff onto the site. And that takes us\ninto our next AI SEO tool, which is\ncalled cloud stacks. Cloud stacks are\njust the term that search atlas uses for\nbacklinks. A backlink is anytime another\nwebsite puts your website link on\ntheirs, sending traffic from their site\nto your site. This just sends really\ngood signals to Google that you're an\nauthority in your niche and you get\nranked higher because of it. The Cloud\nStack tool in Search Atlas works like\nthis. If you're on the auto tool for\nyour client or for your website, you'll\nscroll down here. You'll go to the Cloud\nStacks tool. And then you'll be able to\nadd a page to your website that you're\ngoing to get this backlink set up on.\nAnd so you can type in all the different\nmain pages of your website. The\nhomepage, about page, contact page, the\nFAQ's page. We've added a few here. And\nthen you'll just click add cloud stack.\nYou'll type in that page of your website\nwith the appropriate path on the end.\nAnd then you'll type three keywords that\nyou're trying to rank that page for that\nwill help with that backlink because\nthat backlink will actually be an AI\ngenerated article on another website\nthat Search Atlas partners with and\nit'll send a backlink over to your site\nwhich like I said will show Google that\nyou're an authority. Now you've got\nanother backlink. The more backlinks you\ncan get, the more your website looks\nlike an authority and the more you rank\nhigher. And so you'll just type in that\nthat page of your website here, the\nthree different keywords that you're\ntrying to rank that page for here. And\nthen it'll add you and get you a\nbacklink on 13 different high quality\nsites, the ones that you see here. And\nso you're actually getting 13 back links\nby doing this one time. And it only\ncosts 15 credits, which is $15 in Search\nAtlas to get these back links. So you\ncan buy more authority for your website\nessentially and get back links to every\nsingle page of your website. And then\nyou can start going through pages again\nonce you've run out of pages to add them\nto. you can go back through pages and\njust change the keywords on them and get\nranked and get back links for other\nkeywords as well. And so, it's never\nbeen easier to get tons of backlinks to\nyour website with a few clicks of a\nGoogle Business Profile\nbutton. Backlinks are one of the best\nways to boost your website SEO. But here\nare two even easier ways that AI can\nhelp any business rank higher, and\nthat's through automating update posts\nand Q&As's on Google Business Profile.\nIf you go to Google business profile and\nyou scroll down, update posts are these\nlittle posts here that businesses can\nmake on their profile with an image and\na description. And really, this is just\nanother opportunity for this business to\nput keywords in this description and put\na good image that goes along with it.\nAnd this can help businesses rank when\nthey consistently make update posts to\ntheir business about different services\nthey offer, um, different promotions\nthey're doing, etc. And if we go back\nhere, the Q&As's are down here. So you\ncan type questions and you can also\nanswer your own questions as the\nbusiness owner, which lots of Q&As's on\nyour Google business profile. Just more\nopportunities to put keywords onto your\nprofile and get ranked higher for those\ndifferent keywords. And so inside of\nSearch Atlas, if we go into the auto\ntool here, we can scroll down and we can\nintegrate Google business profile into\nSearch Atlas. And we can go to this GBP\npost sections which are those update\nposts with the picture and the\ndescription. And it will automatically\npost. It'll generate pictures with AI,\nbut it'll also post and create an AI\ngenerated description. And it'll post\nthese on autopilot for us. It does it\nrandomly and sporadically, so Google\ndoesn't think it's a bot posting them.\nIt actually makes it look like a real\nhuman is posting them, but it does them\nevery few days and kind of at random\nthroughout the week. And it just gives\nyou tons of good images and just more uh\ndescriptions, more keywords that it's\nstuffed with here now, so you can rank\nbetter for these different things. And\nit just shows prof uh activity on your\nGoogle business profile. Shows that\nyou're doing something and updating\nsomething to your profile, which sends\ngood signals to Google that you're\nactively working on your Google business\nprofile and you'll get ranked higher\nbecause of this. All you have to do to\nset this up is turn this little toggle\nswitch on and it'll start automatically\nposting and AI generating these images\nand these descriptions and posting these\nto your Google business profile. Same\nthing if we scroll down here to the\nquestion and answer suggestions. It'll\nAI generate these Q&As's for you. It'll\ntype out a question and then it'll\nanswer that question. And all you have\nto do is toggle this switch on and it'll\nmake these updates, these update posts\nand these Q&As's to your Google business\nprofile completely on autopilot every\nfew days, which will just help rank you\nhigher on Google business profile, which\nis also tied into your website, so it'll\nhelp your website rank higher as well.\nGoogle Reviews\nSEO really doesn't get easier than this\none. You can fully automate posting on\nyour Google business profile with AI.\nBut there's one last AI tool that seals\nthe deal in this AI SEO strategy, and\nthat's automated Google review\nresponses. Replying to all of the Google\nreviews that a business receives is a\ngreat way to boost their SEO, but it can\nalso be timeconuming to do if this\nbusiness is getting a ton of Google\nreviews. So, inside of GoHigh Level, we\ncan fully automate our review responses\nusing AI. And the way that you do that\nis go under the reputation tab. You'll\ngo to settings and then under this\nreviews AI section, we can toggle on\nauto responses first. And then we can\nset a wait time before it replies to the\nGoogle review. 25 minutes is good. just\nmakes it look more real, like it's a\nreal human instead of an AI responding\nto it. And then down here, you can\ncreate an AI agent with a certain\npersonality. You'll just click create\nagent. I've got one here. I'll click\nedit and show you. This is what it looks\nlike inside. You can name the agent.\nJust usually name it the name of the\nbusiness that you're helping um for\ntheir SEO. And then you can have a\ninstructions for it here. Just a short\nprompt. You can select the tone of\nvoice. I like to do friendly. And then\nyou can select the language. You can\nalso make it dynamic where if someone\nleaves a Spanish review, it'll reply\nback in Spanish. And then review source,\nyou can um set it up on Google. You can\nalso do it on Facebook as you can see\nhere. So it'll auto reply and use AI to\nreply to all the Facebook reviews as\nwell as Google. And then right here,\nreview type. You can say uh I only want\nit to reply to my four and five star\nreviews. I typically will set it up to\nreply to all reviews. We only we don't\nwant just the high reviews to get\nreplied to. We want the low ones to get\nreplies as well. And then you can have a\nfooter at the bottom of all the all the\nGoogle review replies saying, you know,\nthank you and then the name of the\nbusiness. And then you save that. And\nnow it'll auto reply using AI to all of\nthe Google reviews uh that are left on\nthe Google business profile and Facebook\nas well. If you guys want to sign up for\nGoHigh Level, this is the software I use\nhere, and that's where I build all of my\nsmart websites as well that we build to\nhelp our clients rank with their SEO,\nyou guys can get a 30-day free trial of\nit down below this video. And if you use\nmy link, go High Leo pays me a\ncommission. So, in return, I'll jump on\ntwo free Zoom calls with you every\nsingle week for life. And I'll help you\ngrow your agency, and I'll give you over\n50 plus custom smart website templates\nthat were built by my amazing web\ndesigner, Mike. And you get those\nabsolutely free just for using my\naffiliate link down below. If you use\nthe seven AI SEO cheat codes that I just\nshowed you, you can get almost any local\nbusiness ranked on the first page of\nGoogle and top five on Google Maps\nwithin just 3 to 4 months. But there are\nstill a lot of other moving parts to\nrunning a successful agency that I\nwasn't able to cover in this video. So,\nif you want to learn how to start, set\nup, and scale your own smart website\nagency, then check out my free Highle\nQuest community down below.",
  "transcript_entries": [
    {
      "text": "SEO used to be this super advanced skill\nthat took years of studying and\nexperience to master. But now it's\nbecoming extremely easy with AI tools\nthat can do 99% of the work for us. For\nexample, think of the cars that were\nmass-produced back in the 1900s. They\ncompletely eliminated the need for\npeople to walk everywhere. They were\nmore comfortable than a horse and bucky,\nand they could get people to their\ndestinations faster. These new AI SEO\ntools are the same way, making SEO more\nconvenient, less time inensive, and get\nyou ranked faster. But just like with\ncars, in order to get the best benefits\nfrom these SEO tools, you have to know\nhow to drive them. So, in this video,\nI'm going to show you seven AI SEO cheat\ncodes for getting any local business\nranked number one on Google, getting 10x\nmore website traffic as a result. But\nbefore I show you these hacks, I need to\nintroduce you to the AI SEO software\nthat I use to get these results. And\nit's a software called Search Atlas.\nSearch Atlas does everything from\nbacklink building to blog writing to\nGoogle business profile optimization.\nand it does the majority of it using AI.\nAnd you can start using Search Atlas for\njust $99 a month, which will allow you\nto do SEO for one website and then you\ncan upgrade as you get more clients. And\nAuto SEO Pixel\nif you sign up with my affiliate link\ndown below, you can get an extended\n14-day free trial instead of the normal\n7-day free trial. But the first feature\nwhere Search Atlas helps with SEO is\ntheir auto SEO pixel, which is simply a\nline of code that you can copy and paste\nonto any website, and it'll literally do\nSEO on the website for you. You'll\nsimply fill in as much of this\ninformation here under this knowledge\ngraph section as possible about the\nbusiness. All the top pages of their\nwebsite, any social media profiles, the\nbusiness owner's name, any images and\nlogos. Once you've filled that in as\nmuch as you can, you'll simply go here\nand you'll go to this auto pixel\nintegration and you'll just copy the\ncode right here. It's just all these\nrandom strings of letters and numbers.\nYou'll copy that. You'll go into the\nback end of your website. This is a\nwebsite that we built inside of Goh High\nLevel. We'll go into the settings here\nand then you'll go under the head\ntracking code section and you'll paste\nin your auto pixel code. You can see\nI've already pasted mine in here. Just\nsimply paste it in, save it, and then\nyou'll go back here and you'll click\nengage and then it will engage and it'll\nmake all these updates and changes to\nyour website. Anything that it finds\nwrong with your SEO and ways that it can\nimprove it, it'll change your title\ntags, your meta descriptions, any alt\nimage text that's missing, meta\nkeywords, missing headlines, all these\nthings. It'll change the actual text on\nthe website front end and it'll do stuff\non the back end for your SEO to help you\nget ranked higher in search. The Auto AI\nKeyword Research Tool\nSEO pixel is super powerful for helping\nbusinesses rank on Google, but you need\nto know how to prompt it with the best\ninformation to get the best results from\nit. So, that's where Search Atlas's next\ntool comes in, which is their AI keyword\nresearch tool. If you go to the main\nprojects page in Search Atlas and you\ntype in any niche keyword right here, I\ntyped in landscaping and then click\nsearch, it'll pull up all of the search\ndata for that keyword. It'll tell you\nhow difficult that keyword is to rank\nfor, how many monthly searches it gets\nacross the United States or whatever\ncountry you toggle on right here. And\nthen it'll give you a lot of good search\ndata on this keyword. But even more, we\ncan go to this related keyword section.\nWe can click view all of them. and it'll\npull up a ton of related keywords to the\nmain keyword that we typed in, which in\nthis case was landscaping. And it'll so\nget it'll give us different keyword\nvariations of landscaping like\nlandscaping, landscaping near me, lawn\ncare near me, lawn care, all of these\nother keywords, and we can look at these\nmain keywords that get a lot of\nsearches. Typically, we want to go for\nones that have high search volume and\nlow competition. And so this one right\nhere, landscaping would be a perfect\nexample, gets a lot of monthly searches,\nbut it's very uncompetitive. Landscaping\nnear me is a little bit more\ncompetitive. But when we narrow down\nlandscaping and then within a local\nmarket, there's probably going to be\nonly maybe 20 other landscapers within\na, you know, 20 mile radius that we're\nreally competing with. And so we just\nhave to beat out 20 other landscapers\nwhen we narrow it down to our local area\nand to our local um into our niche,\nwhich is in this case landscaping. And\nso it's really not that hard. Usually\nI'll go after more of the competitive\nkeywords. And then we can jump into our\nauto tool that I showed you before. And\nunder this knowledge graph section, we\ncan give auto these different keywords\nthat we're trying to rank for. So once\nwe pick a few of the different keywords\nthat we want to go after here, you could\npick up to 10 different keywords. You\ncould use all the different services\nthat you offer as your main keywords. Go\nto top pages. You can then fill in and\nadd your pages and add up to three\ndifferent keywords that you're trying to\nrank for for those pages. And now auto,\nthis SEO AI pixel will know exactly how\nto best optimize our website down here\nwith all of its recommendations and\nfixes that it can deploy on our website\ncompletely on autopilot. So now you know\nAI Blog Writer\nhow to apply the auto SEO pixel onto a\nwebsite with the best keyword strategy\nbacking it up. But there are other\nsearch atlas tools on top of these that\ncan help improve SEO rankings. And the\nnext one I'll show you is their AI blog\nwriter. If you go into this content tab\ninside of search atlas, you'll find the\ncontent genius, which is an AI content\nwriter that you can use to write content\nfor the main pages of your website. But\nI like to use it to write the content\nfor my blogs on my website and for my\nclients. So first you want to create a\nfolder here. You'll go under folder\nsettings. You just type in all of the\ninformation about the business. This\ngives the AI really good context about\ndifferent keywords and just what your\nbusiness is called, what you're trying\nto rank for, all that good stuff here.\nOnce you've created that folder, you can\nsee and you can switch into it. And then\nwe'll go to this topical map section and\nwe can create a topical map. I've\nalready got one here. Just create that.\nAnd it'll ask you for all the different\nkeywords you're trying to rank for for\nyour blog. And then we can click view\ntopical map once it's created. And it'll\ngive us all these different um title\noptions based on the keywords that we're\ntrying to rank for. And so it creates\nthese titles for us and it'll build\nthese blogs and it'll generate images,\nparagraphs, everything for us. And so\noff the keyword, you know, Blige,\nGeorgia tourist attractions, it created\na blog called Blueridge, Georgia tourist\nattractions. You can't miss. And so it\nuses the a lot of the keywords in the\ntitles to help you rank. And you'll hit\ngenerate and it'll generate it. And then\nonce it's generated, it takes a few\nminutes. Then you can click view\ncontent. And this is an example of one.\nIt generates a hero image, the H1's,\nparagraphs, it puts it all into proper\nSEO format, which is really good because\nyou want the H1s to have your keywords\nand paragraphs to have your keywords\nthroughout. And just having thing in\neverything in the appropriate formats\nhelps with your SEO. And then you can\nsimply copy everything from top to\nbottom. We'll just drag from the\nheadline here. You'll go down to the\nbottom here. You'll copy all of that.\nAnd then you can take it into your blog\nplatform. I use go high level for all of\nmy blogs and our our websites that we\nbuild as well. And you'll go into the\nblog section and then you can click new\npost and it'll give you a blank page.\nIt'll look kind of like this except\nit'll be blank here. And then you can\nsimply click paste and it'll paste in\nthe entire blog. It'll keep it in proper\nformat. Uh and go high level at least it\nkeeps it all like the H1's, the H2s, the\nparagraphs in the appropriate formats\nwith the appropriate, you know, bolding\nof the text. It puts in all the images\nonto the blog and then you can click\nupdate. And it really is that quick and\nthat easy to post blogs directly onto\nyour website, which will just give you\nmore chances to rank for different\nkeywords cuz all of these blogs target\ndifferent keywords that are related to\nyour niche or your client's niche. Blogs\nCloud Stacks\nare great for getting more keywords and\nkey phrases onto a website, but without\nbuilding your website authority, then it\ndoesn't matter how many keywords you\nstuff onto the site. And that takes us\ninto our next AI SEO tool, which is\ncalled cloud stacks. Cloud stacks are\njust the term that search atlas uses for\nbacklinks. A backlink is anytime another\nwebsite puts your website link on\ntheirs, sending traffic from their site\nto your site. This just sends really\ngood signals to Google that you're an\nauthority in your niche and you get\nranked higher because of it. The Cloud\nStack tool in Search Atlas works like\nthis. If you're on the auto tool for\nyour client or for your website, you'll\nscroll down here. You'll go to the Cloud\nStacks tool. And then you'll be able to\nadd a page to your website that you're\ngoing to get this backlink set up on.\nAnd so you can type in all the different\nmain pages of your website. The\nhomepage, about page, contact page, the\nFAQ's page. We've added a few here. And\nthen you'll just click add cloud stack.\nYou'll type in that page of your website\nwith the appropriate path on the end.\nAnd then you'll type three keywords that\nyou're trying to rank that page for that\nwill help with that backlink because\nthat backlink will actually be an AI\ngenerated article on another website\nthat Search Atlas partners with and\nit'll send a backlink over to your site\nwhich like I said will show Google that\nyou're an authority. Now you've got\nanother backlink. The more backlinks you\ncan get, the more your website looks\nlike an authority and the more you rank\nhigher. And so you'll just type in that\nthat page of your website here, the\nthree different keywords that you're\ntrying to rank that page for here. And\nthen it'll add you and get you a\nbacklink on 13 different high quality\nsites, the ones that you see here. And\nso you're actually getting 13 back links\nby doing this one time. And it only\ncosts 15 credits, which is $15 in Search\nAtlas to get these back links. So you\ncan buy more authority for your website\nessentially and get back links to every\nsingle page of your website. And then\nyou can start going through pages again\nonce you've run out of pages to add them\nto. you can go back through pages and\njust change the keywords on them and get\nranked and get back links for other\nkeywords as well. And so, it's never\nbeen easier to get tons of backlinks to\nyour website with a few clicks of a\nGoogle Business Profile\nbutton. Backlinks are one of the best\nways to boost your website SEO. But here\nare two even easier ways that AI can\nhelp any business rank higher, and\nthat's through automating update posts\nand Q&As's on Google Business Profile.\nIf you go to Google business profile and\nyou scroll down, update posts are these\nlittle posts here that businesses can\nmake on their profile with an image and\na description. And really, this is just\nanother opportunity for this business to\nput keywords in this description and put\na good image that goes along with it.\nAnd this can help businesses rank when\nthey consistently make update posts to\ntheir business about different services\nthey offer, um, different promotions\nthey're doing, etc. And if we go back\nhere, the Q&As's are down here. So you\ncan type questions and you can also\nanswer your own questions as the\nbusiness owner, which lots of Q&As's on\nyour Google business profile. Just more\nopportunities to put keywords onto your\nprofile and get ranked higher for those\ndifferent keywords. And so inside of\nSearch Atlas, if we go into the auto\ntool here, we can scroll down and we can\nintegrate Google business profile into\nSearch Atlas. And we can go to this GBP\npost sections which are those update\nposts with the picture and the\ndescription. And it will automatically\npost. It'll generate pictures with AI,\nbut it'll also post and create an AI\ngenerated description. And it'll post\nthese on autopilot for us. It does it\nrandomly and sporadically, so Google\ndoesn't think it's a bot posting them.\nIt actually makes it look like a real\nhuman is posting them, but it does them\nevery few days and kind of at random\nthroughout the week. And it just gives\nyou tons of good images and just more uh\ndescriptions, more keywords that it's\nstuffed with here now, so you can rank\nbetter for these different things. And\nit just shows prof uh activity on your\nGoogle business profile. Shows that\nyou're doing something and updating\nsomething to your profile, which sends\ngood signals to Google that you're\nactively working on your Google business\nprofile and you'll get ranked higher\nbecause of this. All you have to do to\nset this up is turn this little toggle\nswitch on and it'll start automatically\nposting and AI generating these images\nand these descriptions and posting these\nto your Google business profile. Same\nthing if we scroll down here to the\nquestion and answer suggestions. It'll\nAI generate these Q&As's for you. It'll\ntype out a question and then it'll\nanswer that question. And all you have\nto do is toggle this switch on and it'll\nmake these updates, these update posts\nand these Q&As's to your Google business\nprofile completely on autopilot every\nfew days, which will just help rank you\nhigher on Google business profile, which\nis also tied into your website, so it'll\nhelp your website rank higher as well.\nGoogle Reviews\nSEO really doesn't get easier than this\none. You can fully automate posting on\nyour Google business profile with AI.\nBut there's one last AI tool that seals\nthe deal in this AI SEO strategy, and\nthat's automated Google review\nresponses. Replying to all of the Google\nreviews that a business receives is a\ngreat way to boost their SEO, but it can\nalso be timeconuming to do if this\nbusiness is getting a ton of Google\nreviews. So, inside of GoHigh Level, we\ncan fully automate our review responses\nusing AI. And the way that you do that\nis go under the reputation tab. You'll\ngo to settings and then under this\nreviews AI section, we can toggle on\nauto responses first. And then we can\nset a wait time before it replies to the\nGoogle review. 25 minutes is good. just\nmakes it look more real, like it's a\nreal human instead of an AI responding\nto it. And then down here, you can\ncreate an AI agent with a certain\npersonality. You'll just click create\nagent. I've got one here. I'll click\nedit and show you. This is what it looks\nlike inside. You can name the agent.\nJust usually name it the name of the\nbusiness that you're helping um for\ntheir SEO. And then you can have a\ninstructions for it here. Just a short\nprompt. You can select the tone of\nvoice. I like to do friendly. And then\nyou can select the language. You can\nalso make it dynamic where if someone\nleaves a Spanish review, it'll reply\nback in Spanish. And then review source,\nyou can um set it up on Google. You can\nalso do it on Facebook as you can see\nhere. So it'll auto reply and use AI to\nreply to all the Facebook reviews as\nwell as Google. And then right here,\nreview type. You can say uh I only want\nit to reply to my four and five star\nreviews. I typically will set it up to\nreply to all reviews. We only we don't\nwant just the high reviews to get\nreplied to. We want the low ones to get\nreplies as well. And then you can have a\nfooter at the bottom of all the all the\nGoogle review replies saying, you know,\nthank you and then the name of the\nbusiness. And then you save that. And\nnow it'll auto reply using AI to all of\nthe Google reviews uh that are left on\nthe Google business profile and Facebook\nas well. If you guys want to sign up for\nGoHigh Level, this is the software I use\nhere, and that's where I build all of my\nsmart websites as well that we build to\nhelp our clients rank with their SEO,\nyou guys can get a 30-day free trial of\nit down below this video. And if you use\nmy link, go High Leo pays me a\ncommission. So, in return, I'll jump on\ntwo free Zoom calls with you every\nsingle week for life. And I'll help you\ngrow your agency, and I'll give you over\n50 plus custom smart website templates\nthat were built by my amazing web\ndesigner, Mike. And you get those\nabsolutely free just for using my\naffiliate link down below. If you use\nthe seven AI SEO cheat codes that I just\nshowed you, you can get almost any local\nbusiness ranked on the first page of\nGoogle and top five on Google Maps\nwithin just 3 to 4 months. But there are\nstill a lot of other moving parts to\nrunning a successful agency that I\nwasn't able to cover in this video. So,\nif you want to learn how to start, set\nup, and scale your own smart website\nagency, then check out my free Highle\nQuest community down below.",
      "start": 0,
      "duration": 0
    }
  ],
  "word_count": 3228,
  "language": "en",
  "is_generated": true,
  "method": "manual-import",
  "scraped_date": "2025-11-01T19:27:24.539838"
}