{
  "title": "00M Lead Nurture Playbook by Alex Hormozi",
  "type": "book",
  "author": "Russell Brunson",
  "added_date": "2025-11-01T21:15:37.194693",
  "word_count": 13946,
  "entries": [
    {
      "text": "$100M Playbook:\nLead Nurture\nHow to get more leads to respond,\nschedule, and show\nALEX  HORMOZI\nDisclaimer\nThe information provided in this book is for educational and informational purposes only. The author,\npublisher, and licensed distributor have made reasonable efforts to ensure that the information within was\naccurate at the time of publication. The author, publisher, and licensed distributor make no representation\nor warranties with respect to the merchantability, fitness for a particular purpose, current or continued\naccuracy or completeness, and reliability of the contents of this book.\nThe strategies, tips, and tools discussed in this book are the author’s personal opinions and are provided\nas-is. They are intended to provide helpful and informative material on the subjects addressed in this\nbook. Success in any marketing and business endeavors is based on a wide range of factors unique to\neach individual or business.\nLaws are subject to change and may vary by location and jurisdiction. You, as the reader, are encouraged\nto consult with a professional where appropriate and review the current local laws before implementing\nany marketing strategies or campaigns.\nEarnings and income representations made by the author are aspirational statements only of your\npotential earnings. The success of the author and others referenced herein, testimonials, and other\nexamples used are exceptional, non-typical results and are not intended to be and are not a guarantee\nthat you or others will achieve the same results. Individual results will always vary and your results\nwill depend entirely on your individual capacity, work ethic, business, skills and experience, level of\nmotivation, diligence in applying the strategies discussed, the economy, the normal and unforeseen risks\nof doing business, and other factors within or beyond your control.\nNo guarantee is made that you will achieve any result at all from the ideas in this book. The author,\npublisher, and licensed distributor disclaim any representations or warranties (express or implied),\nincluding, without limitation, those of merchantability, fitness for any particular purpose, current or\ncontinued accuracy or completeness, and reliability. Reliance on the information provided is solely at\nyour own risk. As further described herein, the author, publisher, and licensed distributor shall in no\nevent be held liable to you or any party for any direct, indirect, punitive, special, incidental, speculative,\nor other consequential damages arising directly or indirectly from any use and/or misuse of this book,\nwhich is provided “as is”, and without warranties.\nAs always, the advice of a competent legal, tax, accounting, finance, or other professional should be\nsought and obtained.\nAny statements that express or involve discussions with respect to predictions, goals, expectations,\nbeliefs, plans, projections, objectives, assumptions or future events or performance are not statements\nof historical fact and may be “forward looking statements.” Forward looking statements are based on\nexpectations, estimates, and projections at the time the statements are made that involve a number\nof risks and uncertainties which could cause actual results or events to differ materially from those\npresently anticipated.\nRunning a business involves the risk of loss as well as the possibility of profit. All businesses involve\nrisk, and all business decisions remain the responsibility of the individual. The author, Bumble IP, LLC,\nAcquisition.com, LLC, and their affiliates (collectively referred to herein as the “Company”) have not\nmade any guarantees that the strategies outlined in this book will be profitable or beneficial for you or\nyour business, and the Company is not liable for any potential business losses related to these strategies.\nThe Company’s representatives are professionals, and their results are not typical of the average\nindividual. Background, education, effort, and dedication of individuals and business owners will affect their overall experience. Any examples shared in this book are merely illustrative and not guarantees of a return on businesses or other result. Each reader’s results may vary. The Company does not warrant the performance, effectiveness, or applicability of any sites listed or linked in this book. All links are for informational purposes only and are not warranted for content, accuracy, or any other implied or explicit purpose. All the information provided in this book pertaining to running a business and business strategies is educational only and not specific guarantees of success. Even though reasonable precaution\nhas been taken in the preparation of this book, the Company does not assume any liability for errors\nand/or omissions. This book is published without warranty or guarantee of any kind, either expressed or\nimplied. The Company is not liable for any damages, regardless of whether arising directly or indirectly\nfrom the use and/or misuse of this book. Readers agree to release and hold harmless the Company and its\nmembers, employees, agents, representatives, affiliates, subsidiaries, successors, and assignees (collectively\n“Agents”) from and against any and all claims, liabilities, losses, causes of actions, costs, lost profits, lost\nopportunities, indirect, special, incident, consequential, punitive, or any other damages whatsoever and\nexpenses (including, without limitation, court costs and attorney’s fees) (“Losses”) asserted against,\nresulting from, imposed upon or incurred by any of the Agents as a result of, or arising out of the reader’s use and/or misuse of this book. This book is intended for informational and educational purposes only.\nHYPOTHETICAL PERFORMANCE RESULTS HAVE MANY INHERENT LIMITATIONS, SOME OF\nWHICH ARE DESCRIBED BELOW. NO REPRESENTATION IS BEING MADE THAT ANY BUSINESS WILL OR IS LIKELY TO ACHIEVE PROFITS OR LOSSES SIMILAR TO THOSE SHOWN OR DESCRIBED. IN FACT, THERE ARE FREQUENTLY SHARP DIFFERENCES BETWEEN HYPOTHETICAL PERFORMANCE RESULTS AND THE ACTUAL RESULTS SUBSEQUENTLY ACHIEVED BY ANY PARTICULAR BUSINESS. ONE OF THE LIMITATIONS OF HYPOTHETICAL PERFORMANCE RESULTS IS THAT THEY ARE GENERALLY PREPARED WITH THE BENEFIT OF HINDSIGHT. IN ADDITION, HYPOTHETICAL BUSINESS DOES NOT INVOLVE FINANCIAL RISK, AND NO HYPOTHETICAL BUSINESS RECORD CAN COMPLETELY ACCOUNT FOR THE IMPACT OF FINANCIAL AND OTHER RISK IN ACTUAL BUSINESS. FOR EXAMPLE, THE ABILITY TO WITHSTAND LOSSES OR TO ADHERE TO A PARTICULAR BUSINESS STRATEGY IN SPITE OF BUSINESS LOSSES ARE MATERIAL POINTS WHICH CAN ALSO ADVERSELY AFFECT ACTUAL BUSINESS RESULTS. THERE ARE NUMEROUS OTHER FACTORS RELATED TO THE MARKETS IN GENERAL OR TO THE IMPLEMENTATION OF ANY SPECIFIC BUSINESS PROGRAM, WHICH CANNOT BE FULLY ACCOUNTED FOR IN THE PREPARATION OF HYPOTHETICAL PERFORMANCE. When used herein, this “book” means this book, its contents, and all information and ideas contained therein.\nCopyright © 2025 by Bumble IP, LLC and distributed via license by Acquisition.com, LLC. Reproduction\nor translation of any part of this work beyond that permitted by Section 107 or 108 of the 1976 United States Copyright Act without the permission of the copyright owner is unlawful. Acquisition.com®, its logo, and $100M® are all registered trademarks of Bumble IP, LLC and utilized via limited license by Acquisition.com, LLC. All rights reserved, including rights for text and data mining and training of artificial technologies or similar technologies.\nv\nCopyright © 2025 by BUMBLE IP , LLC NOT FOR DISTRIBUTIONTable of Contents\nLead Nurture   . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 1\nFour Pillars of Lead Nurture   . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 5\nPillar I: Availability   . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 7\nPillar II: Speed   . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 13\nPillar III: Personalization   . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 19\nPillar Iv : volume   . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 27\nExecution   . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 33\nLead Nurture Checklist   . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 39\n1\nCopyright © 2025 by BUMBLE IP , LLC NOT FOR DISTRIBUTIONLead Nurture\n“If they do not show, they cannot buy.”\nJune 2020.\nCOVID suffocated us. Government mandates made business all but impossible for\nbrick-and-mortar gyms. Gyms, my only source of customers, were outlawed. This made it\ndifficult to sell them services. How can you make money when your customers can’t make\nmoney? Newsflash. You can’t. Tough.\nI did what any entrepreneur would do—try and stay alive. What  to do became clear.\nIf I couldn’t sell to brick-and-mortar gyms anymore, I’d have to sell to somebody else. But\nthis presented a whole host of other problems.\nI’d spent the last six months developing a software I called ALAN. The name was\nshorthand for Artificial Lead Automation & Nurture. It automated appointment-setting\nand reminded people to show up to those appointments... in person . All three of my\ncompanies relied on brick-and-mortar stores being open—and they weren’t. I felt really\ndumb. To make matters worse, the software was “pay per show.” And since no one\nwas showing up to brick-and-mortar businesses, nobody was paying for the software.\nTough. Again.\nI couldn’t service businesses that did in-person sales. That meant I needed  to find\nopen businesses selling via phone or video. Thankfully, I found my ideal customer right\naway. After asking around, marketing agencies serving “essential businesses” had more\nwork than ever. And if I got them as customers, their customers could also become my\ncustomers. Double whammy. And the sale was easy. I got my first ten agencies on board\nin no time.\nAnd since each had 10 to 50 customers, I had a few hundred customers overnight. I\nthought we would make money again. But it was a total disaster.\nThe problem: None of the important gym software features transferred to other\nbusinesses well. I put all my energy into getting gym leads to show up for in-person\nappointments. But I also assumed it would be an easy swap to other businesses using\nphone or video appointments. And in some cases, going to the customer’s home. Nope.\nI had two weeks to figure out every type of appointment for every other type of business\nunder the sun… or everyone  would cancel. Even worse, they’d all hate me. And for good\nreason—the product would have failed them. I’d have failed them.\n2\nCopyright © 2025 by BUMBLE IP , LLC NOT FOR DISTRIBUTION$100M PLAYBOOk: LEAD  Nur TurE\nFor context, the tool started “managing” 4,000+ appointments per day . Managing to\nscrew them up, that is. I wanted to fix it, but it just had way more data than I could ever\nhope to sift through. So I did what any reasonable entrepreneur would do— hire the best\ndata person I could afford.\nEnter: Vlad (name changed to conceal his identity). Vlad won r ussia’s equivalent of\nthe machine learning Olympics. He was a data nerd, and brilliant. The day he came on,\nI said, “I know it’s your first day, but I only need one thing.” I opened a spreadsheet with\nabout a million rows of appointment data. “I need you to figure out what gets people to\nshow up to appointments.”\nHe stared for a moment at the document. Then, in his thick r ussian accent said,\n“Yes. I can do. When do you want it?”\nI said, “It’s my top priority. As soon as you can.”\nHe paused, then replied, “A lot of work. I think end of week.”\n“Great,” I said and started praying to the business gods.\nFriday morning.\n“I finished your data,” Vlad said.\n“Awesome—what did you find?”\n“Four data points correlate to positive appointments.”\n“Anddd??”\nVlad highlighted four columns of data. My eyes went wide with excitement.\n“Businesses managing these have more people showing up to appointments?”\n“Yes,” he said.\n“How many more?” I asked.\n“Many more.” Almost cracking what you might call a smirk.\nI was giddy as a schoolgirl. I might actually pull this off.  Immediately, I called an\n“emergency meeting” of all the agency owners to share the news about Vlad’s show-rate\nanalysis.\nFirst, the more time slots available, the greater the show rate.\n3\nCopyright © 2025 by BUMBLE IP , LLC NOT FOR DISTRIBUTIONLEAD  Nur TurE\nSecond, the fewer days out leads scheduled, the greater the show rate.\nThird, the more follow-ups there are, the greater the show rate.\nFourth, the more often leads responded to follow-ups, the greater the show rate.\nThese four points gave business owners something they could do to make money\nnow. You can only sell somebody if they show up to buy it. And buy, they did. And we\nstarted making money again. And it was good.\nVlad came on full-time and really helped us take ALAN to the next level. He found\nlots of little things that helped show rates to improve. This guide gives you everything I\nlearned in that business, which I sold to a larger competitor in 2021.\nDescription\nGetting leads to show up, like most things in business, isn’t just one thing. It’s many\nthings. And like we say at Acquisition.com, “There are no silver bullets, only golden BBs.”\nNow, you can take advantage of everything I learned without spending millions of dollars\nand years of your life on software development right now. And the best part is you can\nimplement and start profiting from all of it , today , for free.\nFirst, I need to define three terms to keep us speaking the same language: schedule\nrate, show rate, and throughput. Schedule rate  is the percentage of engaged leads who\nschedule an appointment. Show rate  is the percentage of scheduled leads that show up to the\nappointment . Throughput  is the total percentage of engaged leads that show up. Let me\nwalk you through an example:\nLeads: 100\nSchedule rate: 50%\nScheduled Appointments: 50\nShow rate: 50%\nShown Appointments: 25\nThroughput: 25% (25 shows out of 100 leads)\nShow rates matter so much because the more people who show up to buy your thing,\nthe more of your thing you’ll sell .\n4\nCopyright © 2025 by BUMBLE IP , LLC NOT FOR DISTRIBUTION$100M PLAYBOOk: LEAD  Nur TurE\nWhat would a 20–40% increase in revenue be worth to you? Well, if you ran 20%\nmargins… it would be 2x to 3x the profit of your business—and that’s just year one .\nThe problem is, most business owners don’t think much about it because they think:\n1) They can’t do anything about it 2) They don’t know what to do about it 3) They think\nthey have more important stuff to do. The only acceptable response is number three—\nbecause sometimes they do have more important stuff to do. But, in my experience, it’s\nrare to get better returns on not getting more people showing up to buy.\nI know it’s tough to see how much money you didn’t  make. But, once you learn to see\nthe money you didn’t make as money you’ve lost, the show rate becomes one of the most\nimportant numbers in your business. And the things I’m about to show you make it go\nup fast and risk-free .\nNext Up: The Four Pillars of Lead Nurture\nThis playbook covers medium-term lead nurture - aka - maximizing 30-day show rates.\nLead nurturing occurs after advertising and before sales. The time after they show interest\nin your thing but before  they buy it. I cover “long term follow up”—aka emails, podcasts,\nand content, in other places. This playbook solves one problem: maximizing 30-day show\nrates. And, to do that, you need to understand “the four pillars” of lead nurture.\n5\nCopyright © 2025 by BUMBLE IP , LLC NOT FOR DISTRIBUTIONFour Pillars of Lead Nurture\nYou must first become consistent before you can become exceptional .\nBased on all I’ve gathered from ALAN and across our portfolio companies (which\ngenerate upwards of 20,000 leads a day), show-ups have four main drivers:\n1) Availability: The number of open appointment slots you have.\na) Example : You are open seven days a week, 24 hours a day, compared to your\ncompetitor, who’s only open Monday, Wednesday, and Friday, 9 am to noon.\n2) Speed to contact: How fast you respond to leads and how far out you let them\nschedule appointments.\na) Example : You call the lead within 42 seconds of them opting in versus your\ncompetitor, who, on average,  takes 42 hours* to respond *(real data from\nInsideSales.com). Mind-blowing. It’s like business owners hate money.\n3) Personalization:  Making communication with leads useful and relevant to them .\na) The more personal the follow-up, the more likely they’ll respond. And the\nmore often they respond, the more likely they’ll show up.\nb) Example : You treat each lead with respect to the information they’ve provided.\nMeanwhile, your competitor just sends them templated responses.\n4) volume:  The number of times you reach out to leads before giving up.\na) Example : You reach out to your unresponsive leads 5+ times rather than giving\nup on average after 1.3 attempts* (with 44%* of salespeople stopping after the\nfirst attempt) (InsideSales.com & rAIN group). As wild as it sounds—them’s\nthe stats!\nTaken together, if you reach out to a lead the moment they express interest, make it\nconvenient for them to talk, frame the conversation as beneficial to them, and do it as\nmany times as you can, more people will schedule and show up to buy your thing— no\nmatter what you sell.  That being said, some industries have higher show rates than others,\nbut any business  can become best in class within their industry  at getting leads to show up.\nLet’s explore the first of the four pillars— availability .\n6\nCopyright © 2025 by BUMBLE IP , LLC NOT FOR DISTRIBUTION\n7\nCopyright © 2025 by BUMBLE IP , LLC NOT FOR DISTRIBUTIONPillar I: Availability\nIf leads cannot schedule, they do not show.\nJune 2021, on a work trip to Los Angeles.\n“I need to get my nails done,” Leila, my wife, said.\n“Okay—you know anyone out here in LA?”\n“No.”\n“So where you gonna go?”\n“I don’t know. I’ll just look on Yelp for the places closest to us.”\nShe called the first salon—nobody answered. *\nShe called  the next salon *—they pick up.\n“Hi there—do you have any openings within the next hour?”\n“No no openings. We can get you in tomorrow.”\n“No, thank you.”\nShe called a third salon —they pick up.\n“Hi there—do you have any openings within the next hour?”\n“We may have one time. Let me call you back.”\n“Can you just put me on hold?”\n“I have a call on the other line. I’ll call you back in a minute.” *click*\nShe called a fourth salon*—they pick up.\n“Hi there—do you have any openings within the next hour?”\n“Yep. We accept walk-ins. First & last name?”\n“Leila Hormozi.”\n“Is this a good number to reach you?”\n“Yes, this is fine.”\n8\nCopyright © 2025 by BUMBLE IP , LLC NOT FOR DISTRIBUTION$100M PLAYBOOk: LEAD  Nur TurE\n“I just texted your confirmation—did you get it?”\n“Yep. I got it.”\n“Great, you’re going to be with Nancy. I’ll let her know to prep for you. See you soon!”\nLater that month…\n“You’ve gotta be kidding me…THAT’s the biggest variable for show-up rates.” I said\nto Vlad.\n“Yes. very clear. An almost perfect correlation with throughput,” he replied.\n“So you’re telling me, more than speed, availability  is the biggest lever on getting\nmore leads to show?”\n“Yes. The number of days, hours per day, and time slots per hour, in aggregate, is the\nbiggest predictor.”\n“I mean, I guess that makes sense. One time slot will get fewer people to schedule and\nshow than 100.”\n“Yes, there are diminishing returns, but large increases still at the upper quartiles\nof availability.”\n“Man. This changes everything.”\nThe data was crystal clear for appointment-based businesses-–if leads do not schedule,\nthey cannot show. And if they cannot show, they cannot buy. On an absolute basis ,\nbusinesses with the most time slots had the most schedules, shows, and purchases.\nDescription\nAvailability is a combination of how many appointment slots you have and how far out\nleads can schedule them . And this makes sense. If you don’t have availability when leads\nhave availability, they either: a) don’t schedule at all or b) schedule at a bad time for them.\nBoth stink. The first, if nobody schedules, nobody shows, and nobody buys. The second\ncreates way more problems. They have a huge chance of skipping the appointment or\n“ghosting.” They’ll schedule at a time that’s bad for them, and when the appointment\napproaches, they’ll just skip it. If by some miracle they do show, they have a lower chance\nof buying because they have to manage scheduling annoyances. Third, they take a spot\naway from someone who would’ve liked the time, shown up, and bought… but now won’t!\nLet’s get to fixing it.\n9\nCopyright © 2025 by BUMBLE IP , LLC NOT FOR DISTRIBUTIONPILLAr I: A VAILABILITY\nIs More Availability Worth The Cost?\nLet me spoil the ending for you: Yes. Yes, it is. Now I’ve heard “I can’t be open any\nmore hours” more times than I care to count. But rest assured, you can. People really\nmean it’s not worth it for me right now . And that makes sense, at least until you realize the\ngiant pile of money you set on fire by making it more difficult for people to buy your\nstuff. If you make yourself more available to sell your stuff, you’ll get more chances to\nsell it. I’ve walked countless businesses through the tactics in this section and easily seen\n20–40%, sometimes 200%+ increases in appointments where people actually show up .\nAnd those translate straight to revenue and profits. So before you say, “I can’t,” think,\n“What would it actually  cost?” and “How much money do I burn by not doing this?”\nT rust me, it’s worth it.\nNow, let’s get into the tactics.\n**I made Episode 350 of my podcast, The Game, right when I first discovered\nthe sheer power of availability. Check it out on episode 350 of my podcast.\nTactics\nNow that we know more appointment availability means more people will show up\nto appointments to buy. Let’s make it happen.\n1) Take Appointments More Days Per Week: You pay your rent seven days per week.\nYou pay payroll seven days per week. You pay insurance seven days per week. You might\nas well make money seven days per week.\n10\nCopyright © 2025 by BUMBLE IP , LLC NOT FOR DISTRIBUTION$100M PLAYBOOk: LEAD  Nur TurE\nWanna make 40% more sales? Start booking appointments during the 40% of the\nyear people don’t. See, most people work five days per week. But by taking appointments\nseven days per week, you make your business 40%  more available  to accept money.  A good\nidea if you want more of it. And if you’re not quite there, just rip off the Band-Aid. If\nyou’re anything like me, I prefer to jump in head-first because this stuff always follows the\nsame pattern. First, it sucks. Then, it works. Then I kick myself for not doing it sooner.\n2) Take Appointments More Hours Per Day:  Be available to sell when your customers\nare available to buy. Not doing so would be like having a retail store open 9–5, Monday\nthrough Friday, and wondering where your customers are… AT WOrk MAkING\nMONEY!\nFor businesses that sell nationwide we found 6 am to 6 pm PST covers the highest\npercentage of sales in the uS relative to the hours. You can always go beyond those hours,\nof course.\n3) Give Leads More Flexible Appointment Times: Most businesses only allow leads to\nschedule every 30 or 60 minutes because they have 30- or 60-minute appointments. But\nthat makes things convenient for the business, not for the lead. Consider four scheduling\noptions per hour (12:00, 12:15, 12:30, 12:45, etc.) instead of one or two. Your bank\naccount will thank you. r emember, you can still keep your appointments the same length,\njust give people more freedom to choose when the appointment starts.  Some considerations:\nFirst, if you go at this alone, you’ll get some awkward times between appointments\nonce in a while. But, later we will discuss how to make the time between appointments\nextremely profitable.\nSecond, this may take extra salespeople to handle the extra volume… a good thing.\nMost salespeople cost less than what you’d make from a 20–40% increase in revenue.\nLast, if you qualify people and close them on separate calls (which I recommend\nfor more expensive stuff), then a 15-minute qualifying call solves this issue entirely. The\npeople who qualify leads and the people who close them just have separate schedules. It\nworks like a charm. And makes more money, too.\n4) Have Inbound, Outbound, and Self-Scheduling Options .  You can call leads  to set\nappointments. Leads can call you  to set appointments. And leads can schedule themselves\nonline. Do all three . The more ways you give people to book an appointment, the more\npeople will book an appointment. It’s that simple.\nA few tips to make online schedulers work better:\n11\nCopyright © 2025 by BUMBLE IP , LLC NOT FOR DISTRIBUTIONPILLAr I: A VAILABILITY\n1) Make sure the header confirms they’re in the right place. Then, tell them the\nnext thing to do and why to do it. (Header - Headline - Subheadline). See\nbelow for clarification for what the top of the page should look like. Header =\n**Attention Avatar**. Headline and subheadline are self-explanatory.\n2) Make available dates and times super obvious as soon as the page loads. You\nwant the time slots to be visible. This goes for mobile and desktop.\n3) Eliminate as many steps as possible. And if leads already gave you relevant info\nearlier in the scheduling process, don’t make them do it again . Tech now exists\nto eliminate fields they’ve already filled out and it creates huge improvements\nin schedule rates. Do not underestimate this .\nAuthor Note: My First Online Scheduler\nWhen I started doing this, there weren’t any online schedulers. Or at least, I\nhadn’t seen anyone using them. So the first version of my thank you page for\npeople opting into my gym was—“Thank you , you’ll be getting a text from\nXXX-XXX-XXXX shortly to book a time.” Then, I had the brilliant idea of\nputting an image of Leila and saying “Leila will be reaching out to you at this\nnumber.” Then finally, I had an even more brilliant idea: “Text Leila at this\nnumber with the time that works for you to come in.” And that CRUSHED.\nApparently no one cared about faceless Alex. But as soon as they saw a\npicture of a young in shape girl—both men and women were more likely to\nbook.\n12\nCopyright © 2025 by BUMBLE IP , LLC NOT FOR DISTRIBUTION$100M PLAYBOOk: LEAD  Nur TurE\nAuthor Note: Solution For Too Many Bad Appointments\nEliminating friction will increase the number of appointments booked. This\nis the first step to getting a show. But sometimes, you have too many bad\nappointments  on your calendar. When that happens—it’s okay to add friction.\nAdd a video to watch before they see the scheduler. Add a sales letter above\nthe scheduler, so they have to read it before booking a time. Add a price\nto the page so people know what they’re in for. Delay when the scheduler\nappears to make sure people are sufficiently qualified to book a time. These\nare just a few ways to decrease appointments and increase quality.\nThese are simple. And yet, no one does them. Most are afraid of the extra cost. But it’s\nnot about how much it costs. It’s about return on investment . And, in my experience, it’s a\nlot. More schedules. More shows. More sales. Good trade.\nNext up, we have speed. And yes, there’s more to it than meets the eye.\n13\nCopyright © 2025 by BUMBLE IP , LLC NOT FOR DISTRIBUTIONPillar II: Speed\nMoney loves speed. Wealth loves time. Poverty loves indecision.\nStatistic #1 : A 391% increase in sales conversions occurs when leads are contacted within\nthe first 60 seconds. Velocify.\nStatistic #2:  Companies that contact customers within an hour were 7x as likely to qualify\nthe leads as calling even an hour later. And 60x more likely than companies that waited\n24 hours. Harvard Business Review.\nStatistic #3 : 78% of customers buy from the company that responds to their inquiry first.\nLead Connect.\nSo… where do we go from here? Yeah, probably call leads faster . Now, you’re probably\nthinking this has similar obstacles to availability. And it does. Namely, it sounds like a\npain in the neck . It will cost you, and it will make you way more than it costs. What other\nsingle change can get a 4x+ increase in sales? Not many things.\nLike availability, the cost of getting to all leads immediately is excess capacity . Meaning\nyou have people on your sales team or front desk who are not going to have fresh leads\nall the time. The alternative is people are busy, and leads wait. But leads waiting to be\ncontacted leaves the door open for other competitors to steal them. Or, more realistically,\nfor boredom, distraction, and disengagement to steal them. No bueno. Let’s avoid that.\nHow T o Increase Speed T o Contact\nI increase speed in three ways.\n1) Speed To First Contact\n2) Speed To First Appointment\n3) Speed Of r esponse\n1) Speed T o First Contact : First contact refers to how long it takes you to call or message\nleads after they express interest in your stuff. For example, when they reply to ads, join\nyour list, or self-schedule. And the stats at the beginning of this section tell a chilling\n14\nCopyright © 2025 by BUMBLE IP , LLC NOT FOR DISTRIBUTION$100M PLAYBOOk: LEAD  Nur TurE\nstory—just how much money business owners burn by making first contact too slow.\nBut, if you made the availability changes, especially the time slot one, your team will now\nhave some gaps in their calendars. And guess what they have now… time to immediately\ncontact leads. So we don’t waste time at all. We use it to contact our leads way faster.\nThis reveals another massive benefit to making “contact all leads in five minutes or\nless” the gold standard. The slower you contact leads, the more times you have to contact\nthem before they buy. The faster you contact leads, the fewer times you have to contact\nthem before they buy. So if you work your leads faster, you won’t have to work them as\nmuch —a rare instance where “work less to make more” is actually true .\nPro Tip: Speed Litmus Test\nIf you aren’t getting “man that was fast! You guys are on top of it!” At least\nonce a day, you’re not calling your leads fast enough. Why wouldn’t you want\nto impress someone as a first impression and make more money?\n2) Speed T o First Appointment\nSpeed To First Appointment means the amount of time between scheduling a sales\nappointment and having the sales appointment.  The shorter the delay between scheduling\nappointments and having them, the higher the show rate gets.  And more people showing up\nto sales appointments means more people buying your stuff. I recommend two things to\nmake appointments happen sooner.\nLimit people to scheduling three days out max. Again, the sooner they schedule, the\nbetter. If you let people schedule meetings much beyond three days, you’ll get more\npeople to schedule, but you’ll also have more people ghosting. A triple loss. First, because\na person ghosted you. Second, because enough ghosted meetings kills the morale of the\nsales team. And third, because the ghost stole a convenient time from a person who may\nhave otherwise bought.\nEx: If today is Monday, you want T uesday and Wednesday to be available. Always\n72 hours in advance. Why? Because appointments that schedule closer, show higher. So,\nmake that the policy.\nNote: You can get away with five days if you have to , I just prefer three. In either case,\nkeep tabs on show rates and find the sweet spot for your business.\n15\nCopyright © 2025 by BUMBLE IP , LLC NOT FOR DISTRIBUTIONPILLAr II: SPEED\nPro Tip: Get Leads To Schedule Sooner: Crush Scheduling Obstacles\nIf leads don’t want to schedule within the next 72hrs, we see that as an\nobstacle. It’s rare that someone can’t actually make time for something if it’s\nimportant. So let me tell you a little tip I learned from my gym days.\nWhen I’d call a lead, I’d ask them what days they planned on working out. This\nwould give me multiple days per week. As soon as I had that, I would use the\ntime they said they wanted to work out to justify that this appointment is\nthe first step. This thinking process applies to anything. If you have a service\nwhere someone has to do something, the time they planned on doing it, you\ncan ask up front and then use that time as when they can come in/schedule.\nPull appointments forward—preferably to that day. Show rates for same-day\nappointments are higher than not same day. And show rates for I’m talking to you right\nnow are 100%. So that becomes the objective. When we call to schedule people, we have\nfive possible outcomes.\n1) Doesn’t respond. We would remove this person from the calendar (or double\nbook if in-person).\n2) Contacted and unqualified. r emove from the calendar and give free useful stuff\nor references if you can. Or— if you have an appropriate downsell, you can offer it.\n3) Contacted, qualified, and free right now. This is the best scenario. You’re guaranteed\na show because you’re already talking to them. If the same people set and close,\njust go for the close. If not, do a “hot handoff” to an active closer. I’ll show you\nhow in a second.\n4) Contacted, qualified, and pulled appointment forward. I’ll give you the script in\na second.\n5) Contacted, qualified, and appointment confirmed.\nHere’s how to make this work in the real world:\nremember that time we bought ourselves between appointments? right. If there are\nno fresh leads to contact and schedule, then calling leads who self-scheduled to pull their\nappointments forward becomes the second priority. The script goes like this:\n16\nCopyright © 2025 by BUMBLE IP , LLC NOT FOR DISTRIBUTION$100M PLAYBOOk: LEAD  Nur TurE\nHey, this is Jim… calling from XYZ on a recorded line… I saw that you just booked a\ntime for our X on Monday. Just calling to confirm some details before your appointment. Is\nnow a terrible time?\n(WHO) Great… So I see you are a [qualification 1], is that right? Awesome.\n(WHAT THEY WANT) And you’re looking to [qualification 2], is that correct?\n(WHAT THEY’RE STRUGGLING WITH) And what are the things you’ve tried so far?\nGot it. What else? Got it. So this is a priority for you to fix or [bad thing] happens. Is that\nfair to say?\nOkay great. Well, two things. First, good news: I think we can help you out. Second, better\nnews: I have an opening that canceled later today at 4 pm for us to get you all squared away…\nunless now is a good time?\nYou either go into the sale after qualifying them, move up their appointment, or,\nworst case, you qualify them and re-confirm their time. Which if you need to do that,\nyou say:\nNo worries at all. We always like to offer more times to make it convenient. We want to\ncost you as little time as possible. So we’re all good for two days from now at 4 pm. Is there any\nreason you think you won’t be able to make that appointment?\nThen, you either text them a confirmation from your phone if you’re having the\nappointment, Or you connect them in a three-way message with the closer who is going\nto take the appointment (this is the hot hand off I referenced last page).\nIf you are connecting with someone else, you then take a second to edify the person\nthey’re going to speak with. It would go something like this:\nYou’re in luck. You’re actually going to speak with one of our top experts on X. He’s been\nin this game for a while and helped Y [businesses, people that you match to their description]\nachieve [thing that they want]. We’re fortunate to have him. He’ll definitely be able to help you\nwith that. Let me check his calendar really quickly. [pause] (if you changed their time) Yep -\nI’m gonna slide you in so you can get this taken care of ASAP . (if you didn’t change the time)\nYep - you’re all confirmed and good to go.\nThe moment we get off the call, I’m going to introduce you to him via text message. Does the\nXYZ number work? Great. Alright. Have an amazing day, and enjoy your time with CLOSER.\nOnce you do that, you’ve worked your leads and optimized their outcomes for\nmaximum possible show-ups. And yes, it probably means your current sales team is\nunderstaffed for maximum selling. Opportunity for improvement!\n17\nCopyright © 2025 by BUMBLE IP , LLC NOT FOR DISTRIBUTIONPILLAr II: SPEED\nWith that being said, we go to the third element of speed: responsiveness leading up\nto appointments.\n3) Speed of Response\nThe last element of speed is how fast you get back to leads after they schedule\ntheir appointment and before it happens. This is where leads “fall through the cracks.”\nFortunately for us, and unfortunately for our competitors, leads often make buying\ndecisions before  the sales call, and that makes it the competitor’s sale to lose. Imagine\ntwo scenarios:\nScenario #1 : You opt in. You get contacted immediately. Confirm your appointment.\nThen, after you get off the call, you text a question. No one responds until the next\nbusiness day. What do you do? You probably assume they’re scattered and disorganized.\nYou probably stop asking questions because you don’t feel like waiting again. But let’s say\nyou decide to send another message. Now, they respond the next business day again. Not\na good experience, right? You may as well communicate by carrier pigeon. You feel like\nthey’re not prioritizing you— because they’re not . If they don’t show up for you, why bother\nshowing up for them?\nScenario #2 : You opt in. You get contacted immediately. Confirm your appointment.\nThen, after you get off the call, you text a question. They immediately respond. You ask\nanother question. Ding! Another response back. Then - ding! - the closer adds context.\nYou got your question and follow-up question answered within a minute. These guys are\non top of it!\nWhich one is better? Obviously scenario two.\nEvery messaging service provides time stamps. use them. Every incoming call and\noutgoing call has a time stamp. u se them. And plenty of software exists to consolidate\nit all. So, if show rates drop, look here first—especially if they drop for a particular rep.\nTheir performance will also show who puts in the extra time. And you best encourage\nthat (if you want to make more money) because, after all, leads never sleep.\n18\nCopyright © 2025 by BUMBLE IP , LLC NOT FOR DISTRIBUTION$100M PLAYBOOk: LEAD  Nur TurE\nSpeed Summary\nYou gotta be fast. You need to reach out quickly. And you gotta get them in a sales\nmeeting as soon as possible. If you do, you’ll contact more of them, follow up less, and\nsell more. When you speak to them, aim to set appointments inside 72 hours. So—same\nday, next day, day after. Or, of course, sell them right then and there. And if, for whatever\nreason, you haven’t scheduled the appointment, or you did schedule and they reach back\nout, respond  fast! It’ll show them you’re serious and prevent undoing all the hard work\nyou did to get them.\nNext up\nSo, we’ve covered availability and speed. If you only did those things, you’d make\na lot more money. But we’ve still got a lot more money on the table. Let’s grab it! Next\nstop: personalization.\n19\nCopyright © 2025 by BUMBLE IP , LLC NOT FOR DISTRIBUTIONPillar III: Personalization\nPersonalize, don’t pressure.\nIn 2020, one of our ALAN beta testers had show rates well beyond any of the other\nbusinesses in the test group. I tried to figure out what in particular they did, but I found\nnothing. They had the same open loop conversations, the same messages, the same\ncadence—it all looked the same. But they did so much better… Why?\nI reached out to the business owner and asked if he did anything special. He, of\ncourse, said no. Then, we reviewed his ad campaigns together. They also looked pretty\nnormal. He shrugged and said, “I guess we’ve just got people who love us.” It caught me\noff guard.\n“What do you mean, they love you? They’re leads, they don’t even know you yet.”\n“Well, yea. I mean, we try and over-deliver so they want to show up.”\n“What do you mean?”\n“We give them a gift when they get here.”\n“Do you tell them?”\n“Yea, we text them on a separate iPhone outside of the system”— aha! No wonder I\ncouldn’t see it— and say, ‘Hey, I’ve got a shirt here waiting for you. Do you prefer black or\npink?’ And as soon as they respond with a color—we’ve got em.”\n“Wait. So if someone tells you the color they want, they show up?”\n“Yea, almost every time.”\nBingo. That was it. But this time, it’s personal .\nDescription\nPersonalization means making yourself useful, relevant, and pleasant  to individual\nleads. So, we figure out what they want, get that thing for them, and then tell them they\ncan have it if they show up. If the lead knows they’ll get value just for showing up, then\ntheir chance of showing up goes up with it. Nobody wants to waste their time, so this\n20\nCopyright © 2025 by BUMBLE IP , LLC NOT FOR DISTRIBUTION$100M PLAYBOOk: LEAD  Nur TurE\nlowers their risk. Plus, it raises their opportunity cost. If they skip it, they miss out on\ngetting something they find valuable. This makes the value of the appointment itself much\nhigher. So we want to remove the risk of not getting what they want. And by extension,\nincrease the likelihood they show up to get it.\nNow that we understand the concept, let’s get tactical.\nPersonalization Tactics\nI personalize to boost show rates in six ways. They are:\n1) use The Lead’s Preferred Communication Method  - Talking to leads where they want\nto talk.\n2) Qualify The Leads - Collect data then remove leads from the calendar that are unlikely\nto buy, to free up time for those who are more likely to buy.\n3) Best Leads to Best Closers - Connect the leads most likely to buy with the reps most\nlikely to close.\n4) Segment Your Messaging  - Talk to leads about stuff relevant to them.\n5) Incentivize Showing u p - Give them a reason (or multiple reasons) to show up.\n6) Demonstrate Proof  - Show the successes and positive experiences of people just like\nthem.\n1) Use The Lead’s Preferred Communication Method\nHow do you initiate contact with leads after they opt-in? Text? Email? Direct Message?\nPhone Call? The answer? All of them. kinda. Hear me out.\nYou want to start communication in multiple ways but continue  communication\nwhere they respond. So, when someone opts in, message them on multiple social media\nplatforms, text, call, and email. The works. Then, wherever they respond, prioritize that\nmedium for them. Eventually, you’ll get people on the phone, on a video call, or in\nperson. But, to get things started, take the path of least resistance.\nLet’s say we call, text, DM, and email a lead, but they respond via DM first. What\ndo we do? Continue the conversation there. We can switch to a richer medium later (like\nphone call, Zoom, or video call). This sounds basic, but so many people only reach out\none time on one platform. Big mistake.\n21\nCopyright © 2025 by BUMBLE IP , LLC NOT FOR DISTRIBUTIONPILLAr III: P ErSONALIZATION\nAlso, you’ve gotta reach out like you’re actually  trying to get ahold of them—not just\ngoing through the motions. Think about it. Imagine you needed to get ahold of your\nparents because of some issue. What would you do? You would call multiple times, text,\nDM them, and maybe even email them. You would call their friends to see if they know\nwhere they are. Or the front desk if they live in a building. You would do whatever it took\nto get a hold of them.\nThese leads need you to help them . You only do them a disservice by not reaching out\nto them like you mean it especially after they said they wanted help! So, reach out in\nmultiple ways in multiple places.\nBottom line : You will get higher initial response rates by starting conversations in as\nmany ways as you can, and then continuing conversations in the way they prefer.\n2) Qualify The Leads\nA while back, I got to look under the hood of a weight loss company with exceptional\nshow percentages and high profits—especially for their small size and boring product.\nWhat I saw shocked me… they actively canceled  sales appointments. Blasphemy!\nOn the one hand, this owner clearly hated money. Who cancels sales appointments!?\nOn the other hand, he made way more money in weight loss than most anyone else. So\nwhat gives? This conundrum led me to do what any other curious person would do —ask\nabout it . And I found the answer surprisingly refreshing.\n“Every lead fills out an application before the sales call,” he said. “And, based on\ntheir answers, I can just tell who is going to be a fit. And that’s when it dawned on me.\nHe’s qualifying his leads. As a result, he spends way more time  working good leads and\ncompletely ignores the bad ones. Brilliant.\n3) Send The Best Leads T o The Best Closers\nAround the same time, I got introduced to a guy who lived in my building. He was\nthe number one sales rep for the number one timeshare company in the uS. They have\nnearly 3,000 sales reps, and he finished first in five out of the last six years. I was obviously\ninterested to hear what he had to say.\nAt dinner, I asked him, “So what’s your secret?” A grin spread across his face. He put\nhis arms on the table and leaned in. “When I finally won my first year, I got to have a\n22\nCopyright © 2025 by BUMBLE IP , LLC NOT FOR DISTRIBUTION$100M PLAYBOOk: LEAD  Nur TurE\nsixty-minute meeting with the CEO. Normally it’s just a formality, and nothing happens.\nBut, I was determined to change things. He asked me what I thought we could do to drive\nmore sales. I told him, ‘You’re wasting all the good leads on these junior reps. Meanwhile,\nI waste two-thirds of my time with people who have 500 credit scores. Just give me the\nbest leads, and I’ll make you a lot of money.’ It took me the rest of the time to convince\nhim to just try it at my local office. The next year I 5x’d the production of the office. They\nthen rolled it out nationwide, and the company went from $200M to $1B a year in sales\nover the next five years.” He leaned back on his chair, satisfied with his accomplishment.\nAnd, as obvious as this all was, I hadn’t even been doing it in my own companies! I\nbegan implementing it and profiting immediately.\nStep 1 : Look at your best customers. The actions they take and the people they\nare (demographics).\nStep 2 : Ask those questions in your opt-ins, applications, and during the time before\nsales appointments.\nStep 3 : Score leads on a 1–5 or red-yellow-green system based on how qualified\nthey are.\nStep 4 : route your best leads to your best closers.\nStep 5 : Enjoy the fruits of your labor.\n4) Segment Your Messaging\nPlain and simple, we want the right message for the lead. For instance, Hubspot\nimproved their email marketing r OI by 7x after segmenting their list. So, now that you\nhave your leads segmented via scoring, nurture them in a way that’s more aligned with\nwhat you know about them. That’s easy to say, so I’ll break this into two versions: easy\nand hard.\nEasy: The simplest version of this is to look at their profiles, look up their websites, and\nsearch them. See what they’ve recently done. It takes five minutes of preparation before you\nspeak with a lead—or, reach out to them to get way higher response rates. Now that you\nknow the good leads from the bad ones, start doing your homework on the good ones.\nFor example, you might say, “Hey Greg, I see that your site traffic is down 18% this\nquarter, we had another customer in a similar situation. They’re now up 100% 90 days later.\nI prepped a walkthrough to show you how we can apply the same principles to your auto shop.”\n23\nCopyright © 2025 by BUMBLE IP , LLC NOT FOR DISTRIBUTIONPILLAr III: P ErSONALIZATION\nAt the very least, when you introduce yourself to the lead, have some idea of who they\nare and mention it upfront and early. People are more likely to listen and pay attention to\nsomeone who behaves like someone they know.\nHard : This one takes more time upfront but less on a regular basis. Set up emails\nand texts for every category of lead that comes in. For example, if you ask businesses\ntheir revenue level, have a different sequence for businesses of that revenue level. If you\nask people their desired weight loss, send them case studies and content relevant to that\namount of weight. Make your nurture sequences specific to the pains these people deal\nwith.\nJust bite the bullet. Drink your energy drinks. Block a weekend. And just go ham.\nGet all the text and email sequences lined up for each situation. Once you have it, you’ll\nthank me later for your higher responses.\nBottom Line:  More schedules. More Shows.\nPro Tip: Get Your Team iPhones For Texting\nSpam, automated messages, and other junk most often come as (green?)\nmessages. Most messages from real humans come as blue messages. If you\nsend blue messages, you’ll get more responses. The tech will change over\ntime, but if there’s ever something like this in the future where it’s a ‘pseudo-\nhuman’ verification, I would invest in it. It’s always been worth the increased\nresponse rates.\nPro Tip: Local Area Code Call Wrapping\nLocal area codes have significantly higher pick up rates than unrecognized or\nout of the area codes. There’s technology that can dynamically switch your\narea code when calling prospects to their local area. This results in higher\npick up rates (by a lot). I recommend the investment.\n24\nCopyright © 2025 by BUMBLE IP , LLC NOT FOR DISTRIBUTION$100M PLAYBOOk: LEAD  Nur TurE\n5) Incentives\nI’ve seen incentives used in two ways: “push” and “pull.” A push incentive means\nthey do the good stuff before they arrive  with the intention to evoke reciprocity. A pull\nincentive means the lead gets good stuff after they arrive  with the intention to motivate\nthe action. Both are a kind of social contract.\nGift Card “Push” Incentive:  The first way I’ve seen this used is—you simply give the\nlead a gift card. I wouldn’t obsess about the amount. Just make it enough that it isn’t\ninsulting. And to be clear, they get the gift card you send whether they show or not . This is a\ngift. And gifts have no strings. Here’s how it would sound in reality:\n“Hey Name! I just wanted to make sure you are caffeinated for our meeting tomorrow.\nCheck your email. I just sent you a $5 gift card.”\nAnd what do ya know, more of them show up. And yes, you can do this with any\nbusiness. Let’s say you have a brick-and-mortar beauty chain. It would go like this:\nProspect opts in → They get a call within 5 minutes → I say:\n“Hey Name! Since you are a first-time client, I’m going to set aside some free products for\nyou. Would you want face cream or hand lotion?\n“Face cream!”\n“Awesome, I will have it waiting for you tomorrow.”\nThis strategy hinges on reciprocity. And here’s the crazy part. Even when people know\nwhat you’re doing— it still works . They feel like they owe you one. Which also means an\nincrease in close rate. Not the point of this playbook—but— it doesn’t hurt .\nA/B “Pull” Incentive:  The first incentive was a gift. The second is a bribe . Here’s how\nit works:\nLeads choose what they get when  they show up. But both choices assume they’ll show.\nBut you want to show you’re incurring a cost on their behalf.\nYou can make anything  an A/B offer. Just to give you a few ideas… Quantity (Do you\nwant one bottle or two?), start dates (start tomorrow or Monday?), type (shirt or shorts?),\npayment preference (cash or card?), flavors (chocolate or vanilla?), time slots (morning or\nafternoon?), media (read or listen?), delivery speeds (standard or overnight?), sizes (small\nor medium?), colors (black or white?), materials (paper or plastic?), personnel (John or\nSara?), communication (call or text?). Again, with some creativity, you can make anything\nan A/B offer.\n25\nCopyright © 2025 by BUMBLE IP , LLC NOT FOR DISTRIBUTIONPILL A r III: P E r SONALIZATION\nA/B Incentives depend on three things. First, leads should want the thing. Second, it\nshould have obvious connections to the thing you’ll offer them. Last, that you incurred\nsome real cost by preparing it.\n6) Proof\nShowing people proof, case studies, and other testimonials gets people excited to\ntalk to you about your product or service. When people get excited to talk to you about\nit, more show up ready to buy. So weave your proof into messaging. And—if you want\nto be a super ninja—personalize it. Match the proof to the lead. If you are talking to an older white male professional, then show him the results of other older white male\nprofessionals. If you are talking to a female weight loss lead, send her a lead of someone\nher age, ethnicity, and around her weight, and so on. The closer the match, the better. Obviously be compliant with the proof you send—which varies by state and country.\nWeave your proof in:\nAfter they schedule and before they show.\nBetween the first and second call.\nIf they ghost, every 90 days. Show them the results of people who signed up about\nwhen they ghosted. This makes them feel left behind but still gives them the option to\nmake up for lost time.\nI made an entire playbook on Proof, so I won’t go into more detail here. But—weave\nit everywhere you can. It makes your stuff more compelling, and this will motivate more of them to show.\nPersonalization Summary\nI increase show rates using personalization in six ways: 1) use multiple communication\nchannels initially, then continue where leads respond first. 2) Qualify leads through applications, then focus time on the most promising prospects while canceling\nappointments with poor fits. 3) route y our best leads to your best closers by scoring\nthem on a 1–5 or color-coded system based on qualification criteria derived from your top customers. 4) Segment messaging to ensure relevance, either by researching each\nlead before contact or creating different nurture sequences for each lead category. 5)\nOffer incentives through either “push” methods (giving gifts before appointments to\ncreate reciprocity) or “pull” methods (offering A/B choices that assume attendance and\n26\nCopyright © 2025 by BUMBLE IP , LLC NOT FOR DISTRIBUTION$100M PLAYBOOk: LEAD  Nur TurE\ndemonstrate you’ve incurred costs on their behalf). 6) Show personalized proof through\ntestimonials and case studies that match the lead’s demographics, creating excitement and\nmotivation to attend.\nBottom line: Figure out what leads want, get that thing for them, and then tell them\nthey can have it if they show up, effectively removing the risk of wasting time while\nincreasing the cost of missing the appointment.\nNext Up…\nSo we’ve made it convenient for our leads to schedule. We’ve contacted them as fast as\nwe can. We’ve collected as much information as we can about them so we can personalize\nthe medium we talk on, the messaging we tell them, the salesman we match them with,\nthe gift we provide, and the proof we show them. This leads us to the last of our four\npillars to get insane show rates— Volume .\n27\nCopyright © 2025 by BUMBLE IP , LLC NOT FOR DISTRIBUTIONPillar Iv : volume\nVolume negates luck.\nIn my experience, the more often I reach out to leads, the more of them show up.\nThat makes sense because most communication attempts fail. For example, you may\nhave called or messaged at an inconvenient time. They might’ve wanted to respond, then\nforgot. Or maybe they simply missed it in the flurry of other communications they get.\nOr, in the case of older leads, maybe they didn’t need your stuff then, but they do now—\nand you gave them a nice reminder.\nFor all those reasons, reaching out again not only makes business sense, it makes\nethical sense. r emember, if they opted in, they asked to be contacted . So, contact them.\nThe problem: nearly half of all salespeople give up after the first attempt . No bueno.\nTime to change that.\nDescription\nvolume  simply means the number of times you do something . In this case, the number\nof times you reach out to leads before giving up. Our goal is to increase the volume\nof reach-outs to get more responses, schedules, and then shows. I break volume into\nthree parts:\n1) Scheduling appointments\n2) reminding them to show\n3) Booking their next appointment when they show up for their current appointment\nLet’s dive in.\n1) Scheduling Appointments\n1) Call leads within 5min of opting in . Seriously, once you get this, you will see an\nincrease in show rate and close rate. I can’t tell you how many times someone’s\nsaid, “That was fast. You guys are a great business,” and buy right away!\n2) Double-dial . If you call once and get nothing, immediately call again. First,\n28\nCopyright © 2025 by BUMBLE IP , LLC NOT FOR DISTRIBUTION$100M PLAYBOOk: LEAD  Nur TurE\nremember they gave you permission to contact them, so contact them like you\nmean it. Second, you will call from a strange number, and many phones block the\nfirst call and let the second call through. So even if they expect your call, they may\nmiss it anyway. *Note: Obey the laws of your area.*\n3) If nothing, leave a voicemail .\n4) Send a text immediately after you leave the voicemail .\n5) Double dial and text two more times that day . Make sure to leave a few hours\nbetween each attempt.\n6) Call two times for the next two days . Once earlier in the day and once later in the\nday. Text after the second  call each day.\n7) Call and text once a day for the next four days . If you reach out earlier in the week, this\ngets the people who respond more often on weekends. If you do your initial reach-outs\nlater in the week, the higher volume days will probably get them anyway.\n8) After the first week, I transition to long-term nurture . I cover this in other places.\nLong-term nurture consists of free value with soft calls to action to get them to\nre-engage. And once they do, we start back at the top.\nThe more days that pass, the less likely they’ll schedule. For that reason, we front-load\nthe reach-outs. Steps 6 and 7 stay flexible, you can do it for more days or fewer. I just\nshowed you what I prefer. As always, follow the laws in your area.\nPro Tip: Get An Automatic Dialer\nFor businesses’ sake, get a phone dialer. It will improve the efficiency of\nyour team 2-3x easily. It will automatically bring up the highest likelihood\nleads and stick with the cadence. And, your sales team doesn’t need to live\non spreadsheets and sticky notes. It’ll help you focus your full attention on\nactually working your leads.\n29\nCopyright © 2025 by BUMBLE IP , LLC NOT FOR DISTRIBUTIONPILLAr IV: V OLuME\n2) Reminding Them T o Show\nAutomated Reminders\nOnce you get the person scheduled, or they automatically schedule themselves, send\nthem automated reminders. But make it clear they are automated. People don’t mind\nreminders. They do mind being lied to. If you’re following the instructions from the speed\npillar, you don’t need to send that many anyways. It’ll look something like this:\n1) Immediately: Automatic confirmation of time, date, number you’ll be calling\nfrom, and person they’re meeting with.\n2) 24 hours before.\n3) 12 hours out.\n4) 3 hours from the appointment.\nAutomated Reminder Tips:\nʶuse the standard reminders that come with whatever software you use. Just let\nleads know you’ve automated them. Here’s an example:\nʶAdd the area code you’ll be calling from. You’ll 2x your pick-up rates.\nʶuse the lead’s local time zone . Thank me later.\n30\nCopyright © 2025 by BUMBLE IP , LLC NOT FOR DISTRIBUTION$100M PLAYBOOk: LEAD  Nur TurE\nThat’s what we do. It works great. Don’t overcomplicate it.\nManual Reminders\nYou send these on top of  the automated reminders and from a separate number. You\nwill send three messages from a real phone:\n1) The night before  (6 pm-ish). Include in your sales team’s end-of-day checklist that\nthey send messages to the next day’s appointments.\n2) The morning of  (8 am-ish).\n3) 60 minutes prior  to the meeting:\n**Follow the laws of your local area**\nHere’s an example:\nManual Reminder Tips:\n1) Send multiple messages in a row— how people actually message.\n2) Open with a probing question to get more information based on the\npersonalized information you already know about them from before .\n3) Once they answer, compliment them if you can.\n31\nCopyright © 2025 by BUMBLE IP , LLC NOT FOR DISTRIBUTIONPILLAr IV: V OLuME\n4) Then, ask the next question. This is where you can pull up the appointment if\nyou haven’t already. Ex: “I’ve actually got an opening today at 4 if you’re available\nlater today. If not, no worries.”\nRemember: Once they respond—keep nurturing! k eep responding quickly.\n3) Book Their Next Appointment At The Current Appointment\nWe bought an insurance company over a year ago. The biggest constraint was prospects\ndropping off between the first and second call. And between those calls the reps would\nmake and send them the plans they best qualified for. Lots of work. Low return. We made\none change to their lead nurture process, which I got from my friend Sharran Srivatsaa.\nHe called it BAMFAM or “ Book-A-Meeting- From- A-Meeting.”\nHere’s how it works : NEVEr get off the call with “We’ll circle back later.” or “I’ll\nfollow up and propose some times.” You’re both there. right now. Pull up your darn\ncalendar. Pick a darn time . If you can’t schedule an appointment with them right then and\nthere, you CEr TAINLY won’t after you’ve put them in limbo and they’ve put you in their\nrearview mirror.\nInternally, we call it “BAMFAM as a way of life.” Someone being dodgy about their\nnext call is an objection. Handle it. And your sales will thank you.\nPeople have a higher chance of showing up to appointments if you schedule them.\nYou have the highest chance of scheduling an appointment if you do it with them in real\ntime. For that reason, it makes the most sense to schedule the next appointment  during\nthe current appointment . Sharran’s BAMFAM suggestion skyrocketed the second-call show\nrates and the insurance company sales increased. Go figure.\nvolume Summary:\nYou reach out seven or more times in multiple ways. You send automated reminders\n24 hours, 12 hours, and 3 hours out from their appointment. You send manual reminders\nfrom a real cell phone the night before, the morning of, and an hour before their\nappointment. k eep it personal. Then, once they show, if they don’t close, don’t delay. Get\nthem booked for their next appointment right there and then so no one falls through the\ncracks.\n32\nCopyright © 2025 by BUMBLE IP , LLC NOT FOR DISTRIBUTION$100M PLAYBOOk: LEAD  Nur TurE\nNext Up…\nThe only thing left to do is execute. And since that’s the most important part , I’m\ndedicating a chapter to explain the things that have worked well for us to get more leads\nin the door. Time to execute.\n33\nCopyright © 2025 by BUMBLE IP , LLC NOT FOR DISTRIBUTIONExecution\nDo the boring work.\nSeven or eight years ago…\nI went over to my neighbor’s house. They introduced me to Jacob, their fifteen-year-old\nson. He’d always hang around when we’d talk about business. But he never spoke. One\nday, I asked him what he wanted to do—and he said make money . I laughed. I told him\nhe could come work out with me during the summer. He showed up every day, like\nclockwork. He never wasted the opportunity.\nWithin a few years, he went to college. He came back during his first semester,\ndissatisfied with school. I asked him again what he wanted. His response remained\nunchanged— to make money .\nI came downstairs from taking calls. Jacob was sitting in my kitchen on the phone. As\nI walked up to him, I overheard, “...yea… so… I was just wondering…are you trying to\nsell your house… no… yea… no… oh okay…” then he looked up at me.\n“What was that?” I asked.\n“Oh, I’m trying to wholesale real estate.”\n“How are you gonna do that?”\n“Watching videos online.”\n“How many deals have you done?”\n“uhh… none. I’m not sure I’m doing it right.”\n“No sh*t. Have you heard yourself? ...You sound like a stoned teenager. No one is\ngonna do a deal with you until you learn how to sell.”\n“Well, how do I do that?”\nI thought for a long minute, then replied, “Listen. I can get you a job interview.\nThat’s it. It’s gonna be up to the manager if he wants to hire you. But I’ve got openings on\nmy cold call team. You’ll get hundreds of reps in everyday. It’s sink or swim.”\n“I’ll do whatever it takes.:”\n“Good man.”\n34\nCopyright © 2025 by BUMBLE IP , LLC NOT FOR DISTRIBUTION$100M PLAYBOOk: LEAD  Nur TurE\nThe next week.\nI walked downstairs to meet up with Jacob for our workout. He had a grin across\nhis face.\n“What’s got you in a good mood?” I asked.\n“I got the job,” he replied proudly.\n“Good on you. Alright. But getting the job is the easy part. Succeeding is the\nhard part. Here’s what you need to do. Everyone else on the team is going to hit their\n150-call-per-day quota. If you want to be number one, which, if you’re hanging out with\nme, that is what I expect of you, then you need to work harder than everyone else.”\n“I will.”\n“Okay. So to be clear, I want you to look at what the top guy on the team is doing,\nthen do double that. So he’s making 200 calls a day, I need you to make 400. If he works\nfive days, you work six. If he takes a lunch break, you power through. You can’t do the\nsame amount as him because then he’ll always be ahead. I need you to catch up. And you\ncan only do that by doing more.”\nA few weeks later.\n“Man—some of these leads just aren’t qualified.”\n“And?”\n“Just feels like a waste of time.”\n“Let me give you a reframe. Instead of thinking of them as a waste of time. Think\nof them as giving you the ultimate gift—free practice. You can still take them through\nthe script, hear their objections etc. I remember when I had someone who walked into\nmy gym. They looked obviously homeless. I remember thinking to myself: if I can close\nthis guy on getting in shape and turning his life around, I could really change his life.\nEnd result: he ended up giving me a small deposit towards starting and never showed up\nagain. But the interesting thing is—this perspective of seeing all opportunities as ‘swings\nof the hammer to chisel our skillset’ never made me feel like I was wasting my time with\na lead. It was all free practice. And later, I ended up finding out something even more\nimportant… some people who look homeless are actually very wealthy and appreciate\nnot being judged. So—be an equal opportunity salesman. Do not judge. Just execute.”\n“understood.”\n35\nCopyright © 2025 by BUMBLE IP , LLC NOT FOR DISTRIBUTIONExECuTION\nAfter this conversation, Jacob got the nickname “garbage man.” He offered to take all\nthe under-qualified leads from the whole team. The older guys didn’t have his ambition.\nThey just wanted to cherry-pick. So they gave him all their “garbage” leads. And he would\nturn them into sales.\nOver time, he developed a little moniker, “Yellow is the new gold.”\nOur lead scoring system was simple. r eds are truly unqualified. Yellows are less\nqualified. Greens are prime leads. As you can imagine, there were plenty of yellows. Most\nof their guys would give their yellows to Jacob and he would take them in off-hours and\nweekends. And he just kept closing them. Over time he started saying, “Yellows are the\nnew gold.” And, for a salesman or business owner with the right perspective—they are.\n***\nJacob rose through the ranks and finished his tenure at Gym Launch as the top salesman\nthe quarter he left, out of 26 guys. Many of them, grown men. I tell his story from my\nperspective so you can figuratively ride along. He then came with me to Acquisition.com\nto be the Director of Sales and help our portfolio companies use our methodologies to\ncompliantly sell more prospects. And one of the first principles he teaches new salespeople\nis - be a garbage man - yellows are golds - volume negates luck - BAMFAM as a way of\nlife - and every sale is an opportunity for free practice.\nThese little -isms’ permeate the culture of the team. A spirit of humility. No one is\nabove the work. The work and the process sits on a pedestal. And all we can do is do our\nbest to strive towards the ideal.\nTactics\nThe hardest part about working leads is… actually working your leads . It’s tedious,\nboring work. But, it gets very unboring  results. I spent the time to tell you that story\nbecause once you know what to do  the key to doing it is culture . And rather than make\nthis some management mumbo jumbo, I will explain how I create a culture of execution.\nCulture  refers to the rules that govern good and bad behavior in an organization.  Simple\nas that. We want to have a culture of execution. Or accepting of the behaviors that make us\navailable, fast, personal, and persistent. And reject the behaviors that make us unavailable,\nslow, boring, and fragile.\n36\nCopyright © 2025 by BUMBLE IP , LLC NOT FOR DISTRIBUTION$100M PLAYBOOk: LEAD  Nur TurE\nGood stuff:  Good stuff typically falls into money & non-money. The money is\nstraightforward. Include a small commission bump for show-up rates. This will depend\non the ticket price of the sale, but usually, it’s in the neighborhood of 5–30% of what a\nsalesman makes on a sale.\nNon-monetary good stuff  falls into three categories: attention, affection, and approval.\nSo, that means we: give kudos to people who have the highest show rates. We ask them\nwhat they did. Then, when they invariably say, “I just followed the process,” we give them\nmore approval and attention. And the team will toss in the small -isms like “way to do\nthe boring work,” “volume negates luck,” “speed is king,” etc. And those little sayings\nreinforce the right behaviors. And conversely, if someone has a very high close rate but\ndoesn’t work their leads—in our culture, that’s seen as entitled and wasteful. And that\nperson is made aware of it.\nSo tactically, we rank the team by show rate, close rate, and total call-to-close\npercentage. This takes both skills into account: working leads and closing leads. This\nshows a holistic picture of the team. If you’re doing a good job—the same guys will be at\nthe top of all lists. If you’re not, the lists will look more all over the place. The nurture list\nmeasures work ethic. The closing list measures skill. And one typically leads to the next.\nTip: something I discovered way too late… the best closers are typically the best setters.\nSo—it’s a great way to have new guys come on in a low-risk environment. If they can set\na ton of leads, they can usually close. Same skill set—just higher stakes.\nAs an aside—I still don’t understand why all businesses don’t track all three sets of\nmetrics by sales rep. They’re so obsessed with close rates. But the only thing that actually\nmatters is the conversion rate on the leads you’ve got. And that takes everything  into\naccount. So you might as well take everything  into account when paying and giving status\nto your team.\nExecution Conclusion\nLike my other Playbooks, I do not say that my way is the only way . It’s just my way.\nAnd it’s worked pretty well so far. To put a bow on it, to get the highest percentage of\nleads to show, you need to:\n1) Convenience - Make it as easy as possible for them to schedule and show up.\n2) Speed - Contact them as quickly as possible from the time they indicate\ninterest. Prospects have large motivation for only tiny moments in time.\nCapitalize on it.\n37\nCopyright © 2025 by BUMBLE IP , LLC NOT FOR DISTRIBUTIONExECuTION\n3) Personalization - Increase the likelihood they show by demonstrating to them\nthis is just for them, the way they want it. Show you’re a real person, and you’ll\ntreat them like one, too.\n4) Volume - Don’t be afraid of reaching out more than once and reminding\npeople of the things they said they wanted. Doing them a service starts with\ncommunicating with them.\n5) Execute - Actually do it. And build cultural norms around loving the process.\nWith that said, I hope you use this to grow your business and prosper. The next\ntwo-ish pages are my Lead Nurture Checklist you can tear off or use for reference.\nVolume negates luck,\nAlex Hormozi, Founder, Acquisition.com\n38\nCopyright © 2025 by BUMBLE IP , LLC NOT FOR DISTRIBUTION\n39\nCopyright © 2025 by BUMBLE IP , LLC NOT FOR DISTRIBUTIONLead Nurture Checklist\nʶPillar I: Availability: The more availability you have, the higher the chance leads will\nschedule and show.\nʶSchedule appointments all seven days per week.\nʶSchedule as many hours as you can manage. 9 am to 9 pm EST is a good goal.\nʶGive more scheduling options. Four options per hour, or every 15 minutes,\nis a good goal.\nʶAdd an automated self-scheduling process.\nʶremove as many steps as possible from the self-scheduling process.\nʶPillar II: Speed: The faster you contact them, the more likely they’ll schedule and show, and\nthe less work you’ll do.\nʶSpeed to first contact: Hire enough people to respond to leads in under 5\nminutes. (Extra Credit: do it in under 60 seconds).\nʶSpeed to first appointment: Book appointments same day, next day, or day\nafter.\nʶPull appointments forward whenever possible.\nʶOutbound dial all leads that showed interest.\nʶSpeed of response: r espond to messages quickly . Doing some extra work\nduring calendar gaps keeps leads warm.\nʶPillar III: Personalization: The more you make it for them, the more likely they’ll show.\nʶuse their preferred communication method: Contact them everywhere, and\nthen focus your communication in the places they respond.\nʶQualify leads: use applications and demographic info so leads talk to the right\npeople.\nʶSegment messaging: Learn about the leads ahead of time from applications and\npublicly available info like social media accounts. Then, focus communication\non stuff that’s relevant to them.\nʶSend the best leads to the best closers.\n40\nCopyright © 2025 by BUMBLE IP , LLC NOT FOR DISTRIBUTION$100M PLAYBOOk: LEAD  Nur TurE\nʶIncentivize showing up: give them a reason to show up. A/B incentives and\ngift card incentives work great.\nʶProof: show proof that matches their situation across all stages of follow-up.\nʶPillar IV: Volume: The more times you reach out to people, the more likely they’ll respond,\nschedule, and show.\nʶDouble-dial text 3x the first day.\nʶ2x the second day and the day after.\nʶ1x 1–4 days after that\nʶSend automated reminders: 24 hours, 12 hours, 3 hours out.\n• Include the name, date, time, and the phone number or area code you’ll\ncall from.\nʶManual reminders from a real phone: night before, morning of, 60 min prior.\nʶSend multiple short messages rather than a big blocky message. It’s more\nnatural.\nʶkeep the conversation going Acknowledge - Compliment - Ask the next\nquestion. u se this to qualify leads and pull appointments forward.\nʶBAMFAM: Book a meeting from a meeting. Never let a lead go to no-man’s\nland.\nʶExecution: None of this will work unless you do. But if you do, this will work.\nʶT rack and rank: show rate, close rates, and lead-to-close ratio by sales rep.\nʶCulture is everything. Normalize:\nʶMake your team love “the boring work” that gets results.\nʶ“Yellows are the new gold”—don’t sleep on less qualified leads.\nʶVolume negates luck—do more than everyone else.\nʶBeing garbage men—don’t judge a book by its cover. Be an equal opportunity\nsalesman. Every lead is an opportunity for practice.\nʶProcess > All. No one is above the process. We all strive for that ideal.\nThat’s it. Now it’s on you."
    }
  ]
}