{
  "title": "The Linchpin by Russell Brunson",
  "type": "book",
  "author": "Russell Brunson",
  "added_date": "2025-11-01T21:28:55.879460",
  "word_count": 20653,
  "entries": [
    {
      "text": "1\nCopyright © 2023 by Marketing Secrets, LLC\nAll rights reserved.\nWritten by Russell Brunson\nEditorial Work by Julie Willson and team\nCover Art by Leon Dorado\nLayout and Design by Amanda Freund-Broerman\nThis book is not designed to be a definitive guide or to take the place of advice from qualified professionals.\nThere is no guarantee that the methods suggested in this book will be successful, owing to the risk that is\ninvolved in business of almost any kind.\nThis Publication is for research purposes only. All of the webpages and advertising are copyrighted by\nthe original owners. You may borrow the “ideas” in these ads and pages, but you may NOT use any of the\nactual advertising copy or designs. You do not have resell rights or giveaway rights to any portion of this\npublication. This publication contains material protected under International and Federal Copyright Laws\nand Treaties. No part of this publication may be transmitted or reproduced in any way without the prior\nwritten permission of the author. Violations of this copyright will be enforced to the full extent of the law.\nAny earnings, income statements or other results, are based on our own testing and are only estimates\nof what we think you could earn. There is no assurance you will do as well as stated in any examples. If\nyou rely upon any figures provided, you must accept the entire risk of not doing as well as the information\nprovided. Screenshots in this book are from publicly accessible field archives. All product names, logos\nand artwork are copyrights of their respective owners. None of the owners have sponsored or endorsed\nthis publication. While all attempts have been made to verify information provided, the author assumes no\nresponsibility for errors, omissions, or contrary interpretation on the subject matter herein. Any perceived\nslights of peoples or organizations are unintentional. The purchaser or reader of this publication assumes\nresponsibility for the use of these materials and information.\nReaders are highly encouraged to evaluate the risks of investing money into marketing plans and to seek\nindependent research regarding such risks. The author cannot guarantee success or positive outcomes\nusing the methods described herein.\nwww.MarketingSecrets.com\nFOREWORD ........................................................................................................... 6\nby Steve J. Larsen\n1. THE LINCHPIN .............................................................................................. 10\nThe Simple, Overlooked Secret in My Funnels That Took ClickFunnels from\nStartup to 9 Figures a Year… (In Just 3 Short Years)\n2. CONTINUITY ................................................................................................. 26\nWithout CONTINUITY You Don’t Have a Business\n3. THE MIFGE...................................................................................................... 70\nYour MIFGE Builds Your Continuity\n4. THE ATTRACTIVE CHARACTER FLYWHEEL................................................. 90\nYour Attractive Character Flywheel Promotes\nYour MIFGE and Dramatic Demonstrations5. DRAMATIC DEMONSTRATION #1.............................................................. 114\nYour Dramatic Demonstration #1 (Challenge or Webinar)\nSells Your Bulk Continuity + Offer (Your SLO!)\n6. DRAMATIC DEMONSTRATION #2.............................................................. 132\nYour Dramatic Demonstration #2 (Live or Virtual Event)\nSells Your High-Ticket Offer\n7. THE LINCHPIN VALUE LADDER.................................................................. 152\nFrom a Framework to a Value Ladder…Putting It All Together\n8. YOUR NEXT STEP........................................................................................ 158\nWant Help Creating Your Linchpin Value Ladder?TABLE OF\nCONTENTS\nBy Steve J. LarsenFOREWORD\n“Mr. Larsen, you have no recurring revenue and\nYOU are the business.”\nWhen I was only three years into my business,\nI had sold around $8,000,000 of my own offers\nonline, and a real business valuation service\nwas pouring over financials and market data\nto see how much money my little empire was\nactually worth. After a several week waiting\ngame, the answer struck my core with a nasty\ndisgust I’ll never forget. Ready?\nMy business was worth barely $500k.\n“What?! WHY!? Look at the sales!! Look at the\naudience! How can a business around $8 million\nin sales be worth only $500k?!” I was enraged.\nBut the answer was the very first line above,\nwhich was one of the biggest business gut\npunches I’ve ever experienced. “Mr. Larsen,\nyou have no recurring revenue and YOU are the\nbusiness.”\nI don’t think anyone would say millions in sales is\na failure, but I also clearly saw how devastating it\nis to build a business with YOU as the continuity,\nrather than build a business with its own\ncontinuity. Make sense? I’d been doing it wrong. I\ndidn’t have a business; I had a promotion.What was even more painful was knowing that\nI had a little nagging voice in my head that\nkept saying, “go build continuity and build up\nrecurring revenue” but I never did it.\nSo how could I have built it all wrong then?\nTurns out I missed a few of the more subtle\nparts of the Value Ladder, which is easy to do.\nLet me explain.\nThe first time I heard Russell Brunson say\n“Value Ladder” was about 10 years ago, and\nit changed my entrepreneurial life. I felt like\nI suddenly had the language to describe\nthe marketing plans in my head. It changed\neverything for me. At the time, I was getting\na marketing degree, which never delivered\nas much marketing clarity in my classes as\nthe Value Ladder did. The concept is now an\nindustry standard of how we communicate\nmarketing.\nThe Value Ladder concept has become such\na powerful and universal way to express\nentrepreneur and marketing ideas that even\nthose who try to compete with Russell online\nuse his own model to attempt to poorly\noutwit him.What I really missed in those earlier years can\nbe shown in how most people draw a Value\nLadder. If you haven’t seen one before, it looks\nlike three or four stair steps and visually shows\nhow you’ll ascend your customers. The real\nproblem is that’s where people usually stop\ndrawing. However, it’s not complete. That’s not\nthe Value Ladder unless the other part is there.\nWhat most people don’t draw is the part in the\nred box. It’s missed frequently, and the three\nlittle arrows symbolize the part I was missing\ntoo: continuity.\nSomewhere along the line, our internet\nmarketing industry kind of forgot about those\nlittle “continuity arrows” and instead just drew more rungs on the ladder. We all have 1,000\nideas each day, so it’s easy to start shifting\naway from a completed Value Ladder and\ninstead just add infinite steps so your ideas\nhave a place to live. Their Value Ladders kind\nof end up looking like the opening scene in Ace\nVentura Pet Detective, where he’s sending a\nslinky down hundreds of steps.\nNo judgment. Been there, done that. But take a\nmoment to turn up the “real talk” dial and lean\nin a bit, because NOT creating and focusing on\ncontinuity in my early business life is the single\ngreatest business regret I have. No contest.\nHow I wish I had done things differently…\n6 7\nThat’s why the Linchpin is so powerful and\nsorely needed.\nThe Linchpin is the difference between having\nan actual business and having just one-off sales\nstreaks. It guides the entrepreneur’s visionary\nthoughts into a productive revenue model and\nensures that all ideas anchor back to solving\nreal business needs. Without that, it’s easy to\nstart running your business based on the idea-\nof-the-day. I’ve found that the Linchpin really\nhelps solve any tensions between the visionary\nentrepreneurs and the rest of their teams too,\nbecause now everyone can point back to the\nsame drawn vision.\nI hope that as you read this book you see all\nthe other business questions the Linchpin also\nsolves. There’s a lot.\nFor example, every business, whether you’re\na Fortune 500 or a living room start-up, is\nconstantly hungry for two things: daily cash flow\nand daily lead flow. The Linchpin solves both.\nThe game is about increasing your control over\ncash flow and lead flow as much as possible.\nAnd although the big cash days are nice, it’s\nreally about cash flow. That’s what I was\nmissing in my business.\nIt’s ironic how few internet entrepreneurs\nactually have continuity, considering that\nthe dream of a laptop beach lifestyle is the\nreason that got many of us started. However,\nit’s very hard to grow a healthy business\nwithout knowing how much money is coming\nin tomorrow. Truly, cash flow is king.\nIf you’re thinking, “Well I just need leads, Steve!”\nOk, but even if the dreamiest of customers is\nbuying from you today, do you know you will\nattract a new lead tomorrow, in a process that\ndoesn’t require you? The Linchpin solves both\nof your cash flow and lead flow problems.\nI also found that focusing on continuity\nallows entrepreneurs to dramatically increase\ncustomer experience. It was a surprising\nbenefit that I saw for myself. I no longer had to constantly come up with new offers PLUS\nall the marketing AND the delivery. Now, I\ncould use my energy to actually grow the same\nbusiness, instead of giving birth to a new one.\nI had both cash flow and mental space to\nmake continuous improvements to my core\ncontinuity.\nI’ve found a lot of business simplicity in\nusing the Linchpin too. Most know my crazy\nbeginning, that I went through 34 product\nfailures before one actually worked. On the\n35th attempt, I was so excited it finally worked\nthat I think I got a little addicted, and over the\nnext four years I created and released over\n55 different offers of my own. I very much\nget having a lot of product ideas, but the\nentrepreneurial angels sang on the day that I\ndeleted 52 of them. Why?\nI bring this up only because I’ve seen\nthousands of Value Ladders representing\nhundreds of markets, and as you read this\nbook, it’s going to feel easy to get more\nideas than the Linchpin model holds. GOOD!\nLet what you’re about to read force you to\nkeep, combine, or kill your offer ideas. It’s\nabout creating better offers, not necessarily\nmore offers.\nFinally, remember, just because it’s a good idea\ndoesn’t mean you should do it (I’m not one to\ntalk there), but let the Linchpin guide the offers\nyou choose to build so they’re in one ascending\ntheme. The Linchpin is about creating one\ntheme that your offers all attach to. For\nexample, it’s very common for an entrepreneur\nto hand me their Value Ladder plans to critique\nonly for me to hand it back and point out, “This\nisn’t a Value Ladder. This is three individual\nbusinesses that are all referring traffic to each\nother. A Value Ladder is one business theme\nwith three offers all leading to continuity.” The\nLinchpin solves this by helping the entrepreneur\nfocus on creating one strong theme throughout\nthe product line of a company, rather than lots\nof unrelated offers.\nRead this book in its entirety. Be a thorough\nstudent. I haven’t read a lot of guru’s books because I study Russell. I’ve been in his office\nmany times and watched as his gift unfolds\nmassive amounts of information, and then\npops out simplicity with a stick figure doodle.\nThen a whole market will shift.\nLike many entrepreneurs, I see the work we\ndo to help others as near-sacred. I’ve known\nRussell Brunson personally for 8 years. His\nwork ethic and drive is unparalleled. His\nmission is not about riches. He already did that.\nA lot and then more. He shows up over and\nover because he likes to solve entrepreneur\nproblems at a large scale, and this book is no\ndifferent.\nMost don’t know that Russell Brunson\npioneered the Value Ladder concept as a\nwhole. Now, with this book, he’s returning with\nthe Linchpin to fill in the model.\nThe book you’re about to read could’ve also\nbeen called: Russell Brunson’s Personal\nLessons From Executing His Own Secrets\nTrilogy. Get a pen and buckle up, because it\nturns out that Russell Brunson actually has\nmore secrets to share, and you’re holding\nthem. Get to it.\n8 9\nA lot of people talk about how ClickFunnels\ngrew from start-up to over 9 figures in just three\nyears, and they all point to different reasons\nwhy. Some attribute it to the software, others\nbecause of the community, and others think\nit’s because of our books or one of our funnels.\nWhile all of these things are HUGE contributors\nto our success, I am fully aware that there was\none small tweak we made to our funnels, about\nthree weeks after we launched, that instantly\n10Xed ClickFunnels almost overnight and was\nthe key to our rapid growth.\nThis book will walk you through the model that\nwe now affectionately call “The Linchpin.” It’s not just a way to build your company and structure\nyour funnels, it is THE WAY. It’s the model that all\nof our coaching clients inside of the Two Comma\nClub X Coaching Program follow. It’s the model\nthat we coach all of my Inner Circle members in\nduring our mastermind meetings. It is the model\nthat every one of my companies follow, and if\nsomething doesn’t fit into this Linchpin model,\nthen we don’t do it. Yes, it’s that important.\nThis is what the framework of the Linchpin looks\nlike, and we’ll break it down in this book. Chapter 1\nTHE LINCHPIN\nThe Simple, Overlooked Secret In My Funnels That Took Clickfunnels From\nStartup To 9 Figures A Year… (In Just 3 Short Years)\nThe concepts you’ll learn aren’t difficult. In fact,\nthey are simple. Especially if you already have\nan existing business, you’ll notice that it’s a few\nsmall tweaks to how you look at your business\nand how you structure your business. After you\nmake these small changes, you will have the\nability to scale quickly. I know that many of you\nalready do webinars or challenges. You may\nalready have a live or virtual event. The goal of\nthis book isn’t to have you stop doing what’s\nworking. Instead, it’s to show you how to add\nin a few of the other pieces that you’re likely\nmissing, and that you will need for a scalable\nbusiness, and to tie them all together with a\nsimple linchpin. Following this model will allow\nyou to grow and scale your company 10X faster.As you will soon see, the actual Linchpin is a\nmindset shift on where your self-liquidating\noffer is placed, and then where you put just\none simple button, in a very specific place, on\nyour thank-you pages.\nThat’s it!\nBut I don’t want the simplicity of the model to\ncause you to overlook its power. I’ve shared this\nidea with dozens of my friends over the years,\nand almost all of them have discounted it, not\nused it, and wondered why we are still growing\nso rapidly almost 10 years later! These simple\nchanges will work to scale any business, but it\nwill require you to look at it through a different\nlens, with an open mind.\n11 10\nThe first (and the most) foundational principle you need to understand in order to be successful\nwith the Linchpin framework is that you need to move where the SLO is located. I taught about\nthe concept of an SLO in my book, Expert Secrets.\nAn SLO is a low-priced offer on the thank-you page (often $37-$97) after somebody gives you\ntheir email address and is created to help liquidate your ad costs.\nTypically, the SLO is placed on the thank-you page after someone registers for a free challenge,\nwebinar, summit, or virtual event. We don’t get paid until after the event is over, so the SLO\nallows us to put the money we make on the SLO back into ads.\nFor example, after someone registers for my free Secrets Masterclass, they see my SLO on the\nthank-you page that invites them to get a free copy of my DotComSecrets book. The average\nperson who requests my free book ends up paying $9.97 for shipping, and then we take them\nthrough a funnel where we upsell the audiobook and a course. I usually make over $50 on\naverage for each person who orders a copy of my book.MOVING THE LOCATION OF THE\nSLO (SELF-LIQUIDATING OFFER)You’ve probably seen other SLOs like these:\n• After you register for a free challenge: Upgrade to VIP for just $47!\n• After you register for a free webinar: Get a special ebook for just $37!\n• After you register for a free summit: Get lifetime access to the recordings for just $47!\nAn SLOSLO is a low-priced\noffer on the thank-you\npage (often $37-$97)\nafter somebody gives you\ntheir email address and is\ncreated to help liquidate\nyour ad costs.\n13 12\nTypically, the offer we pitch is a more expensive\noffer (usually $297, $997, $1,997, or more)\nat the end of a challenge, webinar, summit,\nor virtual event. If the SLO covered all of our\nad costs, then what we sell at the end of the\npresentation is pure profit!\nWhen we first launched ClickFunnels, this was\nthe model that we used:\n• Step #1: We promoted a free webinar.\n• Step #2: People would register for the\nwebinar, and on the thank-you page\nI would sell them a $37 offer to help\ncover our ad costs (SLO).\n• Step #3: At the end of the webinar,\nI  would sell access to ClickFunnels\nfor 12 months for $997. (After the 12\nmonths was over, we would start billing\nthem $97 a month for continued access\nto our software.) THE TRADITIONAL SLO\nWe did about a dozen webinars this way,\nand I was excited because we started to\nmake money, but my business partner Todd\nDickerson was upset because he didn’t want\nto be in a business where we were only getting\npaid when I did a webinar. He came from the\nsoftware world, and he wanted to build up a\ncompany with residual, recurring income.\nDuring a late-night discussion after one of our\nwebinars, Todd had an idea...What if, instead of putting\na $37 SLO on the thank-you\npage…what if we put a free 14-\nday trial on the thank-you page\ninstead and encouraged people\nto create a free trial BEFORE\nthe webinar started…and our\nnew goal was to see HOW MANY\nTRIALS we could give away\nduring the signup process.\nIf we did that, and our goal\nwas trials, then we could start\nto look at the $997 offer as\nthe SLO! Every penny we make\nfrom the $997 offer, we dump\nback into ads to get more\npeople to register for the\nwebinar and create free trials!\n—Todd Dickerson\n14 15\nBoom…that was the idea.\nSo simple. So Powerful.\nAnd so we tried it. The next webinar, I got rid of the existing SLO and added in a free 14-day\nClickFunnels trial on the Thank-You page. This simple button, and a shift in our mindset, was the\nkey to our success. The button became the linchpin that tied this all together!\nI then filmed a quick video that said:\n“Thank you for registering for the webinar! During the live training, I’m going to show you how\nto use a new tool called ClickFunnels! You will need an account during the class, so I want to\ngive you a free 14-day trial. That way you can play with it now and have it for the webinar! After\nthe webinar, if you decide you don’t want it, you can cancel your account, but you’ll need it for\nthe class, so go and get your free account now!”\nWe had no idea that Todd’s weird idea—moving the SLO and adding this one little button—would\nbe the key to us scaling ClickFunnels from a new start-up into a $100 million/year company in\njust three short years!\n(Thanks Todd!!!)\n…THAT WAS THE IDEA.\nSO SIMPLE.\nSO POWERFUL.\nBOOMBOOMBOOM\n17 16\nHERE’S WHAT THE FUNNEL\nLOOKED LIKE IN THE ORDER THEY\nWENT THROUGH IT.\n1. Webinar Registration Page: They registered for the webinar.\n2. Webinar Thank-You Page: After registering, some clicked the button and got a\nfree 2-week trial of ClickFunnels while they waited for the webinar to start.\n3. Webinar Offer: They attended the webinar and some signed up for the $997 Offer.\n4. Trialers And Yearly Buyers Continue On Continuity:\n·Trialers were put into our continuity and some continued at $97/month after\ntheir free 14-day trial ended.\n·Those who bought a year’s access were put into our continuity and some\ncontinued at $97/month after their bulk 12-month membership ended.\n19 18\nWe ran this new model hard for the next 12 months. I was doing 2–3 webinars a week,\nand we were re-investing all of the money we made from the sales during the webinar\n(our new $997 SLO) back into ads for the next webinar.\nAfter 12 months, we sat back and calculated how this Linchpin had affected our bot -\ntom line, and the results were amazing.\nOver that 12-month period:\n• 2,500+ members bought our offer at $997!\n·In just one year, we made almost $2,500,000 in sales!\nNow, that by itself is pretty amazing, but remember that we didn’t keep that\n$2,500,000…we put it back into ads to keep getting people to register for the webinar.\nThe real magic came when we realized this:\n•  After the trials ended, we had 7,500+ members stay on at $97/month.\n·That produced almost $750,000/month revenue.\n·That meant we had almost $9,000,000 in projected ARR (annual recurring\nrevenue) from the trialers’ monthly subscriptions!\n($750,000 x 12 months = $9,000,000)\nThat was $9 million (more than 3.6 times MORE money than we made from the\n$997 offer) that we would have lost had we not done the Linchpin model!\nNot to mention the 2,500 people who did buy the yearly account…a huge percentage\nof them continued into monthly recurring when their 12-month account was over!\n20 21\nThe Linchpin SLO\nYou can see how it fits into the whole\nLinchpin model here.\nOnce we saw the numbers, we realized that we had stumbled upon something amazing!\nI saw the power of monthly recurring revenue. Sure, the webinar sales created a chunk\nof cash flow…but the REAL MONEY was made in the continuity.\nThis is what the core framework inside of the Linchpin looks like.\n“\nUltimately, the business\nthat can spend the most to\nacquire a customer wins.\n—Dan KennedyOne thing to note—that many people who first attempt the Linchpin miss—is that the thing I’m\nselling at the end of the webinar or the challenge isn’t just a random product or course; it’s\nactually an offer that is wrapped around 3, 6, or 12 months’ access to our continuity program.\nI call this Bulk Continuity because we give them bulk access to a few months of the continuity\ninside of the special offer. It’s one of the keys that I’ll explain in more detail later in the book.\nBECAUSE OF THIS LINCHPIN MODEL, WE ARE ABLE TO\nOUTSPEND EVERY OTHER BUSINESS IN OUR INDUSTRY.MY MENTOR DAN KENNEDY USED TO ALWAYS SAY:\n22 23\nTHE VALUE LADDER\n(WITH RULES)\nIf you’ve read my first book, DotCom Secrets, then you know all about a concept I call the Value\nLadder! The basic principle is that when you increase the value of something you offer, you can\nalso increase the price. In most businesses, you bring someone in on a lower level of your Value\nLadder with an offer (like a free book or report) where they get some value. If they get value from\nthat interaction, then they will naturally want more, and they’ll start to ascend up your Value\nLadder, buying other products and services.\nThe Value LadderValue Ladder is an organized way to\nmove your customers through your offers.\nAs customers ascend your Value Ladder,\nyou’ll provide them more value, so your\noffers will increase in price.\nIn the past, as I’ve taught this concept, there\nare two things that often come up. First, many\npeople think that they have to create ALL of\ntheir products or services in their Value Ladder\nbefore they can start (which isn’t true), or\nthey have so much fun creating products and\nservices that soon they have hundreds of offers\nand levels, and their Value Ladder becomes a\nvalue maze.\nBoth of these keep some people from\nsuccess. In fact, in my higher level Inner Circle Coaching Program, I typically spend a lot of\ntime unwinding what people have created. I\ntell them that they have to “kill some of their\nbabies” (in other words, kill some of their\nfavorite offers) to be successful, and then we\nsimplify their Value Ladder.\nAfter I first showed the Linchpin framework, I\nrealized it had the power to fix our customers’\nvalue mazes! In fact, Steve J. Larsen said:\nIt doesn’t allow you to create a bunch of offers that will confuse your customers. Instead, it puts\nrules and restrictions on your Value Ladder to make it flawless—the perfect model—and it shows\nyou what you need to create and in what order!\nI’ll show you later how to put your offers into the Linchpin framework and how to ensure your\nValue Ladder doesn’t become a value maze!The Linchpin is basically the\nValue Ladder with rules.”\n—Steve J. Larsen\n24 25\nIn the next few chapters of this book, I am\ngoing to break down each step, or phase, in\nthe Linchpin framework.\nThe Linchpin framework helps you structure\nthe offers in your Value Ladder for maximum\nprofit and scalability. In other words, it’s\nbasically your Value Ladder with rules.The numbers on the Linchpin framework\nbelow represent the order in which you will\ncreate the parts of the framework. As you will\nlearn in the next chapter, the main goal of the\nLinchpin is to build up your continuity revenue.\nEverything else is an appendage to building\nyour continuity income.\nThis is the path that we’ll cover during the rest\nof the book.THE LINCHPIN FRAMEWORK\nSTAGE 1: THE MIFGE (Steps 1–3)\n1. Create Your Continuity Or Subscription Program\nYou’ll create a continuity program to get paid on a recurring basis.\n2. Create Your MIFGE (Most Incredible Free Gift Ever)\nYou’ll create an irresistible offer that includes a free trial of your continuity.\n3. Launch Your MIFGE To The World You’ll use the Attractive Character Flywheel\nto sell your MIFGE.\nSTAGE 2: DRAMATIC DEMONSTRATION #1 (Steps 4–6)\n4. Create Your Bulk Continuity + Offer\nYou’ll create an offer that includes free Bulk Continuity (usually 6 or 12 months).\n5. Create Your Dramatic Demonstration #1\nYou’ll create a challenge or webinar to sell your Bulk Continuity + Offer (plus you’ll\nput your MIFGE on the thank-you page of your challenge or webinar to get more\nmembers).\n6. Launch Your Dramatic Demonstration #1 To The World\nYou’ll use the Attractive Character Flywheel to fill your Dramatic Demonstration #1.\nSTAGE 3: DRAMATIC DEMONSTRATION #2 (Steps 7–9)\n7. Create Your High-Ticket Offer\nYou’ll create a High-Ticket Offer (that includes Bulk Continuity + more).\n8. Create Your Dramatic Demonstration #2\nYou’ll create a virtual or live event to sell your High-Ticket Offer.\n9. Launch Your Dramatic Demonstration #2 To The World\nYou’ll use the Attractive Character Flywheel to fill your Dramatic Demonstration #2.\n27 26\nYou might say to yourself, “Isn’t this out of\norder? Why do the numbers go backward?”\nJust as you can’t drive traffic to a sales page\nyou haven’t created yet, there’s a certain order\nto follow to build out your Linchpin framework.\nYou do not need to build out the entire Linchpin\nframework before launching it. In fact, we\nrecommend you build it in stages and then\nlaunch each stage in the order below. Even if\nall you do is finish Stage 1, you can still have\na successful business. Each stage builds on\nthe next, so the more stages you complete, the\nmore successful your business will be.\nWe’ll dive deeper into each part of the\nLinchpin framework in this book, but for\nnow, just remember that the Linchpin…\n…is the best way to scale your business\nbecause your SLO becomes what\neveryone else uses for their main source\nof business revenue.\n…keeps you and your team focused on\ngrowing your continuity.\n…builds your continuity which is the\nonly actual tangible, sellable asset in\nyour business long-term.\nI’m not in the author business.\nI’m not in the event business.\nI’m in the continuity business.\nEverything else is an appendage\nthat gets more people into the\ncontinuity and gets them to stick\nlonger and become raving fans.\nThat’s the only goal at the end of\nthe day. —Russell Brunson\n29 28\nChapter 2\nCONTINUITY\nWithout CONTINUITY You Don’t Have A Business\nSTEP 1: Create Your Continuity Or Subscription Program\nYou’ll create a continuity program to get paid on a recurring basis.\nThe entire premise of the Linchpin model is based on a statement that I heard from one of my\nfriends and mentors, David Frey. He said:\nIf you don’t have\ncontinuity…then you\ndon’t have a business.\n—David FreyBased on this statement, most entrepreneurs\nthat I work with, even the very successful\nones, don’t actually have a real business.\nThey may sell high-ticket products, run live\nevents, or sell a lot of one-time products, but\nbecause their business isn’t creating residual,\ncontinuity income, they don’t actually have a\nbusiness. They have a promotion.\nFor over a decade, I was in the same boat. Every\nfew months we launched a new offer, a new\nevent, a new promotion, and while oftentimes\nwe had 7- and 8-figure promotions, when the\nmarketing ended, so did the cash flow.\nIt wasn’t until we launched ClickFunnels—and\nI started to see the compounding effects of\nfocus on continuity—that I finally understood what David Frey was saying. Every promotion’s\ngoal was no longer just to make some quick\nmoney, but instead they were designed and\norchestrated with one goal in mind: How do we\nget more people into continuity or membership\nby creating this product or doing this event?\nMy focus went from just making money once\n(a promotion) to building long-term residual\nincome (a business). When I first started\nworking with Dan Kennedy and Bill Glazer in\ntheir mastermind group, Bill told me something\nso powerful about their entire business model.\nAlthough they had dozens of books and\ncourses, as well as live events and tons of\nother ways that they made money, he told me:\nWe’re in the two-things\nbusiness: the business\nof ‘getting members’ and\n‘keeping members.’\n—Bill Glazer\n30 31\nBy putting extreme focus on your continuity and\ngetting new members into it each day, you have\nthe ability to give yourself a raise every day!\nDo you know how nice it is to wake up every day,\ncheck your Stripe app on your phone, and see\nhow much you made the day before…knowing\nthat if you want to, you don’t have to work that\nday, or that week (or even year!?). THAT’S the\npower of building your continuity income!\nI still remember the day I realized that by\nleveraging the power of residual, continuity\nincome, I could basically purchase whatever I\nwanted and let my members finance it for me.\nFor example, let’s say that I want to purchase\na new million-dollar cabin by the lake. With a\n30-year mortgage and 20% down, my monthly\npayments would be about $4,500 a month.\nThat may seem like a lot, until I start thinking\nabout it in terms of membership. If I have\na continuity program that people pay $97\na month to be part of, I only need to get 47\npeople to sign up, and their fees will more than\ncover the mortgage payments!\nWant a new car? How many members will it\ntake to finance? You could get a nice Lexus for\n20 members or even a Lamborghini for around\n50 members.Once I learned this principle, I realized\nyour business should only have ONE\ngoal: Get people into your continuity\nprogram and help them stay. Continuity\nis the key!\nContinuity or subscription programs are often\ncalled memberships. To create a continuity\nprogram, you offer a product or service to your\nmembers on a consistent, repeatable basis. In\nreturn, your members pay you on a recurring\nschedule (often monthly). Usually, membership\npayments are automated so your members’\ncredit cards get charged the same amount each\nmonth (or whatever recurring schedule they’re\non) until they cancel.\nAnd because I know someone is wondering\nabout this…NO. You should NOT sell lifetime\naccess to your continuity. There are places\nin the Linchpin where you will sell bulk\nsubscriptions (6-month or yearly accounts),\nbut NEVER sell lifetime access. Plus, having\nconsistent, recurring revenue is the one\nthing that makes your company desirable to\ninvestors. So, if you ever plan on selling, you’ll\nwant to build your continuity.\nGet people into your\ncontinuity program\nand help them stay.\nContinuity is the key!Continuity is the key!\nTYPES OF\nCONTINUITY\nPROGRAMS\nYou can create just one continuity program\nor blend several together if you like.\n32 33\n• Examples: ClickFunnels and Salesforce\n• PRO TIP: Software is the most “sticky” of all memberships, meaning members stay\nlonger in a membership that includes software. If you’re able, find a way to add software to\nyour continuity program.\n• Here’s our example of ClickFunnels.\nSOFTWARE\n• Examples: NO B.S. Magnetic Marketing Newsletter and Sports Illustrated\n• PRO TIP: Print newsletters are often seen as more valuable than digital newsletters\nbecause they’re tangible. Also, your members are more likely to consume and keep them.\n• Here’s our example of the NO B.S. Magnetic Marketing Print Newsletter.PRINT NEWSLETTERS\n35 34\n• Examples: LadyBoss and Au Bone Broth\n• PRO TIP: Supplements are perfect for a continuity program because they need to be\nreplenished on a regular basis. When you offer your customers the convenience of not\nhaving to remember to re-order, it’s a win-win for you both.\n• Here’s our Au Bone Broth “Subscribe & Save” option.SUPPLEMENTS\n• Examples: Netflix and Disney+\n• PRO TIP: Membership sites are the easiest to create. They’re also easier to sell than a\ncourse. If you have a course, you might think about turning it into a membership by dripping\nthe content out slowly, once a month.\n• Monthly Deliverables: A membership site is all about mastery, so don’t overwhelm your\nmembers with too much content.\n• Here’s an example of our Two Comma Club X membership site.MEMBERSHIP SITES\n37 36\n• Examples: Mark Rober’s Build Box and BarkBox\n• PRO TIP: Instead of selling one-off physical products, you can place them into a subscription box\nand mail them out monthly.BOX OF THE MONTH CLUB\n• Examples: Gyms and Amazon Prime\n• PRO TIP: If your continuity program doesn’t fit into the categories above, that’s okay! It\nmight be a service-based continuity program or other continuity.OTHER\nEXAMPLES\nOF OUR\nMEMBERSHIP\nSITES\nYou already know we have ClickFunnels,\nbut we have several other\nbusinesses that have continuity\nprograms as well, and we use\nmembership sites for all of them.\n38 39\n• Gold: $97/mo.\n• Diamond: $297/mo.MAGNETIC MARKETING\n• Funnel Builder: $1,000–$2,000/yr.\n• Certification: $997/mo. (or $9,997/yr.)\n• Two Comma Club X: $2,500/mo. (or $25,000/yr.)FUNNEL BUILDER\nTWO COMMA CLUB X\n41 40\n• Inner Circle: $50,000/yr.\n• Category Kings: $150,000/yr.\n• Atlas: $250,000/yr.INNER CIRCLE\nYou don’t want to dump all your content or training materials into one area and give them access\nto all of it.\nOur favorite way to add content into our member’s areas is based on Dan Kennedy’s Selling\nOpportunities framework. He explains that you have several opportunities to transform your\nmembers inside your continuity program, and that we should focus on selling upgrades, not\nfixes. The three selling opportunities we use include Repair, Improvement, and Replacement.The #1 reason people leave\nmemberships is because of\noverwhelm. —Stu McLarenMEMBERSHIP CONTENT\nBut WHAT should you put into your membership site, you ask?\nContrary to what you might think, you don’t want to give them MORE. As Stu McLaren says:\n42 43\n• Repair (fixing something that was broken): We’re helping a member\nimplement the concept we taught in the masterclass.\n·In our member’s area, this area is called our Member Makeover.\n• Improvement (making something a little better, faster, easier): We’re\nhelping our members improve and become better inside the new\nopportunity.\n·In our member’s area, these areas are called our Masterclass\n(where we teach a new concept in 30 minutes each month) and\nBackstage Pass (where we show behind the scenes of what we’re\ndoing in regard to that month’s masterclass concept).\n• Replacement (replacing whatever they were doing with a new way of\ndoing something, that is the new opportunity): This is the BEST choice,\nand we cover this in greater detail inside my book Expert Secrets.\n·In our member’s area, this area is called our Success Path: The\nLinchpin, where we dive deeper into each step in the Linchpin\nframework and give the step-by-step instructions on how to\nimplement it for your business.\n45 44\n7 CORE\nELEMENTS\nThere are 7 core elements\nto a successful continuity program\nand membership site that will help your members\nfind success and stay in your continuity.\n1. New Opportunity\nYou’ll create a Success Path with your new opportunity (that is the\nframework that produces your members’ desired result).\n2. Consumption\nYou’ll help your members consume the content by adding a members-\nonly podcast.\n3. Monthly Improvement\nYou’ll help your members improve each month by giving them a\nMasterclass training on a certain topic from the Success Path and a\nBackstage Pass to show how you’re implementing that topic.\n4. Monthly Repair\nYou’ll help your members fix what they implement from the\nMasterclass training in a Member Makeover.\n5. Library / Archive\nYou’ll help your members gain mastery by offering carefully curated\ndeep-dive trainings, courses, files, and templates in your library /\narchive.\n6. Community\nYou’ll help your members gain connection by creating a group for\nthem to talk to each other.\n7. Ascension\nYou’ll ascend your members into higher membership levels with you\nby inviting them to join and ascend your Value Ladder.\nLet’s dive deeper\ninto each element...\n47 46\nYou’ll create a Success Path with your new opportunity (that is the framework that\nproduces your members’ desired result).\nYour Success Path is your framework. So, what’s a framework? Brooke Castillo\nexplained it best:\nInside the Two Comma Club X member’s area, you’ll see how we’ve laid out the\nSuccess Path.ELEMENT 1:\nNEW OPPORTUNITY (SUCCESS PATH)\nYour framework is your map from\nwhere someone is to the result they’re\ntrying to get. It’s the step-by-step\nprocess you’re taking someone on.\n—Brooke Castillo\n“\n49 48\nYou’ll help your members consume the content by adding a members-only podcast.\nIf your members don’t consume your content, they won’t stay for very long. There’s lots\nof different ways you can encourage them to consume your content, including sending\nthem login emails and email sequences that push them back into your content.\nOur favorite way, though, is a members-only podcast, where your content is pushed directly\ninto their favorite podcast app. ClickFunnels can take all the content in your modules\nand turn it into an RSS feed. A member can subscribe to that and start listening to it on\ntheir drive, on their way to work, or when they’re working out. Then, if they cancel their\nmembership, the RSS feed stops working.\nInside the Two Comma Club X member’s area, you’ll see how we’ve set up our\nmembers-only podcast.ELEMENT 2:\nCONSUMPTION\n51 50\nYou’ll help your members improve each month by giving them a Masterclass training\non a certain topic from the Success Path and a Backstage Pass to show how you’re\nimplementing that topic.\nJust as Dan Kennedy explained, we should help our members improve and become\nbetter inside the new opportunity. So, each week, I create new content for my\nmembership, in addition to the content in the Success Path. This way, members can go\ndeeper on subjects and always feel like there’s something new and exciting coming up.\nIn our member’s area, we offer two trainings each month to help them improve on\nwhat they’re learning in our Success Path.\n• Masterclass: I teach a new concept each month in a 30-minute video.\n• Backstage Pass: I show behind the scenes of what we’re doing in regard to the\nmonthly masterclass topic.\nInside the Two Comma Club X member’s area, you’ll see how we’ve added two areas\nfor our monthly improvement called Masterclass and Backstage Pass.ELEMENT 3:\nMONTHLY IMPROVEMENT\n53 52\nELEMENT 4:\nMONTHLY REPAIR\nYou’ll help your members fix what they implement from the Masterclass training in a\nMember Makeover.\nIn addition to offering monthly improvement, Dan Kennedy explains we should also be\noffering monthly repair to help our members fix something that is broken.\nIn our member’s area, we offer one training each month to help one of our members\nrepair something they implemented from that month’s masterclass.\nMember Makeover: We help a member implement the concept correctly.\nOur content calendar is below, showing how we produce one new piece of content\nfor each week of the month, except on Week 4. Giving your members a break from\ncontent will help them to implement what you’ve just taught them. If you can’t imagine\nproducing a new piece of content every week, remember that you can batch your\ncontent. You can film all three pieces at once, or you can even produce several months’\ncontent at once. Just choose a strategy that works for you and start filming.\nInside the Two Comma Club X member’s area, you’ll see how we’ve added the area\nfor our monthly repair called Member Makeover.Week 1Masterclass\nTeach a new concept in 30 minutes.\nWeek 2Backstage Pass\nShow behind the scenes of what\nyou’re doing in regard to that month’s\nmasterclass concept.\nWeek 3Member Makeover\nHelp a member implement the\nconcept.\nWeek 4Implementation Week\nLet your members get caught up\n(don’t add content to Week 4).\n54 55\nYou’ll help your members gain mastery by offering carefully curated deep-dive training,\ncourses, files, and templates in your library / archive.\nTo encourage mastery in your frameworks, you should add a library or archive of all\nyour content that they can consume at their own pace after they have completed the\nSuccess Path. It also allows you to not repeat yourself, so if you’ve already gone deep\non a certain topic, you can refer your members to that specific training in the library.\nWe also put other training, contracts, swipe files, courses, and more in the library so\nyour members can go deeper on each specific topic.\nNOTE: This is NOT a place where you should dump every video, training, or file you’ve\never created. The library should still be a carefully curated area of your best content\nwhere your members can dive deeper and gain mastery in a certain topic.\nInside the Two Comma Club X member’s area, you’ll see how we’ve added the\narea for our library.ELEMENT 5:\nLIBRARY / ARCHIVE\n57 56\nYou’ll help your members gain connection by creating a group for them to talk to\neach other.\nAs Stu McLaren says:\nTo help your members connect (and answer each other’s questions), you can create\na group where they can chat with each other. ClickFunnels even has a community\nfeature built directly inside the member’s area so your members can have community\nand training in one place.\nHaving a community is another way to make your continuity program sticky so they\nstay. They keep coming back because they don’t want to miss out on what’s said, and\nthey build friendships in the community as well.\nInside the Two Comma Club X member’s area, you’ll see how we’ve added the tab for\nour community.ELEMENT 6:\nCOMMUNITY\nPeople come for the content\nand stay for the community.\n— Stu McLaren“People come for the content and stay\nfor the community.” —Stu McLaren\n59 58\nYou’ll ascend your members into higher membership levels with you by inviting them\nto join.\nWe learned all about ascension from Dan Kennedy and Bill Glazer whose entire\nbusiness was an ascension ladder. Their entire goal was:\nTheir members could go from Gold to Diamond to Diamond Plus to Peak Performers to\nPlatinum to Titanium, and each of those levels cost more money than the one before it.\nAfter buying Magnetic Marketing, we added internal ascension into our Magnetic\nMarketing brand.\n• Level 1 - Gold: $97/mo.\n• Level 2 - Diamond: $297/mo.\nSo, if you’re a Gold member, you’ll get sent to a landing page that will show you all the\namazing benefits of upgrading to a Diamond member.ELEMENT 7:\nASCENSION\nHow do we get our members to\nascend to the next level so we\ncan increase the amount of money\nevery member spends over time?\n—Dan Kennedy & Bill Glazer\n61 60\nLEVELS OF CONTINUITY\nYour continuity program should be designed\nto get your dream customers to their dream\nresult. As they move through your Value\nLadder, they’ll pay more to get additional help\nfrom you to achieve that result.\nMost of you will start out with (and maybe only\never have) just one level of your continuity. And\nthat is totally fine…for now.\nIf you remember, we showed these continuity\nlevels inside the Linchpin framework.\nIt’s important to remember that the reason\nyou have different levels in your continuity\nis that all the other pieces of your business\nstill fit into the Linchpin framework. So, each\nof your three offers shown in the Linchpin\nframework (as seen below) point back to and\nbuild your continuity.\nWe’ll talk more about all three of these offers\nsoon, but for now, here’s an overview of how\neach offer builds each level of your continuity.People will spend more\nmoney for the same content\npackaged in a different way.\n—Russell BrunsonType of\nOfferYour MIFGE\nbuilds:Your Bulk\nContinuity +\nOffer builds:Your High-Ticket Offer builds:\nLevel of\nContinuityLevel 1 Level 2 Level 3 (pick one)\nHow They\nGet SupportOn Their Own In A Group With CoachingExclusive\nMastermind\nExample\nPricing$97/mo. or\n$997/yr.$297/mo. or\n$2,997/yr.$997/mo. or\n$9,997/yr.$2,500/mo. or\n$25,000/yr.\nWhat to\nIncludeMany people\nhave one-time,\nlow-ticket\nproducts or\nservices, but you\nshould include\n(for free) a trial\nof your continuity\ninside that offer.\nThen, once their\ntrial has ended,\nthey continue on\nat $97/mo. (or\nwhatever price\nyour Level 1\nContinuity is).Many people\nhave a $997 or\n$1,997 product\nor course that\nthey sell after\na challenge or\nwebinar. Instead\nof selling that\none-time offer,\nyou should\ninclude (for free)\nbulk access (like\n6 or 12 months’\naccess) to your\ncontinuity inside\nthat offer. Then,\nonce their bulk\naccess has\nended, they\ncontinue on at\n$297/mo. (or\nwhatever price\nyour Level 1\nContinuity is).Many people\nhave a $10,000\noffer to get\ncoached for\na year. If you\nreframe your\n$10,000 offer to\nbeing a $997/\nmo. (or $9,997/\nyr.) offer, where\nthey continue\nwith you after\nthe first year at\n$997/mo., then\nyour offer turns\ninto (and builds)\nyour continuity.Many people\nhave a $25,000\nor $50,000 offer\nto work with\nthem for a year.\nIf you reframe\nyour $25,000\noffer to be a\n$2,500/mo. (or\n$25,000/yr.)\noffer, where they\ncontinue with\nyou after the first\nyear at $2,500/\nmo., then your\noffer turns into\n(and builds) your\ncontinuity.\n63 62\nWhen you’re ready to create more levels in\nyour continuity (or figure out how your cur -\nrent business fits into each level), here’s some\nideas to help you brainstorm what to include\nat each level.\nWhat’s the core problem you solve for your\ndream customers? Remember, whichev -\ner business can solve the problem the best\nWINS, so get really good at solving problems.\nTo create different levels in your membership,\nyou just need to decide how you will help your\nmembers achieve that dream result at each\nstep of your Value Ladder.\nRemember, the frameworks you teach remain\nthe same, it’s just HOW they consume it that is\ndifferent at each level.\nDuring Funnel Hacking LIVE, Bill Allen taught\nus that one of the best ways to distinguish the\nlevels of your membership is to understand\nwhat your customers need at each level. He\nsuggested we offer different levels for:\n• Tactics\n• Coaching (Includes Tactics)\n• Community (Mastermind)\n• Contribution (Purpose)\nAnother way to think of levels is to think of\nflying. You can either fly coach, first class, or\nin your own private jet! With each level on your\nValue Ladder, your customers should feel like\nthey speed up the process to success!For instance, if you want to create three levels\nin your continuity, you could sell the following\noffers at each level:\n• Level 1 (MIFGE): $97/mo.\n(Do It Yourself)\nThey’re going through your frameworks\non their own. The continuity / member -\nship includes the training on your frame -\nworks.\n• Level 2 (Bulk Continuity + Offer):\n$297/mo. (In a Group Setting)\nThey get all the tools. They’re going\nthrough the program and getting help\nfrom other members.\n• Level 3 (High-Ticket Offer):\n·$997/mo. (With Coaching)\nThey get the best service. They’re fully\nsupported with coaches, mentors,\nand friends. At this level, you might\ndecide to do Certification or a\ncoaching group with events.\n·$2,500/mo. (Exclusive Mastermind)\nThey get time with the Attractive\nCharacter plus hot seats and master -\nminding with members at their same\nlevel. These usually have prerequi-\nsites in order to apply.\nNow let me show you how we use the Linch-\npin framework in our Value Ladder at Click -\nFunnels today.\nRemember, the frameworks\nyou teach remain the same, it’s\njust HOWHOW  they consume it that\nis different at each level.\nCLICKFUNNELS LINCHPIN VALUE LADDER\nNotice that we have 3 offers on the Linchpin Value Ladder, and they ALL build our continuity:\n• Our MIFGE (Your First Funnel) builds our Level 1 Continuity.\n• Our Bulk Continuity + Offer (Funnel Builder Secrets) builds our Level 2 Continuity.\n• Our High-Ticket Offer (Certification or Two Comma Club X) builds our Level 3\nContinuity.\nAgain, you’re not selling a different opportunity at each level. You’re selling the same\nvehicle…but as they move up your Value Ladder, you give them more value, tools, training,\nand support to find success and achieve their dream result.\n64 65\nMAGNETIC MARKETING LINCHPIN VALUE LADDER\nBecause we’re a software company, we also\nhave three different tiers of our software. I’m\nshowing you this chart so you can see how\nyou can compare and contrast your different\nlevels of membership (with pricing options) if\nyou have a software company and you want to\nshow the different features at each level.\nYou’ll notice that:\n• The tier on the left (with the least\nnumber of features) isn’t shown on our\nLinchpin Value Ladder.\n• The tier in the middle (with more\nfeatures) is shown as Level 1 of our\nLinchpin Value Ladder.\n• The tier on the right (with the greatest\nnumber of features) is shown as Level 2\nof our Linchpin Value Ladder.\nHere’s another example of how you could structure your offers for each level of your\nmembership.\nNotice that we have 3 offers on the Linchpin Value Ladder, and they ALL build our continuity:\n• Our MIFGE (NO B.S. Letter) builds our Level 1 Continuity\n• Our Bulk Continuity + Offer (Diamond Upgrade) builds our Level 2 Continuity\n• Our High Ticket Offer (Mastermind) builds our Level 3 Continuity\nEveryone will structure their membership levels differently, from how much they\ncharge to what’s included at each level. Use our examples as a suggestion, but\nnot the rule\n67 66\nWHAT YOU COULD INCLUDE IN\nEACH LEVEL OF MEMBERSHIP\nValue Ladder Level 1 Level 2 Level 3\nKinda Like\nFlying:Coach First Class Private Jet\nExample\nPricing:$97/mo. $297/mo. $997/mo.\nLinchpin\nOfferMIFGEBulk Continuity\n+ OfferHigh-Ticket\nOffer\nWhat\nEach Level\nCould\nGet for\nContinuitySuccess Path ✓ ✓ ✓\nMonthly Masterclass ✓ ✓ ✓\nBackstage Pass ✓ ✓ ✓\nMember Makeover ✓ ✓ ✓\nCommunity ✓ ✓ ✓\nCourse ✓ ✓\nFacilitated Group\nCoaching✓ ✓\nMastermind ✓\nTo help you brainstorm what you might want to\ninclude in each level of your membership, we\nput together this chart. Note that we created\nthis example after looking at the best continuity models. However, it’s not set in stone. Feel free\nto change anything (including pricing) to work\nwith your business.\nAnd because I always get asked, “What\nshould I sell if I’m a __________________\nbusiness?”, we’ve included this chart so\nyou can see what your offers might look\nlike if you’re an info product, software, or\necommerce business. Again, we created this\nWHAT YOU COULD INCLUDE IN\nYOUR OFFER BASED ON YOUR\nTYPE OF COMPANY\nexample after looking at the best continuity\nmodels. However, it’s not set in stone. Feel\nfree to change anything (including the pricing)\nto work with your business.MIFGEBulk Continuity\n+ OfferHigh-Ticket\nOffer\nMembership\nPrice$97/mo. $297/mo. $997/mo.\nOffer PriceFree + $29.95 s&h,\nthen $97/mo.$1,997/yr.$9,997/yr. or $997/\nmo.\nINFO\nPRODUCTSFree Gift + 30-Day\nTrial of Membership\nSite12 Months’ Access\nto Membership Site +\nCourse + Facilitated\nGroup Coaching + 2\nFree Tickets to Virtual\nEvent + More12 Months’ Access\nto Membership Site +\nCourse + Facilitated\nGroup Coaching + 2\nFree Tickets to Virtual\nEvent + Mastermind &\nEvents to Implement\nthe Program + More\nSOFTWAREFree Gift + 30-Day\nTrial of Software\n(Limited Features)12 Months’ Access to\nSoftware (All Fea -\ntures) + Course + 2\nFree Tickets to Virtual\nEvent + More12 Months’ Access to\nSoftware (All Fea -\ntures) + Course +\nCoaching & Master -\nmind Events to Im-\nplement the Program\n+ More\nECOMMERCE Free Gift + 30-Day\nTrial of Product12 Months’ Supply of\nProduct + Course + 2\nFree Tickets to Virtual\nEvent + More12 Months’ Supply of\nProduct + Course +\nCoaching and Master -\nmind Events to Im-\nplement the Program\n+ More\n68 69\nChapter 3\nTHE MIFGE\nYour MIFGE Builds Your Continuity\nSTEP 2: Create Your MIFGE (Most Incredible Free Gift Ever)\nYou’ll create an irresistible offer that includes a free trial of your continuity.\nAs you now know, continuity income is the best\ntype of revenue you can have in a business. The\nproblem is that outside of live events (which I\nthink are the hardest thing to sell), continuity\nis the second hardest because someone is\nmaking a commitment not just to buy your\nthing but to keep buying it month after month\nuntil they cancel. Because of that, you have\nto create an offer that is so irresistible that\nsomeone is willing to make that commitment\nto get started.Recently, I bought Dan Kennedy’s company,\nMagnetic Marketing. The core of their\ncompany is their $97/month print newsletter.\nAs we started to work on the transition and\ndecide how to re-launch the company, I\nasked the Magnetic Marketing team that had\nbeen running his funnels in the past, “What\nwas the number one thing that you’ve done\nto grow membership to the newsletter over\nthe last decade?”\nThey smiled at me and said, “The MIFGE.”\n71 70\nI said, “The WHAT?!”\nThey replied, “The MIFGE: The Most Incredible Free Gift Ever.”\nAll of a sudden it clicked! I remembered that 18 years ago, when I came into\nDan’s world, it was because I bought The Most Incredible Free Gift Ever (yes, it\nwas even called that!). But I had no idea they had shortened the phrase to MIFGE\nbehind the scenes, or even that it was as big of a deal as I would soon learn.\nThe MIFGE (Most Incredible Free Gift Ever) is an offer so irresistible that someone\nis willing to try out your continuity program just to get that free offer. It always\nincludes continuity plus other bonuses. The bonuses can be digital and/or\nphysical products, and the offer doesn’t have to be 100% free. I’ve seen MIFGE\noffers that are $97…I’ve seen some that are all digital that you can buy for $1 or\n$7, or others that are free with $29.95 printing & shipping costs. It’s just an offer\nso irresistible that someone is willing to try out your continuity program just to\nget that irresistible offer.\n73 72\nFor example, one of the best MIFGE offers I’ve ever seen was the football\nphone! In the 1980s, Sports Illustrated was struggling to sell their magazine\nsubscriptions. That’s when they stumbled on a genius idea: Make a phone in the\nshape of a football and give it away FREE, and a free copy of the swimsuit issue\nwhen they paid for a year’s subscription of Sports Illustrated.\nThe football phone proved to be one of the most successful marketing campaigns\never. Over time, they created other MIFGE offers to get people to buy into their\ncontinuity, including sneaker phones or VHS blooper tapes, and with all those\ncampaigns, they sold 1.6 million new subscriptions between 1986–1991.1\nAfter I bought Dan’s company, I got a Google Drive with everything he’d ever\ncreated in the last 40 years, which is like treasure hunting. For fun, I typed in\n“MIFGE,” and it popped up 300 results with different ways they’d sold the MIFGE\nin the past, through sales letters, faxes, events, postcards, direct mail, inserts in\nbooks…you name it, they’d tried it!\nThen I saw that every MIFGE offer included a free trial of their continuity, their\nNO B.S. print newsletter. Seeing this, our #1 focus, after we bought the company,\nwas to create a new MIFGE offer and launch it to get new members, as well as to\nreactivate old members.Scan the QR code with your\nphone to see the original\nfootball phone ad.\nLet me show you exactly\nhow this MIFGEMIFGE offer\nworks...\n1. Malinowski, Erik. 2015. “The Funky Little Football Phone That Sold a\nMillion Magazines.” Rolling Stone, October 28, 2015.\nhttps:/ /www.rollingstone.com/culture/culture-sports/\nthe-funky-little-football-phone-that-sold-a-million-\nmagazines-58384/.\n75 74\nWhen we created the MIFGE for Magnetic Marketing, I knew that the majority of the\ninitial traffic for the launch would come from my list and Dan’s list. So, we created an\nirresistible offer that would have something exciting for both audiences.\nIn this offer, we put together both physical and digital products (plus a FREE 30-day\ntrial of the NO B.S. Letter) that they’ll receive FREE (+ $29.95 for printing, shipping,\nand handling). After the 30-day trial, they continue with their NO B.S. Letter member -\nship at just $97/month. You can see it in action at NOBSLetter.com .\nJust 14 days after we launched the MIFGE, we added almost 4,000 new people to the\n$97/month print newsletter (4,000 people x $97/month = $388k/month). If you mul -\ntiply that by 12, you get $4,656,000/year!\nI bet you’re thinking, “I need a MIFGE in my business, too!”MIFGE EXAMPLES:\nNO B.S. Letter\n77 76\nAfter seeing Magnetic Marketing’s MIFGE crush it, we created our own MIFGE for\nClickFunnels! You’ll see we have a huge offer put together of both physical and digital\nproducts (plus a FREE 30-day trial of ClickFunnels) that they’ll receive FREE (just\ncover $29.95 for printing, shipping, and handling). After the 30-day trial, they continue\nwith their ClickFunnels membership at just $297/month. You can see it in action at\nYourFirstFunnel.com .\nIt used to cost us $150-$200 to acquire a customer who got a free trial on\nClickFunnels.com , so it would take us 30–60 days to break even. Now, we drive traffic to\nthis MIFGE, and it only costs us $100 to acquire a free trialer. Even better…the Average\nCart Value is over $100 for every single person who takes the MIFGE (because we also\nhave an order form bump, upsell, and downsell), and so we’re usually at break even by\nday one!MIFGE EXAMPLES:\nYOUR FIRST FUNNEL\n79 78\nHere’s an example of the 100% digital MIFGE we created for ClickFunnels. You’ll see\nwe have a huge offer put together of digital-only products (plus a FREE 14-day trial of\nClickFunnels) that they’ll receive completely FREE. After the 14-day trial, they contin-\nue on with their ClickFunnels membership at just $297/month. You can see it in action\nat ILoveClickFunnels.com .\nBecause this is a 100% digital-only product, we don’t have any overhead to fulfill it.MIFGE EXAMPLES:\nILoveClickFunnels.com\n81 80\nNot only can you use a MIFGE to get people onto your continuity, you can also use one\nto ascend your members into higher levels of your membership. For example, when\nsomeone upgrades from Magnetic Marketing’s Gold level ($97/month) to Diamond\nlevel ($297/month), they’ll get a free physical copy of Dan Kennedy’s 443-page\nDiamond Faxes book. Because this is the only place they can get that book (and it\nincludes continuity), the offer becomes a MIFGE Upgrade. You can see it in action at\nDiamondUpgrade.com .\nAfter offering this new upgrade MIFGE, we had over 300+ people upgrade during the\nlaunch week from $97/month to $297/month to get Dan’s Diamond Faxes book as well\nas the higher level of continuity!MIFGE EXAMPLES:\nDIAMOND UPGRADE\n83 82\nTo teach you how to create a MIFGE, you need to understand three core parts of a\nMIFGE in relation to my Hook, Story, Offer framework that I teach in all three of my\nbooks—DotComSecrets, Expert Secrets, and Traffic Secrets.\n• MIFGE Hook\nYou’ll create a hook to promote your Most Incredible Free Gift Ever.\n• MIFGE Story\nYou’ll develop a story about why the offer matters right now.\n• MIFGE Offer\nYou’ll create an offer that includes your continuity + bonuses (digital and/or\nphysical).\nMIFGE HOOK\nYou’ll create a hook to promote your Most Incredible Free Gift Ever.\nDo you remember the story of the football phone? Sports Illustrated created a\nhook that said, “Here’s the unbelievable catch: The football phone is FREE if you\nget Sports Illustrated at their biggest Christmas savings ever, a year’s subscription\nat almost 65% off the cover price.”\nFor Magnetic Marketing, my hook is to “Get Over $19,997 Worth of ‘PURE’ Money-\nMaking Information for FREE” when they get a 30-day trial of the NO B.S. Letter.\nNotice how all of the important information about the offer is above the fold. I call\nthat going right for the jugular, because you don’t want to dance around it. It’s an\nirresistible offer, and you want to lead with that right away.HOW TO CREATE A MIFGE\n85 84\nYou might have noticed that we use the phrase “All you have to do is say ‘MAYBE’” on\nthe sales page. The key with the MIFGE is to delay their decision to say “Yes” right now.\nSo they can say “Maybe,” get a free gift, test drive it, and see if they like it, and if they\ndon’t, they can cancel.\nHere are a few of my favorite phrases to use in the messaging on our MIFGE\nsales pages:\n• When You Subscribe to _______________, You’ll Also Get __________ FREE!\n• We Want To GIFT You Over $________ Worth Of ____________...FOR FREE!\n• Most Incredible Free Gift Ever\n• Most Incredible Bribe Ever to Test Drive ________________\n• Get $__________ Worth of Gifts When You Sign Up For ___________________\n• $_____________ worth of _________________, and you’ll get it all free when\nyou join our _______________ today because I want to bribe you to join our\n____________________\n• We want to bribe you to join our _________________, so we’re going to\nput you through this really cool training called _____________to help you\n_________________________, and you’re going to get a free 30-day trial\nof ________________ and a whole bunch of other gifts just for trying out\n__________________\n• All you have to do is say “MAYBE”\n• When you join _______________ today, you’ll get ______________ FREE\n• The only way to get ______________ is to join ___________________\nMIFGE STORY\nYou’ll develop a story about why the offer\nmatters right now.\nEven though you have an irresistible offer,\nit doesn’t mean you should go out and start\nselling it right away just because it’s an amazing\noffer. You’ll want to use a story to put a spin\non your MIFGE to help it convert. Here’s a few\noptions that will help you to tell a story about\nyour MIFGE offer.\nWhy You Created The Offer\nYou can share the story behind why you put this\noffer together. For instance, I’ll be launching\nthe Secrets of Success MIFGE which includes\nmanuscripts no one has ever seen before! Now\nthat’s a great story! Also, when we put together\nthe Magnetic Marketing MIFGE, I shared the story\nabout when I bought Dan Kennedy’s company and\nfound all of his amazing trainings in his archives\nand how I had to get them out to everyone.\nWhy You’re Making The Offer Today\nYou can use any holiday and create a promotion\naround it to make it feel urgent. It’s the same\noffer, but you’re just tweaking the promotion. An\neasy way to do that is to have the same landing\npage for your MIFGE but to change your ads and\nsocial media posts to talk about the seasonal\npromotion. Some holidays to create promotions\naround are listed below, but you can use any\nholiday or event to promote your MIFGE.\n• Your Birthday\n• Valentine’s Day\n• Easter\n• Back to School\n• Halloween\n• Thanksgiving\n• Black Friday\n• Cyber Monday\n• Christmas\nMIFGE OFFER\nYou’ll create an offer that includes your\ncontinuity + bonuses (digital and/or physical).\nThe first thing you should put in your MIFGE is\nyour continuity. You can include a free 7-day,\n14-day, or 30-day trial. You don’t want anyone\nto be surprised that they are subscribing to your\ncontinuity, so the core thing you’re offering is\nyour continuity.\nPRO TIP: Don’t do forced continuity or put your\ncontinuity on upsells or order bumps because\nmost people don’t read those carefully. You\nwant to use words like “subscribe” front and\ncenter so they know exactly what they’re signing\nup for, but they want your free gift so bad they\ndon’t mind trying out your continuity, too.\nWARNING: The problem some people\nmake is that they try to hide the continuity.\nDO NOT DO THIS. This is the fastest way\nto lose your merchant account, get upset\ncustomers, and create a ton of headaches\nfor you. The key is to sell the continuity.\nThe core thing you’re selling is the\ncontinuity, so don’t put it into the stack\nas a tiny bullet point that no one will see.\nInstead, talk about your membership\nbenefits and why  someone would want\nto be a member. Then show them the\nbonuses or bribe. I’ve seen too many\npeople who try to hide the continuity in\nthe fine print lose their businesses. I’m\nalso not a fan of plugging continuity into\nan order form bump or upsell. I want it\nfront and center so people know exactly\nwhat they are subscribing to.\nYou’ll also add in a bunch of digital and/or\nphysical products to increase the value of the\noffer to push them over the fence to join your\ncontinuity. We’ve found that when we ship a\nhuge box of books to our customers, not only\ndo they love getting something in the mail, but\nit also helps them to stay on the continuity, so\nwe’re big fans of creating a digital + physical\nMIFGE\n87 86\nRemember, more doesn’t always mean\nbetter. You want everything they get to\nhelp them, not overwhelm them.\nAlso, a MIFGE offer shouldn’t be a\n“complete” product. As Ryan Deiss\nhas often said, your MIFGE should be\n“useful, but incomplete.” All of the\nthings in my MIFGE offers are cool,  they\nhave awesome stories associated with\nthem, and they are very useful… but the\ncomplete system, frameworks, training,\netc… are all found within the actual\nmembership program. Also, because\nyour customers and leads are in different\nplaces on their journeys, the MIFGE is an\nopportunity to get everyone caught up to\nspeed and on the same page.\nExamples of what you might want in your\nMIFGE offer (in addition to joining your\ncontinuity):\n• Digital Products\nIdeally, products you’ve already created\nor could create with minimal effort\n·Courses\n·Templates\n·Swipe files\n·Virtual event tickets• Physical Products\nIdeally, products that are easy to ship,\ncost less than $10 each, and stay visible\nlong-term\n·Stick Letter (The goal of this\nletter is to get your members to\nstick by bringing back their original\nexcitement and explaining what they\nget in the membership.)\n·Postcard to upgrade to the next\nlevel (Take every chance you can to\nascend your members.)\n·Books or workbooks (These are\nusually kept on tables or counters\nand are rarely thrown away.)\n·Branded clothing like t-shirts or\nhats (Your customers will wear their\nnew identity with pride.)\n·Branded swag like backpacks or\ncanvas tote bags (Your customers\nwill give you free advertising.)\nRemember, more doesn’t more doesn’t\nalways mean better.always mean better. You\nwant everything they\nget to help them, not\noverwhelm them.\n89 88\nChapter 4\nTHE\nATTRACTIVE\nCHARACTER\nFLYWHEEL\nYour Attractive Character Flywheel Promotes Your MIFGE\nAnd Dramatic Demonstrations\nSTEPS 3, 6, & 9: Launch Your Offers to the World\nYou’ll use the Attractive Character Flywheel to sell your MIFGE\nand fill your Dramatic Demonstrations #1 and #2.Yes, there are three steps in this chapter, so\npay close attention.\n• Once you’ve created your continuity\nand MIFGE, it’s time to launch your\nMIFGE to the world (Step 3) using\nthe Internal Pressure Launch and the\nAttractive Character Flywheel!\n• Then in the future, after you’ve created\nyour Dramatic Demonstration #1, you’ll\ncome back to this chapter and repeat the\nexact same process to fill your Dramatic\nDemonstration #1 (Step 6).\n• Finally, after you’ve created your\nDramatic Demonstration #2, you’ll come\nback to this chapter and repeat the\nexact same process to fill your Dramatic\nDemonstration #2 (Step 9).\nBut first, a little clarification about what an\nAttractive Character is. Usually, you need two\ntypes of people to run a business like this.\nYou need an Attractive Character who is the\nfront-facing personality behind the brand, and\nyou need an Integrator / Operator who can\nmanage all the behind-the-scenes parts. Gen-\nerally, the roles should look like:\n• The Attractive Character is responsible\nfor creating all the content in the member’s\nareas, running challenges and webinars,\nselling the MIFGE, and making videos.\n• The Integrator / Operator is responsible\nfor all the technical aspects of the\nbusiness, including building the funnels,\ncreating the ads, managing the sales, and\ncreating the structure for the business.\nOften, when you’re starting out, you’ll play\nboth roles, but if you’re not skilled enough to\nplay both parts, you should recruit another\nperson or two to help you. As your business\ngrows, you’ll likely bring on even more people\nto fill the individual needs of your business.\nTo sell your MIFGE or fill any of your Dramatic\nDemonstrations, you’ll want to:• First do an Internal Pressure Launch,\n• Then continue publishing content with\nThe Attractive Character Flywheel.\nINTERNAL\nPRESSURE LAUNCH\nThere is a simple 3-step process to make\nmoney:\n• Find a Hot Market.\n• Ask Them What They Want.\n• Give It To Them.\nThe best way to do this is to follow this 30-day\nplan to launch your offer to the world, starting\nwith your list:\n• Week 1: List Building (Prepare\nYourself to Catch Them)\nYou’ll curate your personal page on\nFacebook and create a “Coming Soon”\npage.\n• Week 2 (Days 5–14): List Building (Be\nAwesome)\nYou’ll create valuable posts and answer\nquestions in Facebook groups.\n• Week 3: Pre-Launch\nYou’ll increase the desire for your MIFGE\nand continue to build up your early bird\nlist.\n• Week 4: Launch\nYou’ll launch your MIFGE to your list and\nsocial media channels.\nNow that you know where we’re headed, let’s\ndive right into it.\nPRO TIP: You can use this Internal Pressure\nLaunch to launch any offer you’ve created. So,\nif you ever see the word MIFGE, you can simply\nreplace that word with whatever else you’re\nselling.\n90 91\nIn order to build or grow your list, you need to do a few steps first to prepare:\n• Change Your Cover Photo On Your Facebook Personal Page\nYour personal page isn’t a place to spam your friends and family with business\ncontent, but it definitely is a place to tell the world who you are and what you’re\ndoing in business. The best place to do that is on your Facebook cover photo. It’s\nlike a billboard for yourself.\n• Create A Coming Soon Page\nFollow the instructions in the training to create a Coming Soon page. Make sure\nyour headline and sub-headline share the benefits that your MIFGE will give\nthem. NOTE: This is NOT a lead magnet, so there’s nothing you’re giving them\nyet. They’re just opting in so they get notified first when you launch your MIFGE.\n• Add a Link On Your Facebook Page To Your Coming Soon Page\nOn this page, you’ll start collecting email addresses that you can later\npromote to.\n• Change Your Bio To Match Your Positioning Statement\nUse this format: I help (niche) to (result) through (new opportunity).\n• Start Posting Consistently\nCreate social media posts that are relevant to your MIFGE and post consistently\n(minimum 3X/week; ideally daily) on your personal page. After you tell your story\n(in a text post or on Facebook Live) then end with a call to action for them to opt\nin to your Coming Soon page.\n• Join 5–10 Groups (Each With At Least 100K People)\nSearch Facebook for the topic that your MIFGE is about and join the top groups\nso that you’re in groups with a total of at least 100K people.WEEK 1: LIST BUILDING\n(Prepare Yourself to Catch Them)\nYou’ll curate your personal page on Facebook\nand create a Coming Soon page.\n93 92\nNow that you’re all set to collect email addresses, it’s time to start helping so you can\nbuild your list. You should always be list building…don’t stop!\n• Provide Value In The Facebook Groups\nAfter you’ve been accepted, the goal isn’t to spam them with your link, as\nyou’ll probably get kicked out. Instead, post valuable content, answer three\nquestions per group (that have a lot of comments in it already), and start having\nconversations. DO NOT sell anything.\nOnce the group members start realizing that you’re posting valuable content,\nthey’ll usually click on your name to see what you do. Once they land on your\npersonal page, they can see that you have a Coming Soon page and join to be\nnotified when it’s live.\nA second benefit to this is it allows you to test out your hooks and see what lands.\nIt also allows you to learn more about your dream customers, their problems,\ntheir dreams, and how you can help them.WEEK 2 (Days 5–14):  LIST BUILDING\n(Be Awesome)\nYou’ll create valuable posts and answer questions in Facebook groups.\n95 94\nYou’ve been building your list, so now it’s time to get it warmed up for your upcoming\nMIFGE offer. Here’s our 5-day email sequence that will get them primed to buy! Each\nday, you’ll create a Facebook post and send out an email to your list based on the\nday’s content below. On Days 4–5, you’ll also post on all your other social media\nchannels and lists.\n• Day 1: Ask Them What They Want\nSay something like: “I’m working on this project. You’ve probably seen my posts\nsharing about it. I have ________________ coming out soon, and I’m very\nexcited. I want to make sure this is the best thing in the world. So, what do you\nwant me to make sure I cover in it so you get all your questions answered and\nit’s exactly what you need? What’s your number one question or concern about\n___________________?\nBe sure to be as specific as possible (a niche within a niche within a niche) to get\nthe best engagement on your post.\n• Day 2: “Oh My Gosh!”\nThank them for all the responses you got back, and let them know you’re going to\ngo add it all into the new offer you’re creating.\n• Day 3: Hold Me Accountable\nSay that you need them to hold you accountable because you want to launch it\nthe next week and you need their help to complete it. Then invite them to get on\nthe early bird list (that is on the Coming Soon page) if they aren’t already so they\ncan get access to the offer a day before anyone else.\nTo get them on both platforms, your email should link to your Facebook post (tell\nthem to comment “I’M IN” on the post so it holds you accountable), while your\nFacebook post should have a link to join your early bird email list.\n• Day 4: Early Bird\nRemind them to get on the early bird list.\n• Day 5: Closing Early Bird List\nRemind them to jump on your early bird list because you’re closing it at the end\nof the night.WEEK 3: PRE-LAUNCH\nYou’ll increase the desire for your MIFGE and continue\nto build up your early bird list.\n96 97\nYou’ve made it! It’s time to launch your MIFGE to the world! Here’s our 6-day email\nsequence that will push them off the fence and into your customer list! Each day\n(with the exception of Day 1), you’ll create a Facebook post and send out an email to\nall of your social media channels and your lists based on the day’s content below.\n• Day 1: Early Bird Launch\nSend an email only to your early bird list, letting them know they can get your\nMIFGE now, 24 hours before everyone else, because they’re an early bird.\n• Day 2: Official Launch!\nPromote your MIFGE to everyone. (Include your early bird list for this and each\nof the days below.)\n• Day 3: Why…\nAnswer the question: “Why are you doing this?” They might wonder why you’re\ngiving it free when you could sell it for $1,000. Let them know you’re giving\nit away for free because you want them to be part of your membership. You\nknow they’re going to need XYZ products after they join your membership, so\nyou thought you would just give them to them now for free so they could find\nsuccess quicker.\n• Day 4: Facts & Figures\nAll of the emotional buyers bought on Days 1–3, so now it’s time to explain\nlogically why they should buy it now.\n• Day 5: Closing Cart\nKevin Richards, the COO of ClickFunnels, says, “The only reason we open the\ncart is so we can close the cart.” Let them know that you’re closing the cart soon\nbecause it’s time for you to go help everyone who joined, and you’d love to help\nthem, too.\n• Day 6: Last Call!\nWhatever sales you make on Day 1, you’ll usually match on the last day. Be\nsure to bombard your lists and social media channels at least three times on\nthe last day.WEEK 4: LAUNCH\nYou’ll launch your MIFGE to your list and social media channels.\n99 98\nA flywheel is “a heavy, revolving wheel that stores kinetic energy to increase the\nmachine’s momentum and provide greater stability” if power interruptions occur.2\nBut in the case of ClickFunnels, it’s our proven process to get consistent traffic\ninto your funnels even when your traffic sources might change over time or even\ngo away. At any moment, Facebook or Google or YouTube can decide to shut down\nyour ads or ban your account, and you need to have enough momentum already\ncreated from as many traffic sources as possible that you can ride out any ups and\ndowns in the future.\nWe all know that the best time to plant a tree is 20 years ago, but the second-best\ntime is right now. That’s exactly how we want you to think about your Attractive\nCharacter Flywheel. Regardless of what you’ve done in the past, you are starting\nright now to build your traffic for the future.THE ATTRACTIVE\nCHARACTER FLYWHEEL\nWhile there are many things you can do to drive traffic to your funnels, I’m going\nto focus on the most important tasks that produce the biggest return for your\ntime. These are the tasks that, after they are done consistently over time, will\ncreate so much traffic to your funnels it will be impossible to turn it off.\n• Daily Emails\nYou’ll create a daily email to stay in connection and communication with\nyour list.\n• Dream 100 / Collabs\nYou’ll do joint ventures, partnerships, and collaborations with others who\nhave a list.\n• Organic Content (Twitter / Reels / TikTok / Shorts)\nYou’ll create short, organic content to increase your chances for semi-viral\nand viral posts.\n• Attractive Character Ads\nYou’ll create content as the Attractive Character to turn into paid ads.\n• Your Show (Blog, Vlog, Podcast)\nYou’ll publish consistently to keep your followers warm.PARTS OF THE FLYWHEEL\n2. Encyclopedia.com. 2018. “Flywheel.” Last modified May 21, 2018.\nhttps:/ /www.encyclopedia.com/science-and-technology/\ntechnology/technology-terms-and-concepts/flywheel.\n101 100\nThese are the two types of email sequences we suggest you send out.\nSOAP OPERA SEQUENCE\nI learned about the Soap Opera Sequence emails from André Chaperon. He suggests we\nuse our emails to tell a story to connect with our followers. The key is to always include\na hook at the end of each email that sets up the next day’s email, hooks them with a\ncliffhanger, and entices them to open up your email the next day to keep reading, hence\nthe term: Soap Opera Sequence. Each email closes the loop from the day before and\nopens a new loop that won’t be closed until the next day.\nAny time your customers interact on your funnels or come into your world, they should\nbe put on a specific 3- to 5-day Soap Opera Sequence which warms them up and invites\nthem to take the next step with you up your Value Ladder. Here’s some examples:\n• When someone joins your list:\nYou should send them emails thanking them, welcoming them, and inviting them\nto take their next step with you.\n• When someone opts in for a product funnel:\nYou should send a specific email sequence designed to help them buy after a set\nnumber of days.\n• When someone buys a product:\nYou should send them emails thanking them, giving them access to what they\nbought, and inviting them to take their next step with you.\nFor your offers, you should create (at a minimum) a Soap Opera Sequence for:\n• When someone joins your list (be sure to invite them to buy the offer).\n• When someone buys your offer (after you give them access, you can ascend\nthem to your next offer).DAILY EMAILS\nYou’ll create a daily email to stay in connection\nand communicate with your list.\nSEINFELD EMAILS\nAfter they complete all our Soap Opera Sequence emails, they drop into our daily broadcast\nemails, which we call our Seinfeld emails. Seinfeld emails are a concept we learned from Ben\nSettle. He sends out an email to his list every single day, and at the bottom of every email, he\nincludes an invitation to join his newsletter, which is a monthly continuity.\nEach day, we write an email, and we can drive traffic to whatever offer we want. You can write an\nemail every day (minimum 3–5 times per week) and push them to your offer.\nWe make more money from our own email list than we do on paid ads. You can pay for ads, but\nmake sure those ads are going to landing pages that build your email list so you own your own\ntraffic.\n103 102\nDREAM 100 / COLLABS\nYou’ll do joint ventures, partnerships,\nand collaborations with others who have a list.\nThe Dream 100 is all about asking the questions: Who has the attention of my dream\ncustomers…and how do I get in front of them?\nBefore we launch anything, we sit down and think about who our Dream 100 are (in\nother words, who is the most likely to promote our offer). We create a huge list of\ninfluencers and business owners who have lists on different platforms, then we start\nbuilding relationships in the hopes that, sometime down the line, they’ll be willing to\npromote for us because we can work with them and give them a commission off all the\nsales that come from their followers.\nIt’s also a numbers game, so you might reach out to 100 people, have 30 that say they\nwill, and 10 actually promote.\nJust because someone has a huge audience doesn’t mean their collaboration will\nresult in huge sales for you. Their audience might not be a good fit, they might not\nbe conditioned to buy, or the influencer might not promote in the way you hoped\nthey would. Sometimes the smaller influencers have a better relationship with\ntheir followers and turn out to be the best partners. When picking your Dream\n100, go for the big fish and the little fish, too.\nYou’ll need to do research and start writing down as many people as you can think\nof that might promote for you, then you’ll need to start building relationships with\npeople now that you think might promote in the future. If you’re not able to get any\npartnerships yet, that’s okay because you can always buy ads and target your Dream\n100’s followers.\n105 104\nORGANIC CONTENT\n(TWITTER / REELS / TIKTOK / SHORTS)\nYou’ll create short, organic content to increase\nyour chances for semi-viral and viral posts.\nWhile I wasn’t focused on growing our organic presence in the past (because we grew\nour company primarily through paid ads), I’m now focusing more on organic after\nseeing how Alex Hormozi’s social channels exploded once he focused on organic, too.\nHe gets 50,000–60,000 views on each piece of content he puts out, so if you’d like that\nkind of traffic, you should model his framework to get the maximum engagement and\nexposure on your content:\n1. Test out your hooks on Twitter first.\n2. The ones that get the most engagement become your content inspiration, so\nyou take that hook and film yourself talking about it for 15–20 minutes.\n3. Then take that long-form content and post on:\n• YouTube\n• Podcast\n• Blog\n4. Then cut up each of the long-form content into at least five short, 15–30 second\nvideo clips and post on:\n• YouTube Shorts\n• Instagram Reels\n• TikTok\n• LinkedIn\n107 106\nATTRACTIVE CHARACTER ADS\nYou’ll create content as the Attractive Character to turn into paid ads.\nYou’ll want to create video ads to promote your offer. They’re not long; they might be\njust 15-, 30-, or 60-seconds each. Then you’ll also create other ads without your face\nin them. You’ll test your ads and keep the ones that give you the highest ROI (return\non investment).\nPRO TIP: Anything you do in your daily life can be turned into an ad!\n109 108\nYOUR SHOW (BLOG, VLOG, PODCAST)\nYou’ll publish consistently to keep your followers warm.\nEvery day, you should publish on the platform that you feel the most comfortable with.\nFor instance:\n• If you’re comfortable with writing, then you should create a blog.\n• If you’re comfortable with speaking, then you should create a podcast.\n• If you’re comfortable with being on camera, then you should create a daily vlog.\nIf you film a vlog, you can publish the video, the audio as a podcast episode, and\ntranscribe it for a blog—three for one! So even if you’re not 100% comfortable being on\ncamera (who is?), I encourage you to still try it out. You’ll get better the more you do it.\nI truly believe that if you publish every day for a year, you won’t have money problems\na year from now. Why? Because publishing consistently has a lot of benefits, like:\n• It gives you time to find your voice.\n• It gives your audience time to find you.\nSo, what should you talk about every day? Here’s a few ideas:\n• Document your journey:\nTalk about what you’re doing that day to go toward your goals.\n• Test out your stories:\nTry different hooks and endings and see which version of your story lands best.\n• Answer questions:\nEach day you can answer one question your followers have.\n111 110\nContinue to publish daily and build your Attractive Character Flywheel so you\ncan get more traffic into your funnel(s). Then evaluate your results, test things\nout, and improve it so you get a higher ROI.\nYou can also drive traffic to any of your funnels and offers using Facebook ads and\nsocial media posts. Don’t forget to add your MIFGE offer to the thank-you pages\nof your current offers!\n• Lead Page / Optin Page  >  Thank-You Page with MIFGE Offer\n• Challenge Registration Page  >  Thank-You Page with MIFGE Offer\n• Webinar Registration Page  >  Thank-You Page with MIFGE Offer\n• Book Sales Page   >  Thank-You Page with MIFGE Offer\n• Summit Registration Page  >  Thank-You Page with MIFGE Offer\n• Etc.…You get the idea!\nDon’t move on to the next step in the Linchpin framework until you’re getting\nconsistent, repeatable sales in first your MIFGE, then your Bulk Continuity + Offer,\nand finally your High-Ticket Offer.WHEN TO MOVE ON TO\nTHE NEXT STEP OF THE\nLINCHPIN FRAMEWORK\n113 112\nChapter 5\nDRAMATIC\nDEMONSTRATION\n#1\nYour Dramatic Demonstration #1 (Challenge or Webinar) Sells Your Bulk\nContinuity + Offer (Your SLO!)\nSTEPS 4 & 5: Create Your Bulk Continuity + Offer…\nand Dramatic Demonstration #1\nYou’ll create an offer that includes free Bulk Continuity (usually 6 or 12 months)...and you’ll cre -\nate a challenge or webinar to sell your Bulk Continuity + Offer (plus you’ll put your MIFGE on the\nthank-you page of your challenge or webinar to get more members).After you launch your MIFGE, you’re ready to\ncreate your Bulk Continuity + Offer and your\nDramatic Demonstration #1.Remember that your Bulk Continuity + Offer\nwill be the offer in the middle of your Value\nLadder, and it will fill your Level 2 Continuity.\nBut first, I’d like to go over the foundational principle of the Offer that I explain in my book,\nDotCom Secrets.\n114 115\nFROM A PRODUCT TO AN OFFER\nWhen you’re trying to sell the same product (or commodity) as someone else, the only\nadvantage you have is to be the cheapest. And that’s how most people compete: by lowering\nthe price. But when everyone is competing on price, it’s a race to the bottom.\nDan Kennedy once said:\nIf you fight on price, you lose your margins, you can’t pay for advertising, you can’t pay for and\nhire the best team, and you can’t provide the value your dream customers deserve.\nOn the other hand, when you build an offer that is perceived as inexpensive to those customers\nbecause you’ve created so much value (and a lot of times the price is more expensive than the\ncompetition), then you are able to serve them at the highest level. This is a big mindset shift\nthat you need to make to become successful.\nThe solution is to de-commoditize what you’re selling, or in other words, add more products or\nservices to what you’re selling so it’s no longer a commodity…it’s now an offer.\nThere is no strategic advantage\nof being the second lowest\nprice leader in town, but there\nis a huge strategic advantage\nof being the most expensive.\n—Dan KennedyAn Offer is a stack of digital and/or physical goods and/or services that will help your dream\ncustomers get better results than if they only bought the product. Because of the combination\nof items in your offer, you add more value than anyone else and no one else can compete on\nprice because they can’t sell a similar offer as you.\nGenerally, the goal of any offer is to:\n• Increase the perceived value of what is being sold.\n• Make the thing being sold unique to you and only available within this special offer.\nAn OfferOffer is a stack of digital\nand/or physical goods and/or\nservices that will help your\ndream customers get better\nresults than if they only\nbought the product. Because\nof the combination of items\nin your offer, you add more\nvalue than anyone else and\nno one else can compete on\nprice because they can’t sell\na similar offer as you.\n116 117\nRemember, your Bulk Continuity + Offer is your new Self-Liquidating Offer or SLO, so all the\nmoney you make on this step is meant to go back into ads.BULK CONTINUITY + OFFER\nThe first item in your offer stack is your Bulk Continuity offered for free…when they invest in your\noffer. When you sell it, you’ll say something like, “We’ll give you ___ months of ______________\nfor FREE, when you invest in this ______________. Plus, you’ll also get this bonus, and this\nbonus, and this bonus.” (Then the continuity will renew at the monthly (or yearly) rate after the\nbulk period has ended.)\nHere is an example of the slide where I offer my Bulk Continuity for free (when they invest in my\ncore offer).\n119 118\nEXAMPLE: OFFER\nHere is an example of my offer stack for the ClickFunnels offer.\nWhen you create your Bulk Continuity + Offer, it might look like:\n• Three, six, or twelve months FREE of your Bulk Continuity.\n• A training component for them to learn how to be successful with the continuity / product\n/ service (like a course, training, challenge, or program).\n• Bonuses that will help them find success (like tools, contracts, legal documents, sales\nscripts, or templates).\nThe offer that you make on your webinar or challenge, in theory, is very similar to the first MIFGE\noffer you created, because you’re still giving them a Most Incredible Free Gift Ever—access to 3, 6,\nor 12 months of your continuity for free. You’ll notice that you also structure your High-Ticket Offer\nthe same way in the next chapters.\nMIFGEBulk Continuity\n+ OfferHigh-Ticket\nOffer\nMembership\nPrice$97/mo. $297/mo. $997/mo.\nOffer PriceFree + $29.95 s&h,\nthen $97/mo.$1,997/yr.$9,997/yr. or $997/\nmo.\nINFO\nPRODUCTSFree Gift + 30-Day\nTrial of Membership\nSite12 Months’ Access\nto Membership Site +\nCourse + Facilitated\nGroup Coaching + 2\nFree Tickets to Virtual\nEvent + More12 Months’ Access\nto Membership Site +\nCourse + Facilitated\nGroup Coaching + 2\nFree Tickets to Virtual\nEvent + Mastermind &\nEvents to Implement\nthe Program + More\nSOFTWAREFree Gift + 30-Day\nTrial of Software\n(Limited Features)12 Months’ Access\nto Software (All\nFeatures) + Course\n+ 2 Free Tickets to\nVirtual Event + More12 Months’ Access\nto Software (All\nFeatures) + Course\n+ Coaching &\nMastermind Events\nto Implement the\nProgram + More\nECOMMERCE Free Gift + 30-Day\nTrial of Product12 Months’ Supply of\nProduct + Course + 2\nFree Tickets to Virtual\nEvent + More12 Months’ Supply\nof Product + Course\n+ Coaching and\nMastermind Events\nto Implement the\nProgram + More\nIn the very first chapter, I told you all about my webinar where I sold ClickFunnels. In the offer,\nI FIRST gave them access to a free 6-month subscription to ClickFunnels when they got my\nFunnel Hacks course (and more bonuses)...all for just $997! (After the 6 months, they would\ncontinue on at the $297/month level of my continuity program.) Even though this is a newer\nversion of the same offer, my original offer looked very similar.EXAMPLE OF THE MINIMUM OF WHAT YOU\nCOULD INCLUDE IN YOUR OFFERS:\n121 120\nDRAMATIC DEMONSTRATION #1\nAfter you create your Bulk Subscription + Offer, you’ll need to\ncreate a Dramatic Demonstration to sell it.\nA Dramatic Demonstration is an event that is so “loud” that eventually everyone in your\nmarketplace will hear about your offer.\nOur favorite Dramatic Demonstration funnels are a Challenge Funnel and a Webinar\nFunnel because both have a free registration page and time between when they\nregister and when they start going through the live training. That gap in time makes\nthe first MIFGE possible, and then sets you up during the training to make your second\nMIFGE offer, your Bulk Continuity + Offer. You can choose whichever one you prefer (or\nif you’re crazy like me, you can do both!)\nI suggest that you run a new challenge or webinar every quarter. With your challenge,\nyou can simply change the hook and teach a different topic or training to help your\nchallengers get a different result and/or overcome a different limiting belief.\nThe key is to structure your presentation in such a way that, in just 90 minutes (for a\nwebinar) or 5 days (for a challenge), you can create a desire for the thing you want to sell\nat the end, and build up the perceived value SO HIGH that, within that short window, you\ncan get a complete stranger to hand over their credit card and buy whatever products\nor services you’re selling them. You do that by creating what is called a “through-line”:\nevery step, every slide, every moment of your Dramatic Demonstration is architected\nto get someone to buy your product or service.\nA Dramatic DemonstrationDramatic Demonstration is an\nevent that is so “loud” that eventually\neveryone in your marketplace will\nhear about your offer.\n123 122\nUSING THE PERFECT WEBINAR\nIN A WEBINAR\nInside a webinar, you’ll use all the pieces in the same order. Ideally, your webinar\nshould be 90 minutes, so just follow the structure in the picture below to build  out\nthe timing of your webinar.\nTHE PERFECT\nWEBINAR FRAMEWORK\n• Origin Story + New Opportunity + Vehicle False Beliefs\n·Origin Story: Tell the story of how you discovered the new opportunity.\n·New Opportunity: Show them the new opportunity (that is the vehicle).\n·Vehicle False Beliefs: They want the result, but they’re unsure the vehicle will\nhelp them achieve it, so you have to help them overcome their vehicle false beliefs.\n• Internal False Beliefs\n·They want that new opportunity, but they’re not sure if they can be successful,\nso you have to help them overcome their internal false beliefs.\n• External False Beliefs\n·Even if they do believe they can do it, they’ll blame someone or something else\nas the reason why they won’t be successful, so you have to help them overcome\ntheir external false beliefs.\n• Stack & Close\n·Stack: Show them everything they get with the offer, stacking all the products on\ntop of each other to increase the value, then show the real price to surprise them.\n·Close: Add urgency and scarcity so they have to buy now to get the best offer.\n• Logic Repitch\n·Use price comparisons and other tools to show that what they’re getting is a\ngreat deal. You can also use that time to answer any frequently asked questions\nthat usually come up (i.e., more objections and false beliefs).\nNow that you know what’s inside of The Perfect Webinar framework, I’ll show you how\nto use the framework inside your Dramatic Demonstration #1.My favorite framework to walk people through\nduring our Dramatic Demonstrations is The\nPerfect Webinar. While it was developed\nfor webinars, we use the same framework\nto produce our challenges, too. The Perfect\nWebinar is our through-line, so let me show you\nhow we use it to sell our Bulk Continuity + Offer.Here’s a high-level overview of The Perfect\nWebinar, then we’ll dive deeper into how to\nuse it for a webinar and a challenge. (NOTE:\nIf you want to really go deep and master this\nframework, I recommend reading my book\nExpert Secrets. This book dives deep into how to\nsell using this framework. You can get that book\nfor free at ExpertSecrets.com .)\n125 124\nUSING “THE PERFECT WEBINAR”\nIN A CHALLENGE\nInside a challenge, you’ll use all the pieces in the same order, but this time, you’ll\nput each section into a different day as shown on the picture below.\nDon’t forget that when you’re building out your Dramatic Demonstration #1 funnel, you\nneed to put your MIFGE on the thank-you page after they register for your challenge\nor webinar.\nPUT THE MIFGE ON THE\nTHANK YOU PAGE\nRemember how we told you to add your MIFGE to your thank-you page, after they register\nfor your challenge or webinar? Everyone else (me included) used to put a low-priced SLO\non the thank-you page, but after we discovered that the real money was made on the\nthank-you page…\nNow we put our MIFGE on the thank-you page after they register for our challenge\nor webinar.\nHere’s how you can promote your MIFGE on the thank-you page:\n• If I’m doing a WEBINAR, I’ll start by saying: “On the webinar, I’m going to show\nyou how to __________. So, click on the button below to get a free ___-day trial of\n___________. Check it out, then on the webinar I’ll show you how to find success\nwith it. At the end, if you decide you don’t like it, you can cancel it….”\n• If I’m doing a CHALLENGE, we will wrap the MIFGE offer into a “VIP UPGRADE”\nfor the challenge saying: “Get a free ___-day trial of ______________ when you\nupgrade, and you’ll get a free VIP upgrade, too, so you can have lifetime access to\nthe recordings plus be part of our VIP-only Q&A Sessions on Zoom so you can ask\nour speakers any of your questions….”\nWhile some people will get your MIFGE, some won’t. However, your challenge or\nwebinar is crucial for your members to go through so they STICK in your membership\nbecause it will help BOTH groups of people to overcome their limiting beliefs, give them\nconfidence they can be successful with your continuity program, educate them about\nhow your continuity will solve their problems, and indoctrinate them into your culture.\nThe very act of\ngoing through\nyour challenge\nor webinar\nwill help those\nwho got your\nMIFGE to STAY\nlonger in your\ncontinuity,\nand those\nwho didn’t get\nyour MIFGE to\nBUY your Bulk\nSubscription +\nOffer and STAY\nlonger, too.\n127 126\nExamples Of\nDRAMATIC\nDEMONSTRATION #1\nWEBINAR FOR A\nDRAMATIC DEMONSTRATION #1\nHere’s an example of one of our webinar funnels.\n1. Webinar Registration Page: They registered for the webinar.\n2. Webinar Thank-You Page: After registering, they could get a free 2-week trial\nof ClickFunnels (that is the MIFGE) while they waited for the webinar to start.\n3. Webinar Offer: They attended the webinar and some signed up for the Bulk\nContinuity + Offer.\n4. Trialers and Bulk Buyers Continue on Continuity:\n• Trialers were put into our Level 1 Continuity, and some continued at $97/mo.\nafter their free 14-day trial ended.\n• Bulk buyers were put into our Level 1 Continuity, and some continued at\n$297/mo. after their bulk 6-month membership ended.\n129 128\n1. Challenge Registration Page: They registered for the challenge.\n2. Challenge Thank-You Page: After registering, they could get a VIP Upgrade to get a\nfree 30-day trial of ClickFunnels (that is the MIFGE) while they waited for the challenge\nto start.\n3. Challenge Offer: They attended the challenge and some signed up for the Bulk\nContinuity + Offer.\n4. Trialers And Bulk Buyers Continue On Continuity:\n·Trialers were put into our Level 1 Continuity, and some continued at $97/month\nafter their free 30-day trial ended.\n·Bulk buyers were put into our Level 1 Continuity, and some continued at $297/\nmonth after their bulk 12-month membership ended.\nCHALLENGE FOR A\nDRAMATIC DEMONSTRATION #1\nHere’s an example of one of our challenge funnels.\n131 130\nChapter 6\nDRAMATIC\nDEMONSTRATION\n#2\nYour Dramatic Demonstration #2 (Live Or Virtual Event)\nSells Your High-Ticket Offer\nSTEPS 7 & 8: Create Your High-Ticket Offer…\nand Dramatic Demonstration #2\nYou’ll create a High-Ticket Offer (that includes Bulk Continuity + more)...and you’ll create a\nvirtual or live event to sell your High-Ticket Offer.\nAfter you’ve launched your MIFGE and Dramatic Demonstration #1, you’re ready to create your\nHigh-Ticket Offer and your Dramatic Demonstration #2.\nRemember that your High-Ticket Offer will be the offer in the back end of your Value Ladder, and\nit will fill your Level 3 continuity.\n132 133\nI drive traffic to fill our live and virtual events, and at the end of our events, I\noffer our members the opportunity to join our high-ticket programs: our Funnel\nBuilders Certification or Two Comma Club X Coaching Program.\nWe have always used our big event, Funnel Hacking LIVE, as the event that we\noffer our highest level of continuity, our coaching program. In the past, though,\nI didn’t have a good strategy to get our attendees to buy our coaching program.\nEvery year we tried something new, with varying degrees of success. In fact, one\nyear we even lost money doing the event! Here’s the numbers of how much we\nmade at Funnel Hacking LIVE during our first few years:\n• 1st year: just shy of $1 million dollars\n• 2nd year: $1 million dollars\n• 3rd year: almost nothing (1,500 people; lost money at the event)\n• 4th year: $12 million dollars\nSo, what was the big difference that helped us go from losing money one year to\nmaking $12 million dollars the next year? We hired Bari Baumgardner and Blue\nMelnick from SAGE Event Management, and they helped us create a through-line\nfor the event so that every step, every slide, and every moment of our Dramatic\nDemonstration would be perfectly architected to get someone to buy our products\nand services at the end.\nNow, I’ll let Bari and Blue share how you should create your High-Ticket Offer and\nrun your virtual or live event.\nIf you’re nervous about selling something high\nticket, just remember that sales is service. If\nyou can serve hard, you can sell easy.\nYour “right-fit client” wants 2 things:\n• Speed\n• Hand-Holding\nYour High-Ticket Offer should have both. If\nyou can take your Low-Ticket Offer that has\ncontent and introduce a High-Ticket Offer to\nbetter serve your client, you’ve got a winning\nformula for success.\nPROVEN PATH IN ACTION\nIf you’re concerned that it will be hard to\ncreate a High-Ticket Offer or event, here’s a\nplan you can immediately implement to walk\nyour current followers from a Low-Ticket Offer\nto an event where you sell a High-Ticket Offer.\nNote that every step below should include\ntraining on:\n• Problem: The problem your client has.\n• Solution: How you’ll solve your client’s\nproblem.\n• Mindset: The mindset your client\nneeds to have in order to overcome the\nproblem. (They have to believe they can\ndo it before they’ll pay you to do it.)\nNow here’s what you should create to ascend\nyour clients. At the end of each step, simply\nask, “How many of you would like more?”\nThey will likely say, “That’s amazing. I’d like\nmore.”HIGH-TICKET OFFER\n(BY BARI BAUMGARDNER)\nThen you can say, “I thought you would. It just\nso happens I have a ___________ coming up.\nDuring it, we will ______________. Would you\nlike to join us for that?” Then you can enroll\nthem in your next offer. You’re not creating\nnew content; you’re just going deeper into the\ntopics at each level and giving your clients a\nbetter experience at each higher level.\nHere’s an example of how to ascend your\ncustomers:\n• Challenge\n·High-level training so your clients\ncan understand what could be\npossible for them\n• Course\n·Week 1: Welcome Week\n·Weeks 2–7: Deep dive into your\ntraining topics\n·Week 8: Graduation\n• 3-Day Event\n·Day 1: Deep dive into Topic #1\n·Day 2: Deep dive into Topic #2\n·Day 3: Deep dive into Topic #3\n• High-Ticket Offer (Could be\nMastermind, Coaching, Retreat)\n·Event 1: Retreat for Topic #1\n·Event 2: Retreat for Topic #2\n·Event 3: Retreat for Topic #3\n·In between the events: Facebook\ngroup, Monthly Q&A, Hot Seat Deep-\nDive Calls\n134 135\nWe suggest FIRST designing your High-Ticket\nOffer content so you can then design your\n3-day event, course, and challenge from it. You\nshould have a maximum of 4–6 things in your\nHigh-Ticket Offer. The price should be at least\n$5,000. Make sure your High-Ticket Offer has\nboth of these elements:\n• ACE:\n·Accountability: Holding them\naccountable to make progress\n·Community: Getting support and\nhand-holding\n·Enhanced Opportunity: Being\nmore, doing more, having more, and\nmaking more\n• RIM:\n·Repetition: A muscle you need to build\n·Immersion: Be immersed in a like-\nminded community where you’re\nreminded every day of success stories\n·Modeling Proven Practices: Don’t\nreinvent the wheelYou can also choose elements for your High-\nTicket Offer from the ideas below. We suggest\none from each category and possibly 2 more\nactivities (for a total of 6 deliverables).\n• Activity: Workshop, immersion,\nretreat, event\n• Group: Facebook, Signal, Telegram, Circle\n• Support: Monthly Q&A\n• Monthly Content: Hot seats or laser\ncoaching\nThe more you charge doesn’t\nmean you’re giving them more\nstuff; it means you’re giving them\nthe right stuff to get them results\nfaster, simpler, and easier.\nPeople don’t pay you to tell them\neverything you know. They pay\nyou to tell them what they need\nto know. —Bari Baumgardner\nExamples Of\nDRAMATIC\nDEMONSTRATION #2\nWasn’t that helpful to see how Bari\nsuggests you craft your High-Ticket Offer?\nHere’s an example of one of our live event\nfunnels we use for Funnel Hacking LIVE.\n136 137\n1. Live Event Sales Page: They registered for the live event.\n2. Live Event Offer: They attended the live event and some signed up for our High-\nTicket Offer to join our Two Comma Club X Coaching Program for $2,500/mo. or\n$25,000/year.\n3. High-Ticket Buyers Continue on Continuity:\nHigh-Ticket buyers were put into Level 3 of our continuity, and some continued at\n$2,500/mo. after their year membership ended.LIVE EVENT FOR A\nDRAMATIC DEMONSTRATION #2\nAs I explained earlier, a live event is one of the hardest things to sell because not\nonly do people have to buy a ticket for the event, they also have to buy flights and\nhotels, too. They have to leave their spouse and children and get a babysitter, and\nfor some people, it’s just too overwhelming to attend.\nPlanning a live event is stressful, too. It takes 8 months to fill the event, and\n25% of people buy in the last three weeks! Last year at Funnel Hacking LIVE, we\nspent $3-$4 million dollars to produce the event, so you can imagine the level\nof planning that went into it. Even though live events can be stressful, they’re\nincredibly powerful.\nSome of the things you can only do in person (and you should do!) are:\n• During the first presentation on Day 1, share the IDENTITY of your dream\ncustomer and get them pumped to go on the journey over the next several\ndays. Create the identity, vision, and belief of where you are all going\ntogether during the event, and help them feel worthy to take that calling. (If\nyou haven’t listened yet to my “Drifter vs. Driven” speech at FHL in 2022,\nsearch YouTube and watch it. This is a perfect example of this!) Technically\nyou can also do this virtually, but I listed it here because it’s so important.\n• At the end of the first night, give your attendees an opportunity to donate\nto one of your favorite charities. This also teaches them the process of\nbuying at a live event, so after you pitch, they’ll know how to buy your High\nTicket Offer.\n• If you’re doing a 3-day event, hold the award ceremony at the end of the\nfirst night, right after the charity drive. This creates a gap between where\nthey are and where they want to be (on the award stage next year!). It also\ncreates the desire to achieve the award, and the belief that they’ll be more\nlikely to achieve it if they’re coached (i.e. join your High Ticket Offer).\n• Take pictures with the buyers after the pitch. It increases sales dramatically.\nThat way, they can put the picture on their wall at home and remember the\nevent and their goals long after the event has finished.\n139 138\n1. Virtual Event Sales Page: They registered for the virtual event.\n2. Virtual Event Offer: They attended the virtual event and some signed up for our\nHigh Ticket Offer to join our Two Comma Club X Coaching Program for $2,500/month\nor $25,000/year.\n3. High-Ticket Buyers Continue on Continuity:\nHigh-Ticket buyers were put into Level 3 of our continuity, and some continued at\n$2,500/month after their year membership ended.VIRTUAL EVENT FOR A\nDRAMATIC DEMONSTRATION #2\nHere’s an example of one of our virtual event funnels we use for Two Comma Club LIVE:\nAfter COVID-19 introduced us all to Zoom, virtual events started taking off and\npeople really started liking them. They’re still very popular, and we do a lot of\nvirtual events.\nIf you’ve ever wanted to do an event with your followers, but you’re worried about\nthe cost, a virtual event might be great for you because:\n• For You:\n·No hotel contracts\n·No big AV bill or overhead\n·You don’t feel cash-poor\n• For Your Attendees:\n·No hotel rooms\n·No flights\n·They don’t feel cash-poor and are more likely to sign up for\nyour programs\n141 140\nWhen you think of your “right fit client,” consider these questions: How badly do\nthey need you right now? How isolated do they feel? What secrets do you have\nthat they need to know, and how much easier would it be to share in a group set -\nting?\nWhen you host a virtual or live event, you’re getting leverage because you’re\nbringing like-minded people together so you can sell all of them at one time into\nyour high-ticket offer. Your event will 2X, 3X, or even 10X  whatever sales you’re\ncurrently doing in your funnels.\n3X3 PAG (PROGRAM AT A GLANCE)\nThe through-line for a 3-day virtual or live event is the 3x3 PAG (Program At a\nGlance) because the structure does the selling for you.THE EVENT THROUGH-LINE\n(BY BARI BAUMGARDNER)\n• DAY 1: SERVE\n·Content: Give such good content at the beginning that they think,\n“That was worth the whole event right there.”\n·Connection: Build a connection with you, the Attractive Character.\nYou could share your story with a charity and invite them to donate. You\nshould also help them build a connection where they believe they can\nbe successful with what you’re teaching. They should think, I thought it\nwas impossible. Now I think I could do this.\n·Community: Help them build a connection with each other. You could\nuse roundtable discussions.\n• DAY 2: INVITATION FOR EMOTIONAL BUYERS\n·Pain: Give them more content, connection, and community, but\nafter so many ahas, they’re feeling overwhelmed, unsure of how to get\nstarted, and they need your help. They feel a gap between where they\nare (feeling like they can do it) and where they want to be (realizing all\nthat they need to do). They’re feeling like they need supporting, trouble-\nshooting, and hand-holding to find success.\n·Solution: Introduce your product / service as the solution.\n·Invitation: Invite them to get your High-Ticket Offer and explain that the\nsolution is inside the 4–6 things you’ll do together over the next 6–12 months.\n• DAY 3: INVITATION FOR LOGICAL BUYERS\n·Decision: It’s your duty to help them get out of their own way and do\nwhat they’re meant to do. Tell them to go through all their notes and\ndecide to do one thing differently.\n·Commitment: Tell them to commit to a day to start.\n·Celebration: Tell them they should choose how they will celebrate.\nThen say, “If, in going through your decision to do one thing differently,\ncommitting to a timeline to start, and choosing how you will celebrate,\nyou’ve realized that you need help, then my invitation’s still here for you.\nDecide to join us. Commit by putting a deposit down. And we’re going\nto celebrate at the welcome celebration.” You’re celebrating that they\ninvested in themselves and that they’re not doing it alone anymore.\n143 142\nTHE SAGE 3-DAY WAY\nNow let’s take the 3x3 PAG and show you\nhow to plug each piece into your 3-day event.\nYour content will seed the deliverables of your offer, and the offer is presented with\nthe Trifecta below.\n• DAY 1\n·Opening Keynote: Romance your\naudience\n·Content: Foundations\n·Meal Break (60 min.)\n·Content: Topic 1 (Part 1)\n·Content: Topic 1 (Part 2)\n·Meal Break (60 min.)\n·Optional: Interactive to create\ncommunity\n• DAY 2\n·Keynote\n·Content: Topic 2 (Part 1)\n·Meal Break (60 min.)\n·Content: Topic 2 (Part 2)\n·Panel / Invitation (Trifecta)\n·Success Panel for Social Proof\n·Invitation to High-Ticket Offer\n·Meal Enrollment Break (60 min.)\n·Laser Coaching and Q&A (Trifecta)• DAY 3\n·Heart Close (Trifecta)\n·Help the logical buyer get out of\ntheir head and into their heart.\n·Let them know that the very reason\nthey’re saying they can’t is the reason\nthey must.\n·“Your job is to make their reason\nnot to…their reason to.”\n—Bari Baumgardner\n·It must be in service to the whole\nroom (serve first, sell second).\n·Overcoming Objections\n·You don’t have the time to do it?\nThat’s why you must do it.\n·You don’t have the money?\nThat’s why you must do it.\n·Your spouse isn’t supportive?\nThat’s why you need us more\nthan anyone.\n·You’re afraid to do it? Isn’t it\ntime to be done with that and\nstart moving forward because you\nknow you’re made for more.\n·You’re in shame and self-doubt\nbecause you didn’t get it right?\nYour past failure is not a predictor\nof your future success.\n·Content: Topic 3 (Part 1)\n·Meal Break (60 min.)\n·Content: Topic 3 (Part 2)\n·Closing Session\n145 144\nUSING THE LINCHPIN\nTO FILL YOUR CONTINUITY\nYou’ve seen how the MIFGE fills your Level 1 continuity, and how the Bulk Continuity + Offer\nfills your Level 2 continuity. Your High-Ticket Offer (that you’ll sell at the end of your Dramatic\nDemonstration #2) fills your Level 3 continuity.\nEssentially, your High-Ticket Offer is just another type of MIFGE Like your other offers, you’ll add\nso much value into your High-Ticket Offer that it will be irresistible. Your High-Ticket Offer will\nalso include bulk access to your continuity. For instance, when our customers invest in our Funnel\nBuilder Certification or Two Comma Club X Coaching Program, they get 6 months of ClickFunnels\nPlatinum for FREE (plus an Agency account while their certification is active).\n147 146\nFUNNEL BUILDER\nCERTIFICATION PROGRAM\nHere is an example of my offer stack for our Funnel Builder Certification program (which we\nsell at the end of both our virtual and live events). You’ll see that the “ClickFunnels Agency\nAccount” is the Bulk Continuity in our High-Ticket Offer.\nTWO COMMA CLUB X\nCOACHING PROGRAM\nHere is an example of my offer stack for our Two Comma Club X Coaching Program (which we\nalso sell at the end of both our virtual and live events). You’ll see that the Agency Editions of\nClickFunnels, Geru, and Funnel Scripts is the Bulk Continuity in our High-Ticket Offer.\n149 148\nAgain, as you’re designing any of your offers, remember to include continuity in all three of your\noffers: MIFGE, Bulk Continuity + Offer, and High-Ticket Offer. Here’s one last reference of what\nyou could include in all of your offers. Remember this is a guide only, and any of it can be changed\nto fit your business.\nValue Ladder Level 1 Level 2 Level 3\nKinda Like\nFlying:Coach First Class Private Jet\nExample\nPricing:$97/mo. $297/mo. $997/mo.\nLinchpin\nOfferMIFGEBulk Continuity\n+ OfferHigh-Ticket\nOffer\nWhat\nEach Level\nCould\nGet for\nContinuitySuccess Path ✓ ✓ ✓\nMonthly Masterclass ✓ ✓ ✓\nBackstage Pass ✓ ✓ ✓\nMember Makeover ✓ ✓ ✓\nCommunity ✓ ✓ ✓\nCourse ✓ ✓\nFacilitated Group\nCoaching✓ ✓\nMastermind ✓\n151 150\nChapter 7\nTHE LINCHPIN\nVALUE LADDER\nFrom A Framework To A Value Ladder…Putting It All Together\nThe Linchpin Framework\nNow that you understand the entire Linchpin framework, I’d like to\nshow you how the framework fits onto a Value Ladder.\nRemember that you won’t complete all three stages of the Linchpin framework at once. Just\ncreate one step at a time, and when each stage is producing consistent, repeatable traffic and\nsales, then you can build the next stage.\nNow, let me show you how we use the Linchpin framework in our Value Ladder today. As a\nreminder, here again is the picture of the Value Ladder from the DotCom Secrets book.\n153 152\nTHE LINCHPIN VALUE LADDER\nNotice how the steps of the Linchpin framework\nfit into the Value Ladder.\nYou’ll complete the Linchpin steps in this\norder:\nSTAGE 1: THE MIFGE (Steps 1–3)\n1. Create Your Continuity Or\nSubscription Program\nYou’ll create a continuity program to get\npaid on a recurring basis.\n2. Create Your MIFGE (Most Incredible\nFree Gift Ever)\nYou’ll create an irresistible offer that\nincludes a free trial of your continuity.\n3. Launch Your MIFGE To The World\nYou’ll use the Attractive Character\nFlywheel to sell your MIFGE.\nSTAGE 2: DRAMATIC DEMONSTRATION #1\n(Steps 4–6)\n4. Create Your Bulk Continuity + Offer\nYou’ll create an offer that includes free\nBulk Continuity (usually 6 or 12 months).\n5. Create Your Dramatic\nDemonstration #1\nYou’ll create a challenge or webinar to sell\nyour Bulk Continuity + Offer (plus you’ll\nput your MIFGE on the thank-you page\nof your challenge or webinar to get more\nmembers).\n6. Launch Your Dramatic Demonstration\n#1 to the World\nYou’ll use the Attractive Character Flywheel\nto fill your Dramatic Demonstration #1.STAGE 3: DRAMATIC DEMONSTRATION #2\n(Steps 7–9)\n7. Create Your High-Ticket Offer\nYou’ll create a High-Ticket Offer (that\nincludes Bulk Continuity + more).\n8. Create Your Dramatic\nDemonstration #2\nYou’ll create a virtual or live event to sell\nyour High-Ticket Offer.\n9. Launch Your Dramatic Demonstration\n#2 To The World\nYou’ll use the Attractive Character Flywheel\nto fill your Dramatic Demonstration #2.\n155 154\nTHE CLICKFUNNELS\nLINCHPIN VALUE LADDER\n157 156\nChapter 8\nYOUR\nNEXT STEP\nWant Help Creating Your Linchpin Value Ladder?\nAs I mentioned earlier, over the past few years,\nwe have been solely focusing on implementing\nthis Linchpin model in all of our businesses.\nWe do it with ClickFunnels. We do it with Dan\nKennedy’s company, Magnetic Marketing, that\nwe acquired. But we’re also doing it with our\nsupplement companies and our other info\nproduct and coaching companies as well.\nOn top of that, we completely changed the\nTwo Comma Club X training curriculum to\nsolely focus on the Linchpin. We’ve now had\nhundreds of entrepreneurs, like you, who have\nplugged into that coaching and mastermind\ncommunity, with a focus of launching each\nstep in the Linchpin, step by step, until they\nwin their Two Comma Club X award!If you’d like to have help from me, our coaches,\nand this amazing mastermind community,\nthen I want to invite you to apply to be part\nof this exclusive group of entrepreneurs who\nare changing the world. We typically only open\nenrollment to the 2CCX program during Funnel\nHacking LIVE, but because you bought this\nbook and read to the end, I want to invite you\nto apply to join and jump to the front of the line.\nI created a video with members telling you their\n2CCX stories, alongside a simple application.\nYou can apply to be part of this exclusive group at TwoCommaClubX.com .\nAfter you apply, you’ll get a quick phone call from someone on my team to see if you’re a good\nfit for the program. If you are, and you’re ready to start now, you could work directly with me\nand my team of coaches within the next few days to build out Step #1 of your Linchpin, your\ncontinuity program.\nThank you so much for reading, and I can’t wait to see the lives you change with your Linchpin!\n159 158"
    }
  ]
}