{
  "title": "00M Offers by Alex Hormozi",
  "type": "book",
  "author": "Russell Brunson",
  "added_date": "2025-11-01T21:15:24.708727",
  "word_count": 6766,
  "entries": [
    {
      "text": "HORMOZI  OFFER CREA TION\n1H O R M O Z I  -  O F F E R  C R E A T I O N\nBuy when it s this pr ice and it will be this pr ice f or e v er but this of f er is that onl y f or\nt oda y\nGET RICH ONCE SO Y OU NEVER GET T O GET RICH A G AIN\nClasses missed\nChar ge I t s W or t h\nThe V alue Equation\nThe of f er is going t o be t he #1 dr iv er of success of an y c amp aign.\nWhat does it do?  I t will allo w y ou t o sell in a v acuum, a \" c at egor y of one, \" and\nf or ce cust omers t o mak e a v alues b ased decision inst e ad of a pr ice b ased\ndecision.\nMaking y our of f er unique 1/0\n99/mo boot c amp VERSUS 6 w eeks fr ee challenge\nGET P AID T O GET NEW COSTUMERS  G AME CHANGER\nP i c k i n g  M a r k e t s\n1 -  T h r e e  L e v e r s  o f  S u c c e s s\nY ou need t o v alidat e one t o go t o the ne x t one Plus, neutral or negativ e )\nIf y ou ha v e a plus or neutral, go t o the ne x t one\n1 Mar k et\nHORMOZI  OFFER CREA TION\n2Nor mal mar k etplace - gr o ws with the econom y - a v oid mar k etplaces that ar e\nd ying\n2 Of f er\n3 P ersuation\n2 -  F o u r  V a r i a b l e s  t o  l o o k  f o r  w h e n  p i c k i n g  a  m a r k e t\n1 Pain\n2 Pursache P o w er\n3 Easy t o t ar get\n4 Gr o wing\n3 Thr ee Main Mar k et s\n1 He al th\n2 W e al th\n3 R elationships\nY ou w ant t o help a unique a v at ar\nt o sol v e a unique pr oblem\nin a unique w a y\nt hat r e v erses t he bggest objection\n4 -  R i c h e s  a r e  i n  t h e  N i c h e s\nTime management  $19\nHORMOZI  OFFER CREA TION\n3Time management f or sales pr of essionals  $99\nTime management f or outbound b2b sales   $499\nTime management f or outbound b2b po w er t ools & gar dening sales r eps  $1999\nY ou c an higher t he pr ice t he mor e unique y our of f er is.\nThe r e ason niches ar e so pr of it able is t hat y ou c an be v er y specif ic in y our\nmessaging and ho w y ou cr af t y our solution so t hat it is v er y much MORE\nv aluable t o t hat person.\nThe go al of gr e at wr iting is f or t he r e ader t o  underst and.\nThe go al of gr e at cop y is f or t he pr ospect t o f eel underst ood.\nHORMOZI  OFFER CREA TION\n4\nT h e  O f f e r  C r e a t i o n\nY ou ma y not be con v er ting bec ause what y ou ar e of f er ing is not sol ving all their\npr oblems\nHORMOZI  OFFER CREA TION\n5Identify Dr e am Out come\nList Out All P er ceiv ed Pr oblems\nT ur n All Pr oblems int o Solutions\n1 .  I d e n t i f y  D r e a m  O u t c o m e\nThe y wanna loose 20 pounds in 50 da ys with no r isk or doesnt le a v e f oods that\nthe y lo v e\nSol v e pr oblems that y ou alr e ad y ha v e.\nY ou ha v e t o indentify what pr oblem y ou ar e sol ving\nHORMOZI  OFFER CREA TION\n6V er y specific a v at ar achie v e a v er y especific r esul t in a time per iod\nAcquisition: helping 3 million dollar comp anies t o achie v e 30 million+ e xit in 3 t o 5\ny e ars\n2  -  L i s t  t h e i r  p r o b l e m s\nA What is e v er y single intr ic at e st ep t he y'r e going t o ha v e t o do/t ak e in or der t o\nsee success wit h y our pr oduct.\n...gr ocer y shopping\n...p acking and unp acking f ood\ncooking\n...me al pr epping\n...e ating\n...cle aning f ood/dishes\n...f eeding f amil y\n...e ating out\n...et c.\nB Each of t hese pr oblems c an be unp ack ed int o \"fla v ors \"\n\u0000 Dr e am Out come   This will not be financiall y w or th it\n\u0000 Lik elihood of A chie v ement  →\n...I t w on't w or k f or me specific all y\n...I w on't be able t o stick with it\n...Ex t er nal f act ors will get in m y wa y . This is the most unique and accurat e\naspect of the pr oblem br e aks.)\n\u0000 Ef f or t & Sacr if ice  →\nHORMOZI  OFFER CREA TION\n7... This will be t oo har d & confusing t o figur e out.\n...I w on't enjo y it.\n...I will be b ad at it.\n\u0000 Time  →\n... This will t ak e t oo much time t o happen .\n... This will t ak e t oo much time t o do .\n...I t w on't be con v enient f or me.\nThe y need t o f eel underst ood\n3  -  T r a n s f o r m  p r o b l e m s  i n t o  s o l u t i o n s\nEXAMPLE\nPROBLEM Buying he al t h y f ood,  gr ocer y shopping\n...is har d, confusing, I w on't lik e it. I will suck at it  Ho w t o mak e buying\nhe al th y f ood e asy and enjo y able, so that an y one c an do it ( especiall y busy\nmoms!\n...t ak es t oo much time  Ho w t o buy he al th y f ood quickl y\n...is e xpensiv e  Ho w t o buy he al th y f ood f or less than y our cur r ent gr ocer y\nbill\n...is unsust ainable  Ho w t o mak e buying he al th y f ood t ak e less ef f or t than\nbuying unhe al th y f ood\n...is not m y pr ior it y . M y f amil y's needs will get in m y wa y  Ho w t o buy\nhe al th y f ood f or y ou and y our f amil y at the same time\n...is undo able if I tra v el; I w on't kno w what t o get  Ho w t o get he al th y f ood\nwhen tra v eling\nEv er y single st ep that the y need t o do t o achie v e the dr e am out come\nWhat m y client need bef or e and af t er m y solution?\nHORMOZI  OFFER CREA TION\n8Of f er +Cr e ation+Checklist.pdf\nO f f e r  C r e a t i o n  C h e c k l i s t\nC r e a t e  Y o u r  C o r e  O f f e r  P a r t  1  &  2\nV .  C r e a t e  Y o u r  O f f e r  C o m p o n e n t s\nDef ine Their Dr e am Out come\nList out Ev er y P ossible Pr oblem t he y c an Encount er\nEv er y intr ic at e st ep\nEv er y thing that happens bef or e and af t er achie ving their go als\nWhat ne x t pr oblem will the y f ace\nHo w c an w e mak e it w or th it?\nHo w c an w e mak e it e asier?\nHo w c an w e mak e it f ast er?\nHo w c an w e mak e it enjo y able, sust ainable, and something the y belie v e\nthe y c an do?\nList out e v er y possible solution t o t he pr oblems\nHo w t o Y A Y without BOO e v en if y our GREA TEST OBST A CLE\nT h e  \" D e l i v e r y  C u b e \"\n\u0000 Gr oup R atio\n11\nSmall Gr oup\nOne t o Man y\n\u0000 Le v el of Ef f or t On Their P ar t\nHORMOZI  OFFER CREA TION\n9Do I t Y ourself DIY\nDone- With- Y ou DWY\nDone-F or - Y ou DFY\n\u0000 Suppor t Le v els & T ypes\nSMS\nChat\nEmail\nExper t vs Nor mal\nPhone\nZoom\n\u0000 Consumption T ypes\nLiv e/Vir tual\nR ecor ded\nIn P erson\nW r it t en\nAudio\nVideo\n\u0000 Speed & Con v enience\n2 4/7\n95 MF\nHo w f ast will y ou r epl y t o questions? Ar e ther e le v els?\n\u0000 10x t o 1/10 t h T est\nWhat w ould I deliv er if m y pr oduct cost 10x it s cur r ent amount?\nWhat w ould I deliv er if m y pr oduct cost 1/10 th it s cur r ent cost and had t o\npr o vide mor e v alue than I cur r entl y am at m y cur r ent pr ice?\nHORMOZI  OFFER CREA TION\n10V I .  T r i m  &  S t a c k :  P r i o r i t i z e  t h e  S o l u t i o n s  B a s e d  o n  V a l u e  &  C o s t\nThe \"Me at & P ot at oes \" of t he Of f er\nCor e Of f er Component #1____________________________________________\nCor e Of f er Component #2____________________________________________\nCor e Of f er Component #3____________________________________________\nCor e Of f er Component #4____________________________________________\nCor e Of f er Component #5____________________________________________\nHigh V alue : me aningful, f ast, e asy , and belie v e the y c an do it and enjo y it\nLo w V alue : not me aningful, slo w , har d/comple x, not int er esting and don ʼ t\nbelie v e the yʼll lik e it\nHigh Cost : r equir es people t o sc ale\nLo w Cost : c an sc ale without people but with upfr ont ef f or t inst e ad\nR emo v e all it ems t hat ar e NO T high v alue\nK eep onl y a handful of High Cost High V alue , and e v er y thing else should be\nhigh v alue lo w cost\nSt ar t wit h somet hing t hat is less sc alable  (mor e high cost high v alue ) t o get\npeople t o sa y y es and begin monetization\nO F F E R  C R E A T I O N  P A R T  2\n\"Y our of f er ma y not be con v er ting bec ause what y ou ar e of f er ing is not sol ving\nall t heir pr oblems. \"\nHORMOZI  OFFER CREA TION\n11\nF ocus in e asy t o sell and transf or mat e it in e asy t o fulfill\n2 .  T h e  D e l i v e r y  V e h i c l e  \" T h e  H o w \"\n\u0000 List a pr oblem & all  the wa ys y ou could sol v e that pr oblem\nHORMOZI  OFFER CREA TION\n12\u0000 Use che at codes t o mak e it e asier t o think thr ough.\nAqui est á a transcr iç ão da imagem:\n2.  The Deliv er y V ehicle \"The Ho w\"\nPr oblem:  Buying He al th y F ood Is Har d, Confusing, Expensiv e, Time Consuming\nand I W on't Lik e I t\nIf I w ant ed t o pr o vide a one-on-one  solution I might of f er ...\na) In-person gr ocer y shopping, wher e I t ak e client s t o the st or e and t e ach them\nho w t o shop\nb ) P ersonaliz ed gr ocer y list, wher e I t e ach them ho w t o mak e their list\nc ) F ull-ser vice shopping, wher e I buy their f ood f or them. W e 'r e t alking 100\nper cent done f or them.\nd) In-person or ient ation (not at st or e ), wher e I t e ach them what t o get\ne ) T e x t suppor t while shopping, wher e I help them if the y get stuck\nf) Phone c all while gr ocer y shopping, wher e I plan t o c all when the y go shopping\nt o pr o vide dir ection and suppor t\nI f  I  w a n t e d  t o  p r o v i d e  a  o n e -  T O  M A N Y  s o l u t i o n\na) Liv e gr ocer y t our vir tual, wher e I might liv e str e am me going thr ough the\ngr ocer y st or e f or all m y ne w cust omers and let them ask questions liv e\nb ) R ecor ded gr ocer y t our , wher e I might shop once, r ecor d it, then giv e it as a\nr ef er ence point fr om that point onwar ds f or m y client s t o wat ch on their o wn\nc ) DIY gr ocer y c alculat or , wher e I cr e at e a shar e able t ool or sho w them ho w t o use\na t ool t o c alculat e their gr ocer y list\nd) Pr edet er mined list s, wher e e ach cust omer plan comes with it s o wn gr ocer y list\nf or e ach w eek. I could mak e this ahe ad of time so the y ha v e it. Then the y could\nuse it on their o wn time\ne ) Gr ocer y budd y syst em, wher e I could p air cust omers all up which t ak es no time\nr e all y , and let them go shopping t ogether\nHORMOZI  OFFER CREA TION\n13f) Pr e-made, inst a-c ar t gr ocer y c ar t s f or deliv er y , wher e I could pr e-mak e inst a-\nc ar t list s so client s could ha v e their gr ocer ies deliv er ed t o their doorst ep with one\nclick\n1 X  →  1 0 X  t h e  p r i c e\nW h a t  e l s e  i  w a n t  t o  f u l l f i l  t o  m y  c o s t u m e r s  t o  j u s t i f y  1 0 x\np r i c e ?\nW h a t  i f  i  w a s  f o r c e d  t o  p r o v i d e  m o r e  v a l u e  t h a n  i\nc u r r e n t l y  a m  b u t  i  n e e d  t o  c h a r g e  1 / 1 0 x  t h a t  w h a t  i m\na l r e a d y  a m .\n3 .  T r i m  s t a c k  t o  M a x  P r o f i t\nHORMOZI  OFFER CREA TION\n14\nDoing things that ar ent high v alue is onl y distraction, bec ause the y dont get\ncostumers t o r ef f er y our business t o other people\nDef ining V alue: ( r e v erse of t he equation)\n\u0000 Financiall y v alue\n\u0000 Cause them t o belie v e the y will be lik el y t o succeed\n\u0000 Mak e them f eel lik e the y c an do it with much less ef f or t and sacr ifice\n\u0000 Help them accomplish their go al and see the r esul t the y want with f ar less time\nin v estment\nDIRECT COST NEED T O BE UNDER 20%\nHORMOZI  OFFER CREA TION\n15\nB O N U S E S\nThe v alue per ception of selling 1 knif e f or 19 and get ting 38 knif es as bonus is\ngrat er than selling 38 knif es f or 19 dollars\n\"W e 'r e no w going t o r eor ganiz e those pieces int o the cor e pr oduct & it s bonuses.\nI t's all coming with the pur chase, but when split out w e c an bet t er anchor v alue. ˮ\nHORMOZI  OFFER CREA TION\n16Aqui est á a transcr iç ão da imagem:\nBonus Bullet s\n\u0000 The v alue of the bonuses should eclipse the v alue of the cor e of f er .\nPsy chologic all y as y ou continue t o add of f ers, it continues t o e xp and the pr ice\nt o v alue discr ep anc y . I t also, subconsciousl y communic at es that the cor e of f er\nmust be v aluable bec ause if these ar e the bonuses, the main thing has t o be\nmor e v aluable than the bonuses r ight? No, but y ou c an use this psy chologic al\nbias t o mak e y our of f er seem wildl y compelling).\n\u0000 Y ou c an fur ther enhance the v alue of y our bonuses b y adding sc ar cit y and\nur genc y t o the bonuses themsel v es (which t ak es this t echnique and put s it on\nst er oids).\na) Bonuses Wit h Sc ar cit y (sc ar cit y is a limit ed amount of unit s)\nV ersion 1 Onl y people who sign up f or XYZ pr ogram will ha v e access t o\nm y Bonus #1, 2, 3 that ar e ne v er f or sale or a v ailable an ywher e else other\nthan thr ough this pr ogram.\nV ersion 2 I ha v e 3 tick et s lef t t o m y $5 , 000 vir tual e v ent, if y ou buy this\npr ogram y ou c an get one of the last 3 tick et s as a bonus.\nb ) Bonuses Wit h Ur genc y (is a limit ed amount of time )\nV ersion 1 If y ou buy t oda y , I will add in XYZ bonus that nor mall y cost s\n$1, 000 , f or fr ee. And Iʼll do that bec ause I want t o r e war d action t ak ers.\nc ) With hope, y ou c an see the subtle dif f er ences. The first t w o e xamples ar en ʼ t\nconstrained b y time. The y ar e constrained b y the number of people who ar e\nable t o t ak e action, which y ou c an still incr e ase.\nAqui est á a transcr iç ão da imagem:\nBonus Bullet s\n\u0000 Alwa ys of f er them (y ou c an use the bullet ed bundle w e c ame up with at the\nend of Section III\n\u0000 Giv e them a special name that has a benefit in the title\nHORMOZI  OFFER CREA TION\n17\u0000 T ell them:a) Ho w it r elat es t o their issueb ) What it isc ) What it will do f or\nthemd) Ho w it will specific all y impr o v e their liv es or mak e their e xper ience:\na) f ast er\nb ) e asier\nc ) less ef f or t/sacr ifice (v alue equation)\n\u0000 Pr o vide some pr oof (this c an be a st at, a p ast client, or personal e xper ience )\nt o pr o v e that this thing is v aluable\n\u0000 Paint a vivid ment al image of what their lif e will be lik e assuming  the y ha v e\nalr e ad y used it and ar e e xper iencing the benefit s\n\u0000 Alw a ys ascr ibe a pr ice t ag t o t hem and justify it  Y ou need t o sho w t he\ncostumer wh y t he bonus is v aliable  Ex ample: I ha v e spent 50k dollars in\nconsul ting so y ou dont need t o\n\u0000 T ools & checklist s ar e bet t er than additional trainings (as the ef f or t & time ar e\nlo w er with the f or mer , so the v alue is higher . The v alue equation still r eigns\nsupr eme ).\n\u0000 The y should e ach addr ess a specific concer n/obst acle in the pr ospect's mind\nabout wh y the y c an ʼ t or w on ʼ t be successful (bonus should pr o v e their belief\nincor r ect)\n\u0000 This c an also be what the y w ould logic all y r e aliz e the y will need ne x t. Y ou\nwant t o sol v e their ne x t pr oblem bef or e the y e v en encount er it. I tʼ s nice t o\nsol v e the pr oblem that the y will ha v e when the succeed bec ause y ou implie\nthat the y will succeed\nAqui est á a transcr iç ão da imagem:\nA d v anced Bonuses: Le v er aging Ot her Businesses\n\"The y will giv e y ou their pr oduct f or fr ee f or making the intr oduction. Ev en bet t er ,\nthe y'll pa y y ou t o giv e aw a y their pr oduct s. \"\nLe v els of Ot her P eople ʼ s Pr oduct s Bonus MA STER Y  4 Le v els\n\u0000 Other people ʼ s pr oduct s\n\u0000 Other people ʼ s pr oduct s (with pr e-negotiat ed discount s or fr ee per iods/unit s)\nHORMOZI  OFFER CREA TION\n18\u0000 Other people ʼ s pr oduct s (with pr e-negotiat ed discount s or fr ee per iods/unit s)\n+ af filiat e commissions\n\u0000 Other people ʼ s pr oduct s (with pr e-negotiat ed rat es and  e x clusiv e\nf e atur es/licenses) + af filiat e commissions\nCo aching Business Case Stud y\n\u0000 Pr e-lo aded Landing p age sof t war e with our e x clusiv e t emplat es + af filiat e\ncommissions (no discount)\n\u0000 Pr e-lo aded fulfillment sof t war e with our t emplat es + af filiat e commissions (no\ndiscount)\n\u0000 T e x ting sof t war e with pr e-negotiat ed discount + af filiat e commission (no\ncust om f e atur es)\n\u0000 Messaging pr oduct with af filiat e commissions & cust om f e atur es\n\u0000 Pr e-negotiat ed financing t er ms + speed y appr o v als & pr e-appr o v ed amount s\n& p ackages + af filiat e commission (no discount)\nBonus-Cr e ation-Checklist.pdf\nGuarantees\nHORMOZI  OFFER CREA TION\n19\nY our of f er ma y not be actuall y making mone y bec ause it is t oo\ny our pr ospect t o buy (t he y don ʼ t t hink it ʼll w or k f or t hem).\nH o w  t o  i m p r o v e  y o u r  o f f e r  i r r e s t i b l e  b y  r e v e r s i n g  r i s k s\n1 Unconditional guarant ees\nF or an y kind of r e ason the costumers get s his mone y b ack\n\"I'm not asking y ou t o decide y es or no t oda y ... I'm asking y ou t o mak e a full y\ninf or med decision, that is all. The onl y wa y y ou c an mak e a full y inf or med decision\nis on the inside, not the out side. So y ou get on the inside and see if e v er y thing w e\nsa y on this w ebinar is true and v aluable t o y ou. Then, if it is, that's when y ou\ndecide t o k eep it. If it's not f or y ou, no har d f eelings. Y ou will then, af t er signing up\nat URL, be able t o mak e a full y inf or med decision that this isn't f or y ou. But y ou\nw on't mak e this decision r ight no w f or the same r e ason y ou don't buy a house\nwithout first looking at the inside of it. And kno w this... whether it's 29 min or 29\nda ys fr om no w ... if y ou ain't happ y , I ain't happ y . F or an y r e ason what soe v er , if y ou\nwant y our mone y b ack y ou c an get it bec ause I onl y want t o k eep y our mone y if\ny ou'r e happ y . All y ou ha v e t o do is go t o suppor t@ XYZ.com and t ell use \" gimme\nm y mone y\" and y ou got it, and in shor t or der - our r esponse times t o an y suppor t\nr equest a v erage 6 min o v er a 2 4/7 time per iod. Y ou c an onl y mak e such a\nguarant ee when y ou'r e confident that what y ou ha v e is the r e al de al and I'm f air l y\nHORMOZI  OFFER CREA TION\n20confident that when y ou sign up at URL, y ou'r e get ting e xactl y what y ou need t o\nBENEFIT . \"\nUSE THIS WHEN Y OU KNOW THA T WHA T Y OU HA VE IS THE REAL DEAL\nIʼ m dont sa ying t o sa y y es or no t oda y , im sa ying y ou shold tr y and decide lat er\nP eople lo v e t o dela y decisions, so in or der t o don ʼ t mak e a decision, y ou ha v e t o\nbuy!\n2 Conditional Guarant ees\nIf y ou don ʼ t achie v e X, in Y time, w e will…\nOut siz ed R efund 2x, 3x)\nY ou giv e a r efund bigger than the inicial in v estment\nSer vice Guarant ee\nThe costumer c an use y our ser vice f or fr ee e v en af t er r efund\nModified Ser vice Guarant ee\nThe costumer get s a smaller v ersion of y our ser vice\nCr edit -b ased Guarant ee\nIf the costumer want s t o r efund, y ou giv e them cr edit s t o use in one of the\nother pr oduct s\nP ersonal Ser vice Guarant ee\nU giv e a 11 c all t o y our cosumer\nHot el  A ir f ar e P er ks Guarant ee\nW age-Pa yment\nHORMOZI  OFFER CREA TION\n21R ele ase of ser vice guarant ee\nDela y ed second p a yment guarant ee\nUntill y ou achie v e y our go al, y ou dont ha v e t o p a y me\nFIrst the Out come Guarant ee\n3 Anti Guarant ees & P er f or mance\nP er f or mance/V alue b ase\nOnl y p a y me xxx per yyy\nWinners alwa ys want per f or mance\n4 Naming Gurant ees\nA cool name spice it up\nCool Guar ant ee Name: If y ou ar e going t o giv e a guar ant ee, spice it up. Inst ead of\nusing \"satisf action\" or some other \"v anilla\" w or d, descr ibe it mor e str ongl y .\nGener ic Example (Bad): 30Da y Mone y Back Satisf action Guarant ee.\nCr e ativ e Imager y Ex ample #1  Good): In 30 da ys, if y ou w ouldn ʼ t jump int o shar k\ninf est ed wat ers t o get our pr oduct b ack, w e will r etur n e v er y dollar y ou p aid…\n“lo v e it or le a v e it. ˮ\nCr e ativ e Imager y Ex ample #2  Gr e at): Y ou ʼll get our f amous “Club a Bab y Se al\nGuarant ee ˮ Af t er 30 da ys of using our ser vices, if y ou w ouldn ʼ t club a b ab y se al t o\nst a y on as a cust omer , y ou don ʼ t ha v e t o p a y a penn y .\nAlw a ys be bold about y our guar ant ees - what e v er t he y ar e.  Y ou should o wn\ny our position.\nUnderst and t he mat h behind a guar ant ee such as t his\nI t is a c alculat ed r isk.\nEx.  100 sales, 5 r efunds 5%  95 Net Sales\nGuar ant ee Of f er  130 sales, 13 r efunds 10%  117 Net sales\nHORMOZI  OFFER CREA TION\n22117/95  1.23x 23% incr e ase )\nWhen y ou giv e a guarant ee af t er a long per iod of time, the costumer see ʼ s him\nusing y our solution f or a long time and y ou t end t o ha v e a bet t er L TV\nUnbe at able-Guarant ee-Checklist.pdf\nU R G E N C Y  X  S C A R C I T Y\nY our of f er ma y not be actuall y making mone y bec ause pr ospect s not buying\nf ast enough ( need t o mak e decisions f ast er).\nHORMOZI  OFFER CREA TION\n23\nU R G E N C Y  -  B Y  D A T E\n\u0000 olling Cohor t s  Ne x t gr oup st ar ting\nThe gour p is st ar ting on monda y , so y ou need t o join t oda y . Dont mat t er what\nda y of the w eek it is, is a r e ason t o join u just ha v e tu adjust the speech\n\u0000 R olling Se asonal Ur genc y  This month's ending\nThis special of f er - chr istimas, comp an y anniv ersar y , v alent anie ʼ s da y\nOne pr omotion ends and a ne w pr omotion beggins\n\u0000 Pr omotional/Pr icing/Bonuses Ur genc y  This discount/bonuses ending\nIf i ha v e 10 bonusses, i c an sor t 5 in a month and the other 5 in the ne x t month\n\u0000 Exploding Oppor tunit y  The oppor tunit y disappe ar ing\nThe soon y ou get in, the bet t er the r esul t s y ou will get\nS C A R C I T Y  -  B Y  #  A V A L I A B L E\n\u0000 Limit ed Suppl y of Se at s/Unit s\n\u0000 Limit ed Suppl y of Bonuses\n\u0000 Ne v er A v ailable Again OR  One-of -a-K ind\nHORMOZI  OFFER CREA TION\n2 4\nSc ar cit y -Ur genc y -Checklist.pdf\nN A M I N G  P R O D U C T S\nY our of f er ma y not be actuall y making mone y bec ause pr ospect s do not kno w it\nis f or t hem,  or what pr oblem y ou ar e sol ving f or t hem.\nHer e ʼ s ho w t o mak e pr ospect s kno w y our of f er is f or t hem and t hat it will sol v e\nt heir pr oblem t he w a y t he y w ant it t o be sol v ed...\nM - A - G - I - C  H E A D L I N E  F O R M U L A\nThe pr ospect didnt c ame f or a gym membeship, the y c ame t o loose w eight\nJust bec ause someone doesnt want t o buy the cor e thing that y ou ha v e it doesnt\nme an that the y dont want t o sol v e the pr oblem, the y just want t o sol v e in a\ndif f er ent wa y\nW e need t o let them kno w w e will sol v e their pr oblem the wa y the y want t o\nHORMOZI  OFFER CREA TION\n25\nY OU NEED A T LEAST 3 OF THEM\nM agnet → M ak e A Magnetic R e ason\nA v at ar → A nnounce The A v at ar\nG o al → G iv e Them A Go al\nI nt er v al → I ndic at e A Time Int er v al\nC ont ainer → C omplet e With A Cont ainer W or d\nNO TE\nNot e v er y thing y ou do needs t o be named this wa y .*\nBut itʼ s especiall y useful when naming pr ograms and pr omotions f or ad v er tising.\nExamples: (y ou dont need t o mat ch the fiv e it ens, but it s bet t er if y ou hit)\nW ellnes:\nF r ee Six - W eek Le an-By -Hallo w een Challenge\n88% Of f 12 W eek Bikini Bluepr int\nF r ee 21Da y Momm y Mak eo v er\n60-minut e Mak e Y our F r iends Je alous Model Hair Syst em\nHORMOZI  OFFER CREA TION\n26Six - W eek Str ess-R ele ase Challenge\nF r ee! Bend Ov er Pain F r ee in 42 Da ys... He aling F ast T rack\nDoct ors\n$2, 000 Of f Celebr it y Smile T ransf or mation\nLak e wa y Moms  $1, 500 Of f Y our K ids Braces\nLak e wa y Moms  12 Months T o A P er f ect Smile $1000 of f f or 15 f amilies)\nBack t o School F r ee Braces Giv e awa y\nGrand Opening F r ee X R a y & T r e atment  Inst ant R elief\nBack Sor e No Mor e! 90 Da y R apid He aling Int ensiv e 81% of f!\nTightness? $1 Massage Ne w Client Summer Special\nNot e on Time Int er v al:\nF or bonuses think: seconds, minut es, hours.\nF or pr ograms & pr omotions think: Da ys, W eeks, Months.\nR emember , v alue is descr ibed as speed not in ho w much time y ou giv e someone.\nA t ooth e x tr action that t ak es 60min is LESS v aluable than one that t ak es 5 min.\nWHA T T O DO WHEN Y OU NEED T O REFRESH Y OUR OFFER\nR efr eshing an Of f er  Or der of Oper ations:\n\u0000 Change the cr e ativ e (the images and pictur es in y our ads)\nHORMOZI  OFFER CREA TION\n27\n2 Change the bod y cop y\n\u0000 Change the he adline, the wrapper of y our of f er\na) F r ee 6 w eek\nLe an  Challenge  F r ee 6 w eek T one  Challenge\nb ) Hollida y hango v er → ne w y e ar ne w y ou\n\u0000 Change the duration of y our of f ers\n1 Month  28 Da ys dif f er ent metr ic\n1 Month  4 W eeks dif f er ent metr ic\n1 Month  6 W eeks change actual time\n5 Change the enhancer of y our of f er (y our fr ee/discount component)\n$1 T r ial  F r ee\n$1 T r ial  99% Of f\nHORMOZI  OFFER CREA TION\n28$1 T r ial  No Mone y Do wn"
    }
  ]
}