{
  "title": "00M Scaling Roadmap Stage 4 by Alex Hormozi",
  "type": "book",
  "author": "Russell Brunson",
  "added_date": "2025-11-01T21:15:49.032361",
  "word_count": 2904,
  "entries": [
    {
      "text": "1\n$100M SCALING ROADMAP  •  STAGE 04: PRIORITIZE  PERSONALIZED GUIDE$100M SCALING\nROADMAP\nA PERSONALIZED GUIDE FROM\nSTAGE 4: PRIORITIZE\n2\n$100M SCALING ROADMAP  •  STAGE 04: PRIORITIZE  PERSONALIZED GUIDE\nYOU ARE HERE\n0. IMPROVISE\n1. MONETIZE\n2. ADVERTISE 7. CATEGORIZE\n3. STABILIZE 8. SPECIALIZE\n4. PRIORITIZE 9. CAPITALIZE5. PRODUCTIZE\n6. OPTIMIZESTAGE 4: PRIORITIZE\n3\n$100M SCALING ROADMAP  •  STAGE 04: PRIORITIZE  PERSONALIZED GUIDE\nSTAGE 4: PRIORITIZE\n4\n$100M SCALING ROADMAP  •  STAGE 04: PRIORITIZE  PERSONALIZED GUIDEWATCH THIS FIRST\nTHIS VIDEO EXPLAINS THE ENTIRE\n$100M SCALING ROADMAP. THIS INCLUDES:\nThe methodology The differences\nbetween stagesRepeat themes\nto be aware ofHow to get the most\nout of your business\n“START HERE”\nGOT IT? LET’S START SCALING\n5\n$100M SCALING ROADMAP  •  STAGE 04: PRIORITIZE  PERSONALIZED GUIDEYOUR STAGE\nSTAGE 4\nPRIORITIZE\nTHIS VIDEO PROVIDES AN\nIN-DEPTH LOOK AT THE CONSTRAINTS\n& SOLUTIONS AT STAGE 4\nMANAGERYOUR ROLE\n5 to 9HEADCOUNT\nTrying to be\neverything to\neveryoneBOTTOM LINE\nNiche down to\nserve only people\nlike your best\ncustomersGRADUATE BY\n6\n$100M SCALING ROADMAP  •  STAGE 04: PRIORITIZE  PERSONALIZED GUIDEWHEN YOU HIT\n“STAGE 4: PRIORITIZE”\nWelcome to having 5-9 employees! About 3 million businesses reach this level. This is when you\nchange from being a “trainer” to becoming a real “manager.” You’ll have your first real team, with\none layer of organization between you and the front-line workers. The big difference? You can’t do\neverything anymore - you have to choose what matters most.\nTHE BIG CHALLENGE: TRYING TO PLEASE EVERYONE\nThe main problem at Stage 4 is that you’ve been saying “yes” to any customer who would pay\nyou. Now that’s causing problems because different customers want different things. That’s why it’s\ncalled the “Prioritize” stage - you need to figure out who your best customers are and focus on them.\nLet’s break down what’s happening:\nProducts and Customers\nMarketing and Sales\nCustomer Service\nTech and Tools\nPeople and HR\nMoney Matters\n7\n$100M SCALING ROADMAP  •  STAGE 04: PRIORITIZE  PERSONALIZED GUIDEProducts & Customers\n• You’ve said yes to anyone who would pay, and now your product is pulled in too many directions\n• You need to choose a specific type of customer to focus on\n• You need to update your product to serve just those ideal customers\n• You might need to raise your prices to match your specialized service\nTech and Tools\n• Your new team isn’t using all the tools properly\n• You need to get everyone on the same platforms\n• You need to protect passwords and data\n• You need project management and team chat toolsCustomer Service\n• You have no way to measure if customers are happy\n• You need to start tracking customer satisfaction\n• Customer information is scattered everywhere\n• You need a proper system (CRM) to keep track of customer notes and interactionsMarketing & Sales\n• You’re getting too many unqualified leads (people who aren’t right for your business)\n• You need to create better free content to attract the right people\n• Your sales team isn’t following up with leads quickly enough\n• You need to start tracking basic sales numbers like how many calls you make\nand how many people buy\nPeople and HR\n• You’re wasting time interviewing people who aren’t right for the job\n• You need to learn how to interview properly and check references\n• Employees don’t know basic rules about time off, dress code, etc.\n• You need to create an employee handbook with basic policies\nMoney Matters\n• You keep getting surprised by “one-time” expenses\n• You’re learning that running a business costs more than you thought\n• You need proper profit and loss statements\n• You need basic business insurance\n8\n$100M SCALING ROADMAP  •  STAGE 04: PRIORITIZE  PERSONALIZED GUIDE\nWHAT SUCCESS LOOKS\nLIKE AT STAGE 4\nChoose Your Focus\n• Figure out who your best customers are\n• Change your product to serve them better\n• Stop trying to please everyone\n• Be willing to say “no” to customers who aren’t a good fit\nGet Organized\n• Set up proper systems for tracking sales\n• Keep all customer information in one place\n• Make sure everyone uses the same tools\n• Create basic rules and policies\nStart Measuring Things\n• Track how many leads turn into sales\n• Measure customer satisfaction\n• Monitor how quickly you respond to leads\n• Keep track of basic financial numbers\nMake Things Professional\n• Write an employee handbook\n• Set up proper insurance\n• Create basic processes for everything\n• Start running your business like a real companyYour job is to make the business more focused and professional. Here’s what you\nneed to do to graduate from Stage 4:\n9\n$100M SCALING ROADMAP  •  STAGE 04: PRIORITIZE  PERSONALIZED GUIDETHE BOTTOM LINE\nSTAGE 4 IS ALL ABOUT FOCUS AND PRIORITIES.\nYOU CAN’T SERVE EVERYONE, AND YOU CAN’T DO\nEVERYTHING. YOU NEED TO CHOOSE WHAT’S MOST\nIMPORTANT AND FOCUS ON THAT. THIS MEANS:\nThe key to Stage 4 is learning to say “no.” No to customers\nwho aren’t right for you. No to projects that don’t fit. No\nto doing everything yourself. That’s how you build a\nfocused, successful business that can grow even bigger.\nIt’s a hard transition because saying “no” means turning\ndown money in the short term. But it’s necessary if you want to build something bigger in the long term. About 3\nmillion businesses have made this transition successfully.\nIf you stay focused on serving your best customers really\nwell, you will too.SETTING\nUP BASIC\nSYSTEMSPICKING\nYOUR IDEAL\nCUSTOMERSSAYING\nNO TO\nOTHERS CREATING\nCLEAR\nRULES\nThis is when your business starts feeling like a real company instead of just a group of people working\ntogether. It’s when you stop trying to please everyone and start focusing on being really good at\nserving specific types of customers.\nREMEMBER MEASURING\nWHAT\nMATTERS\n10\n$100M SCALING ROADMAP  •  STAGE 04: PRIORITIZE  PERSONALIZED GUIDEDO YOU WANT TO\nSCALE TO THE\nNEXT STEP?\nTrying to be everything to everyone? You need to niche down to serve only people like your best\ncustomers. A lot of businesses do lots of activity and they don’t grow because they’re solving the\nwrong problems - for the wrong person.  If you want our help to select the right avatar, you can grab\na seat at one of our next available workshops.\nCheck Dates\n11\n$100M SCALING ROADMAP  •  STAGE 04: PRIORITIZE  PERSONALIZED GUIDETHIS IS THE\nSTAGE YOU JUST\nGRADUATED FROM...\nSTAGE 3: STABILIZE\n12\n$100M SCALING ROADMAP  •  STAGE 04: PRIORITIZE  PERSONALIZED GUIDE\nSTAGE 3: STABILIZE\n13\n$100M SCALING ROADMAP  •  STAGE 04: PRIORITIZE  PERSONALIZED GUIDEYOUR STAGE\nSTAGE 3\nSTABILIZE\nTHIS VIDEO PROVIDES AN\nIN-DEPTH LOOK AT THE CONSTRAINTS\n& SOLUTIONS AT STAGE 3\nTRAINERYOUR ROLE\n1 to 4HEADCOUNT\nThere’s too much for\none person to doBOTTOM LINE\nGet helpGRADUATE BY\n14\n$100M SCALING ROADMAP  •  STAGE 04: PRIORITIZE  PERSONALIZED GUIDEWHEN YOU HIT\n“STAGE 3: STABILIZE”\nYou’ve made it! You have your first 1-4 full-time employees. About 24% of businesses (around 7\nmillion companies) reach this level. This is when you go from doing everything yourself to having real\nemployees. Your role changes from “doer” to “trainer” because now you have to teach others how to\nhelp run the business.\nTHE BIG CHALLENGE: TOO MUCH WORK, NOT ENOUGH TIME\nThe main problem at Stage 3 is simple - there’s way too much work for one person to handle. That’s\nwhy it’s called the “Stabilize” stage. Everything feels a bit chaotic and you need to make things more\nstable. Let’s look at what’s happening in each part of the business:\nProducts and Customers\nSales and Service\nTech and Tools\nPeople and HR\nMoney Matters\n15\n$100M SCALING ROADMAP  •  STAGE 04: PRIORITIZE  PERSONALIZED GUIDEProducts & Customers\n• Your biggest headache is that you can’t fix everything customers complain about\n• You have to pick the ONE thing that bothers customers the most and fix just that\n• Your leads (potential customers) aren’t buying as quickly because they don’t know\nyou as well\n• You need to start sending emails and creating content to build trust over time\nSales and Service\n• You’re wasting time talking to people who aren’t serious about buying\n• You need to make a list of what makes someone a “good” potential customer\n• New customers often feel lost when they start using your product/service\n• You need to create a proper way to welcome and guide new customers\nTech and Tools\n• You probably bought too many different software tools thinking you’d use them all\n• Now you need to figure out which ones you actually need and cancel the rest\n• You should try to extend free trials or get discounts on the tools you keep\n• You need a basic system to track your sales pipeline\nPeople and HR\n• It’s hard to find good people to hire\n• You need to learn how to write good job descriptions and review resumes properly\n• You’re probably not handling employee taxes correctly\n• You need to get a payroll service to handle taxes and fees properly\nCustomer Service\n• People are getting paid informally (which isn’t good)\n• You need to set up proper payroll processing\n• You need basic bookkeeping to track money coming\nin and going out\n• You need to manage invoices and payments properly\n16\n$100M SCALING ROADMAP  •  STAGE 04: PRIORITIZE  PERSONALIZED GUIDE\nWHAT SUCCESS LOOKS\nLIKE AT STAGE 3\nFix Your Biggest Problem First\n• Don’t try to fix everything at once\n• Find the #1 thing customers complain about\n• Fix that one thing really well\n• Then move on to the next biggest problem\nGet Your Money In Order\n• Set up proper payroll for employees\n• Start using basic accounting software\n• Make sure you’re tracking all money coming in and going out\n• Have a system for managing bills and getting paid\nHelp Your Team Help You\n• Write down how you do important tasks\n• Train your team members properly\n• Give them the tools they need to do their jobs\n• Check their work to make sure it’s done right\nMake Your Customers Happy\n• Create a proper way to welcome new customers\n• Make sure they know how to use your product/service\n• Help them get results quickly\n• Keep in touch with them regularlyYour job is to move from doing everything yourself to having a small team that can help run the\nbusiness. Here’s what you need to do to graduate from Stage 3:\n17\n$100M SCALING ROADMAP  •  STAGE 04: PRIORITIZE  PERSONALIZED GUIDEDon’t try to fix everything at once. Pick the biggest problem, fix it well, then move on to the next one.\nThat’s how you stabilize a growing business.REMEMBERTHE BOTTOM LINE\nSTAGE 3 IS ALL ABOUT GOING FROM\nCHAOS TO STABILITY.\nYou can’t do everything yourself anymore, and that’s okay!\nYour job is to build a small team and teach them how to help\nrun the business. Focus on fixing the biggest problems first,\nsetting up proper systems for money and employees, and\nmaking sure customers get good results.\nIf you can get through this stage, you’ll have\na real business with real employees, not\njust a one-person show. It’s hard work, but\nabout 7 million other businesses have done it.\nYOU CAN TOO!\n18\n$100M SCALING ROADMAP  •  STAGE 04: PRIORITIZE  PERSONALIZED GUIDETHIS IS\nWHAT’S\nCOMING NEXT...\nSTAGE 5: PRODUCTIZE\n19\n$100M SCALING ROADMAP  •  STAGE 04: PRIORITIZE  PERSONALIZED GUIDE\nSTAGE 5: PRODUCTIZE\n20\n$100M SCALING ROADMAP  •  STAGE 04: PRIORITIZE  PERSONALIZED GUIDEYOUR STAGE\nSTAGE 5\nPRODUCTIZE\nTHIS VIDEO PROVIDES AN\nIN-DEPTH LOOK AT THE CONSTRAINTS\n& SOLUTIONS AT STAGE 5\nDIRECTORYOUR ROLE\n10 to 19HEADCOUNT\nNot making enough\nper customer.\nLow LTV:CAC.BOTTOM LINE\nMake and sell your\nsecond premium\nproduct to customersGRADUATE BY\n21\n$100M SCALING ROADMAP  •  STAGE 04: PRIORITIZE  PERSONALIZED GUIDEWHEN YOU HIT\n“STAGE 5: PRODUCTIZE”\nYou’ve grown to 10-19 employees! Around 2.4 million businesses reach this level. You’re now a “Director”\nwith your first 2-3 managers under you. This is when your original product is doing well, but that’s not\nenough anymore. Your main challenge? You need a second product to keep growing. Specifically,\nyou need to extend LTV - aka - you need to make more per customer. This gives you the cash to\nscale advertising and recruit even higher level people to your team to keep the growth coming.\nTHE BIG CHALLENGE: ONE PRODUCT ISN’T ENOUGH\nThe biggest problem at Stage 5 is that customers buy your product, but then they have nothing\nelse to buy from you. They might even leave (churn) because they need other things you don’t offer.\nThat’s why it’s called the “Productize” stage - you need to create new products to sell to your existing\ncustomers. Let’s look at what’s happening:\nProducts and Sales\nMarketing and Customers\nTech and Data\nPeople and HR\nMoney Matters\n22\n$100M SCALING ROADMAP  •  STAGE 04: PRIORITIZE  PERSONALIZED GUIDEProducts & Sales\n• Customers have nothing else to buy from you after their first purchase\n• You need to connect customer service with product development\n• You need to make something new to sell to existing customers\n• Sales people are overpromising and causing refunds and bad reviews\n• You need to create sales materials and record customer calls for training\nTech and Data\n• Employees are using their personal computers and software\n• When people leave, they take company information with them\n• You need company-owned computers and software\n• You need a way to track leads and customers\n• You need dashboards to show important numbersMarketing and Customers\n• Getting qualified leads is getting expensive\n• Your marketing needs to be more targeted\n• Customer support is inconsistent - different people give different answers\n• You need a proper playbook for customer service\n• You need a plan for moving customers to higher-level products\nPeople and HR\n• It’s hard to find managers and higher-level employees\n• You should promote good employees from within when possible\n• You’re firing people incorrectly and could get in trouble\n• You need proper termination policies\n• You need ways to encourage employee referrals\nMoney Matters\n• You don’t know how much money you can reinvest in growth\n• You need a real budget\n• You need simple financial forecasting\n• You need to track tax write-offs better\n23\n$100M SCALING ROADMAP  •  STAGE 04: PRIORITIZE  PERSONALIZED GUIDE\nWHAT SUCCESS LOOKS\nLIKE AT STAGE 5\nCreate Your Second Product\n• Listen to what else customers want\n• Create something new they can buy\n• Make sure it’s high quality\n• Price it well (often higher than your first product)\nProfessionalize Everything\n• Create proper training materials\n• Write down how everything should be done\n• Give employees company equipment\n• Set up proper systems\nImprove Customer Experience\n• Create consistent customer service\n• Train everyone to give the same answers\n• Record customer calls for training\n• Create a path for customers to buy more\nFix the Money Side\n• Make a real budget\n• Track spending better\n• Plan for future expenses\n• Save money for growthYour job is to create a second premium product while making everything more\nprofessional. Here’s what you need to do:\n24\n$100M SCALING ROADMAP  •  STAGE 04: PRIORITIZE  PERSONALIZED GUIDETHE BOTTOM LINE\nSTAGE 5 IS ABOUT GOING FROM “ONE-HIT WONDER” TO HAVING\nMULTIPLE SUCCESSFUL PRODUCTS. YOU CAN’T GROW JUST BY\nSELLING MORE OF THE SAME THING. YOU NEED TO:\nMAKE EVERYTHING\nMORE PROFESSIONALCREATE NEW\nPRODUCTSSELL MORE TO\nEXISTING CUSTOMERS SET UP PROPER\nSYSTEMS\nThis is when your business starts feeling like a real company that could keep growing for years. Instead of just doing one\nthing well, you’re building a business that can do several things well.\n• Making a second product is hard\n• You’re still fixing problems with the first product\n• Everything needs to become more professional\n• You need to spend money to grow\nThe key to Stage 5 is balance. You need to keep your\nfirst product running well while creating something new.\nYou need to stay profitable while investing in growth. You\nneed to keep current customers happy while attracting\nnew ones.\nAbout 2.4 million businesses have figured out this\nbalance. The ones that succeed usually:\n• Start small with their second product\n• Test it with their best customers• You can sell more to existing customers\n• You reduce risk by having multiple products\n• You build a stronger, more valuable company\n• You create paths for future growthWHY IT’S CHALLENGING:\nREMEMBERBUT IT’S WORTH IT BECAUSE:\n• Make sure it’s truly needed\n• Price it well (usually higher than their first product)\n• Keep the first product running smoothly while\ndeveloping the new one\nIf you can master this balancing act, you’ll have\na business that’s built to last and ready to grow\neven bigger.\n25\n$100M SCALING ROADMAP  •  STAGE 04: PRIORITIZE  PERSONALIZED GUIDEDO YOU WANT TO\nSCALE TO THE\nNEXT STEP?\nTrying to be everything to everyone? You need to niche down to serve only people like your best\ncustomers. A lot of businesses do lots of activity and they don’t grow because they’re solving the\nwrong problems - for the wrong person.  If you want our help to select the right avatar, you can grab\na seat at one of our next available workshops.\nCheck Dates"
    }
  ]
}