{
  "video_id": "D_zLUeVdV5Q",
  "title": "How to Make $3,697 in 24 Hours Selling Smart Websites Built with GoHighLevel",
  "url": "https://www.youtube.com/watch?v=D_zLUeVdV5Q",
  "channel": "Manual Upload",
  "published_date": "2024",
  "word_count": 3339,
  "transcript_type": "manual",
  "added_date": "2025-11-01T20:25:00Z",
  "entries": [
    {
      "text": "I made $3,697 in 24 hours selling a website that was already pre-built, ready to go, and it only took a few hours to customize. And even better, $697 of it is monthly recurring revenue that will come in every single month for years to come with less than 30 minutes of work per month to manage. And the best part of all, this is helping a local business to rank to the top of Google, save hours of time per week, and get more customers for their business. and it's all through a new type of website that I call smart websites. But what exactly is a smart website and where do you find these pre-built templates for them? To best answer that, let me back up a little to give you some context. There's a worldwide pandemic going on right now. And thankfully, it's not the pandemic you're probably thinking about, but it's a pandemic that's affecting businesses everywhere. If you do a quick Google Map search for any type of business near you and start looking at their websites, you'll find that over 70% of them deal with what I like to call DWS, dumb website syndrome. Their websites look bad, they don't rank on Google, they don't capture leads, and they're wasting precious digital real estate. But when there's a big problem like this bad website pandemic, there are usually big checks on the other side for people who can solve the problem. And that's exactly what these smart websites do for these businesses. So, in this video, I'm going to show you how you can replicate my success in your own agency and how to consistently land one to two paying smart website clients per week that pay you $1,000 to $3,000 setup fees and $97 to $697 per month. But before I jump into all this, let's take a look at an example of a smart website so you can see exactly what I'm talking about. I use a software called GoHigh Level to build all of my smart websites. And there are four key parts that make them smart. The first one being beautiful design and layout. We make sure all of the websites that we build look awesome and that they represent our clients brand well and just give them a place to show off what they offer. So that's the first step. The second step is the SEO. Just all of the text on the page. We make sure to keyword optimize it. So we actually can help them rank on Google which will help them get more customers. The third one is we actually help them capture leads through these smart websites. We have this chat widget here. People can come through, they can fill it out and boom, this business has now captured another lead. We have the phone button here where people can click this on mobile and it'll call this business right away so they can start getting more phone calls. We have the contact page where their leads can come and fill out a form with their information here. And we put these calendars on a lot of our clients websites where their leads and clients can come book consultation calls with them or book an appointment um right on the website. And so we make sure to give our clients many different ways they can capture leads through their website. And then the last and the fourth smart feature of our websites are the AI and automations. We can hook up an AI chatbot to this chat widget here that'll message back and forth on autopilot with leads, answer their questions, and it can book them in for appointments, all using the AI chatbot. We can also hook up an AI voice assistant to their phone number up here. So, when people call in, the AI voice assistant can pick up, it can answer people's questions, gather their contact information, and it can also book them in for appointments, and it can also route them to the correct people that they want to talk to. And then we can also hook up AI uh automated text messages and emails that send after people book. Just booking confirmation type stuff after somebody fills out a form, you know, on the contact page here, we can have an automated text and email sent out to them, which just increases the chance of of converting that client because you're really fast to reply to them and reach back out to them. And so those are our four main components. But the best part of all is that these this website template here, it it's just a template. GoHigh Level has over a thousand templates that you can use. If you go into the software, click from templates right here, you can see all of the templates that GoHigh Level provides for us. So, you can build off of a template rather than starting from scratch. It just makes building these so much easier. And we can reach out to our potential prospects with these templates and say, We built you guys a website. Just wanted to show it to you. And just makes it super easy. You don't have to be an amazing web designer to run a smart website agency anymore. And uh if you guys don't like the website templates in Gohigh Level, they've got a lot of them. Some people think they don't look great. You get over 50 plus templates, custom templates that I've built, me and my team have built. You guys can have them completely free if you sign up for GoHigh Level with my 30-day free trial link down below. So, if you just hate the GoHighle templates and you want access to better ones like the one I'm showing you here, this is one of ours that we custom built ourselves. And you get access to all those for free. All these smart website templates just for using my affiliate link down below. You get a 30-day free trial. Plus, I'll jump on two free Zoom calls with you every single week to help you out in your agency. So, if you want to do that, you can sign up right there down below. So, now you know what a smart website is, but how can you land one to two paying clients per week using pre-built smart website template? There are a ton of different ways you can reach out to businesses and get clients, but I found three methods to be the most effective. And the first effective outreach method is cold calling. Here's my cold calling script that I found to work extremely well for getting booked sales calls. first line. Hey Abby, this is Jasper from Web Juice. How are you? The reason I'm calling is because I built y'all a new smart website for your hair salon and wanted to show it to y'all. Are you the one in charge of the marketing stuff or is that somebody else? If they are, awesome. Keep talking. If they're not, try to get on the phone with the decision maker and the one that's in charge of that. Third line. Perfect. We work with other hair salons like yours to help them get more customers through our smart websites. Would you be available to check out the website we built for you really quick over Zoom? I can shoot you over a link. If they can't right now, try to book them in for later that day or tomorrow. You want to book them in within a short time frame so they don't forget about you. Awesome. Be on the lookout for the Zoom link to your phone number and email. And the purpose of the Zoom meeting is just to show you guys the Smart website and see if it would be a good fit for y'all and continue the conversation if it's a good fit. If not, we can part ways. Is that cool with you? Awesome. Cool. Looking forward to chatting with you then. Have a great day. This script works extremely well. Now, disclaimer, it does take a lot of calls in order to book people in and close clients through cold calling. You're going to have to on average call 200 to 300 people cold calls. You're not going to get on the phone with 200 and 300, but making 200 to 300 cold calls, you might get on the phone with about 25% of them. Out of those 25% you talk to, you might book in a few and then you might close one out of the few that you book. And so, it's just a numbers game. You have to do a lot of it. But, it works extremely well and you can put your fate into your own hands. Pick up the phone, start calling. You can get clients within a few days this way. Cold calling works extremely well, but I know not everybody loves doing it. So, here's another effective outreach method that doesn't require cold calling. I call it the Facebook group free website method. For this method, you'll just go to Facebook. You'll go type in your city name. Type in Idaho Falls, for example. That's where I'm located. And then you'll go down to this where it says groups on the left. Then you'll find all these different groups in your area. You'll want to go through and join them. These are usually like local groups of people in your town. There will be lots of business owners in these groups and that's what we're here for. And so I'm already in one. I'm just going to go to this one right here that I'm already a part of. And what we can do is we can go and post in these groups. These groups allow self-promotion. They allow businesses to post about their services because they want to help grow their local community. And so you can go and post. I've already made a post. I'm going to show you an example of one that I did that works really well. And um it's the, you know, free website post that I was telling you about. I'll just go to this one that I posted recently. So, this is what I said. For all my Idaho Falls business owners, do you or anyone you know need a free website? No strings attached. All I ask is to feature your business in one of my YouTube videos so I can show the process of how we helped. Comment below or PM me if you or someone you know could benefit from this. You could switch yours up a little. You don't have to say feature you in one of my YouTube videos. You could just say no strings attached. All I ask for is a positive testimonial if you like the website we build for you. Something like that you could do instead. This post got a lot of comments. got like 26 comments of people and the comments were like, I'm interested. I would need a new website. Would love one. I'm interested. So, all these people have basically raised their hands. They're business owners. They told me they need a new website. Now, I'm not lying to them. I'm going to pick one of them to do a free website for and I already did in this one. This was back in January of this year. So, you'll pick one free person. You don't charge them a setup fee or a monthly fee. You're going to do it completely free for them. But now you have, you know, 20 or so other people to reach out to that have raised their hands. You can reach out to them and just DM them on Facebook and you can say, Hey, unfortunately, we already picked the free winner. We ended up going with this other business, but we would still love to build you guys a website if you need one for a discounted price. And you can decide what that discount is yourself. This works extremely well. So, from this post, I actually got the one free client, right? The one that I did for free, and then I got two paying clients out of the 20 or so comments that commented here. I ended up landing two paying clients from this. And so, I'll give away one free website to land two paying customers. all day, every day. Really effective method and it works really well if you join local groups that you're actually where you actually live. So people can connect with you based on geography. They'll trust you a lot more when you can say, Yeah, I'd be happy to even meet you at a coffee shop if you want. They'll just trust you a lot more than somebody from another country or from another state because you both live in the same area. This is a really effective way to getting clients and doesn't really require cold calling at all. At some point, you have to get on the phone with them, right? But there's no cold calling involved in this method here. Facebook groups work wonders when you're trying to land clients, but there's one last method I've found that converts clients at a higher percentage than any other method, and that would be the local networking method. For this one, you'll go to your local Chamber of Commerce website. Pretty much every city across the United States, and I know a lot of them in other countries have a chamber of commerce or some form of a chamber of commerce, which is like the town page where they post all the local events and things like that. You'll go to the event section. Most of them have a calendar like this one right here, this community calendar. You'll pull it up and you'll find different events that you can go to specifically where you can meet other business owners. Typically, all of them will have different meetups for business owners. Let's see right here. Um, April Business Skills and Networking Forum. That would be a place you'll find a lot of other business owners in your local community. Um, April networking night. Another one just specifically for businesses to network with each other. So, you'll go in person to these meetings there. There's meetups and you can go meet other people in your area. This has such a high conversion rate, higher than any other type of outreach you could ever do because you're actually getting to talk to people face to face. You can give them your business card. A lot of people will come up to you and say, Yeah, what do you do for work? You know, what do you do in your business? And you can literally just tell them, I build smart websites for businesses. Have you guys ever looked into getting a new website for your business? Or do you have a website for your business? Just start a conversation with them, book a call to follow up with them, and then try to close them as a client. I went to one of these events for my local chamber of commerce and ended up landing two clients from it. One of them I had to reach out to and follow up with. The other one after I talked to him, he actually reached out to me and wanted to inquire about the smart websites that I told him about. And so there's another person in our community who's sold 25 different members of this chamber of commerce in his local area just by going to meetings, you know, a couple meetings a month. He's sold 25 different websites to businesses in his local chamber of commerce. So anyway, these groups are extremely powerful and the conversion rate for them is super high. So it's a really great idea to try to grow your online, you know, smart website business in a in-person fashion. Going to these local events, meeting people in real life, you'll be able to sell them so much easier. They'll trust you a lot more. So now you know the top three outreach methods for getting smart website clients. But here's one more bonus tip for getting organic clients without having to do any outreach. After getting a client, let's say it's a car detailing business, you'll send them a text or you'll call them right after you finish their website and they're super excited about it and you'll say, It's been awesome working with you on the smart website for your business. And just a quick favor, do you know any other local mechanics or window tinting companies that you could introduce me to that might need a smart website? Every car detailing business will know a mechanic and they'll know a window tinting business owner because they're all similar niches. And most of the time they will be willing to introduce you to them. This is a free method for getting clients that most agency owners won't do, but it only takes a few minutes of time and can yield free clients that you barely have to do any work for to get. So, now you know how to get one to two paying smart website clients per week. But how do you get them to pay you $3,697 for these templated smart websites? I'll start by jumping on a Zoom call with them, asking them some questions about their business, and then I'll show them the smart website template that we built for them, which is really just a template. And then I'll show them these pricing packages. I'll cover these three packages here. I'll go over the starter plan, the 1,000 setup, 97 a month, the growth plan, $2,000 setup fee, and $197 a month. Then I'll cover our elite plan, which is $3,000 setup and $697 a month. I'll just go over a few of these different features in these plans and I'll explain what these features are going to accomplish for this person's business and how it's going to help them out. And then at the end, I'll simply ask them, you know, which plan based on what we've talked about on this call do you think would be best for your business. They'll decide, you know, pick one of the plans or they'll have some objections which you can overcome at this point. And then you can ask them for their card and you can say, We just charge half the setup fee now, half the setup fee once the website's done and the monthly doesn't start for 30 days out. You can close your clients super easily this way. This will be after you've shown them, you've asked them lots of questions about their business, after you've kind of shown them the smart website that we built them that day and you'll just show them this pricing at the end and they'll decide which plan they want to go with or they'll have some objections which you can overcome and then you can close the deal. And I can usually close clients at about 40%. So I need to have, you know, I close four out of every 10 sales calls that I jump on with a potential prospect. So, now you know from start to finish how to land smart website clients that pay you setup fees and monthly subscriptions. But there's still a lot of other moving parts to running a smart website agency that I couldn't cover in this video. So, if you want to learn step by step how to start, run, and grow your own smart website agency, then check out my free 5-hour course in my High Level Quest community down below."
    }
  ]
}
