{
  "video_id": "ltclLkjmAiQ",
  "url": "https://www.youtube.com/watch?v=ltclLkjmAiQ",
  "title": "Did You Know You Can Run a Referral Program in HighLevel?",
  "channel": "HighLevel",
  "channel_id": "UCXFiV4qDX5ipE-DQcsm1j4g",
  "upload_date": "20251031",
  "duration": 176,
  "view_count": 259,
  "like_count": 13,
  "description": "For a 14-day free trial, click https://www.gohighlevel.com/?utm_source=youtube&utm_medium=video&utm_campaign=video_did_you_know\n———\nWant someone from the team to walk you through it? Click here https://speakwith.us/success\n———\nVisit the Did You Know blog for other great resources https://www.gohighlevel.com/blog/category/did-you-know\n———\nFor more information about this and other topics, be sure to visit the knowledge base https://help.gohighlevel.com/support/solutions\n———\nFor other helpful tutorials, visit our Content Army playlist https://www.youtube.com/playlist?list=PLUjgZhyQd8yUgxV6579GC5uh75YigrLLq\n\nDiscover how to turn your happiest clients into your best sales channel using HighLevel's Affiliate Manager. Learn to set up a comprehensive referral program with tracked links, clear rewards, and simplified payouts. Follow this step-by-step guide to create campaigns, assign affiliates, and manage payouts all within your HighLevel account. Boost your growth with a repeatable referral system.\n\n00:00 Introduction to HighLevel Referral Program\n00:36 Setting Up Your Referral Program\n00:54 Creating and Managing Campaigns\n01:23 Assigning and Managing Affiliates\n02:12 Affiliate Portal and Payouts\n02:47 Conclusion and Additional Resources",
  "tags": [],
  "categories": [
    "Education"
  ],
  "transcript": "What if your happiest clients became your best sales channel? Did you know you can run a full referral program right inside of High Level? Don't leave word of mouth to chance. With High Level's affiliate manager, you can package referrals as a program with tracked links, clear rewards, and a simple payout all in one place. That means referrals stop being random and start becoming a repeatable growth engine. Here's what the referral program unlocks. It tracks the journey with unique links, so clicks and signups are always captured. It rewards fairly. Whether you want to give a flat commission or a tiered payout, it simplifies payouts so you can see what's owed and pay when it works for you. And it equips your partners by giving them pre-approved copy so they can promote faster. Here's what it looks like. Inside your highle account, if you come down to marketing on the left hand side, and then come up to affiliate manager, you'll see you'll be inside the dashboard. This is where you can see your total revenue generated, the conversion percentage, as well as your total customers. If you want to add any widgets, you can click on this button here. And over here, you can toggle between a date range. Now, if you want to create a campaign, all you have to do is come up here, come down to campaigns, and click on add. Then you just choose where you want your affiliate links to lead. In this case, I'm going to say from a form, and then click on setup reward. This is where we set up how much your affiliates will earn. When we toggle this on, that means we're going to give them a flat rate for every referral they give. So, toggle it on and then put the amount. I will say 20. And if you want to do a tiered approach, all you have to do is click on this advanced arrow and then you can configure the multiple tiers. For now, I'm going to keep it as default and click on assign affiliate. This is the place where we can assign affiliate to the campaign so they can promote our program. So if you have the contact saved, you just come over here, search for the contact and then come down here and click on finish. Then you can say publish now or save as draft. I'm going to say publish now. And you'll see your campaign has now been created. If you come back to the top here and come down to affiliate, this is where you'll see a list of all your affiliates and what campaign they are a part of. I'm going to manually add an affiliate by clicking on add in the top right corner. Say new affiliate and just add the information. Then I'm going to click on save. And just like that, we will see a magic link generated, which will be the unique link that that affiliate can use to sign into their portal. So, if we go back and add them to that campaign now by clicking on the campaign we created, click on setup and then assign affiliate. Now, we can choose from the affiliate that we just created and add them to this campaign. I'm going to click on finish, publish now. And just like that, we added an affiliate to the campaign. just to show you where that link will lead to. When the affiliate uses that link, it will take them to the client portal where they can set their password, sign in, and then see all the programs they can promote as well as the commission owed to them. Then the final thing to show is the payouts. If you hover over affiliate manager and come over to payouts every time an amount is owed to an affiliate, that amount will show up right over here with a button on the right hand side to click to pay out. Agencies love referral programs in High Lee because they keep acquisition costs low and leverage existing relationships. You only pay when results come in and you can clone offers and assets across different client accounts. Best of all, your partners feel valued so they keep promoting you. So that's how High Level helps you run a referral program. For more information about this or other Highle features, be sure to check out the YouTube channel, blog, and help docs. The links on the description below. My name is Ben and thank you for watching.",
  "transcript_entries": [
    {
      "text": "What if your happiest clients became",
      "start": 0.24,
      "duration": 3.12
    },
    {
      "text": "your best sales channel? Did you know",
      "start": 1.839,
      "duration": 3.281
    },
    {
      "text": "you can run a full referral program",
      "start": 3.36,
      "duration": 3.519
    },
    {
      "text": "right inside of High Level? Don't leave",
      "start": 5.12,
      "duration": 3.28
    },
    {
      "text": "word of mouth to chance. With High",
      "start": 6.879,
      "duration": 3.041
    },
    {
      "text": "Level's affiliate manager, you can",
      "start": 8.4,
      "duration": 3.279
    },
    {
      "text": "package referrals as a program with",
      "start": 9.92,
      "duration": 3.679
    },
    {
      "text": "tracked links, clear rewards, and a",
      "start": 11.679,
      "duration": 3.92
    },
    {
      "text": "simple payout all in one place. That",
      "start": 13.599,
      "duration": 3.76
    },
    {
      "text": "means referrals stop being random and",
      "start": 15.599,
      "duration": 3.201
    },
    {
      "text": "start becoming a repeatable growth",
      "start": 17.359,
      "duration": 3.281
    },
    {
      "text": "engine. Here's what the referral program",
      "start": 18.8,
      "duration": 3.6
    },
    {
      "text": "unlocks. It tracks the journey with",
      "start": 20.64,
      "duration": 3.92
    },
    {
      "text": "unique links, so clicks and signups are",
      "start": 22.4,
      "duration": 4.0
    },
    {
      "text": "always captured. It rewards fairly.",
      "start": 24.56,
      "duration": 2.959
    },
    {
      "text": "Whether you want to give a flat",
      "start": 26.4,
      "duration": 2.799
    },
    {
      "text": "commission or a tiered payout, it",
      "start": 27.519,
      "duration": 3.6
    },
    {
      "text": "simplifies payouts so you can see what's",
      "start": 29.199,
      "duration": 3.761
    },
    {
      "text": "owed and pay when it works for you. And",
      "start": 31.119,
      "duration": 3.521
    },
    {
      "text": "it equips your partners by giving them",
      "start": 32.96,
      "duration": 3.439
    },
    {
      "text": "pre-approved copy so they can promote",
      "start": 34.64,
      "duration": 3.2
    },
    {
      "text": "faster. Here's what it looks like.",
      "start": 36.399,
      "duration": 3.281
    },
    {
      "text": "Inside your highle account, if you come",
      "start": 37.84,
      "duration": 3.52
    },
    {
      "text": "down to marketing on the left hand side,",
      "start": 39.68,
      "duration": 3.36
    },
    {
      "text": "and then come up to affiliate manager,",
      "start": 41.36,
      "duration": 2.96
    },
    {
      "text": "you'll see you'll be inside the",
      "start": 43.04,
      "duration": 2.72
    },
    {
      "text": "dashboard. This is where you can see",
      "start": 44.32,
      "duration": 3.04
    },
    {
      "text": "your total revenue generated, the",
      "start": 45.76,
      "duration": 3.36
    },
    {
      "text": "conversion percentage, as well as your",
      "start": 47.36,
      "duration": 3.44
    },
    {
      "text": "total customers. If you want to add any",
      "start": 49.12,
      "duration": 3.04
    },
    {
      "text": "widgets, you can click on this button",
      "start": 50.8,
      "duration": 2.72
    },
    {
      "text": "here. And over here, you can toggle",
      "start": 52.16,
      "duration": 2.96
    },
    {
      "text": "between a date range. Now, if you want",
      "start": 53.52,
      "duration": 3.12
    },
    {
      "text": "to create a campaign, all you have to do",
      "start": 55.12,
      "duration": 3.599
    },
    {
      "text": "is come up here, come down to campaigns,",
      "start": 56.64,
      "duration": 4.079
    },
    {
      "text": "and click on add. Then you just choose",
      "start": 58.719,
      "duration": 3.36
    },
    {
      "text": "where you want your affiliate links to",
      "start": 60.719,
      "duration": 2.721
    },
    {
      "text": "lead. In this case, I'm going to say",
      "start": 62.079,
      "duration": 3.12
    },
    {
      "text": "from a form, and then click on setup",
      "start": 63.44,
      "duration": 3.359
    },
    {
      "text": "reward. This is where we set up how much",
      "start": 65.199,
      "duration": 2.96
    },
    {
      "text": "your affiliates will earn. When we",
      "start": 66.799,
      "duration": 2.64
    },
    {
      "text": "toggle this on, that means we're going",
      "start": 68.159,
      "duration": 2.64
    },
    {
      "text": "to give them a flat rate for every",
      "start": 69.439,
      "duration": 3.201
    },
    {
      "text": "referral they give. So, toggle it on and",
      "start": 70.799,
      "duration": 4.081
    },
    {
      "text": "then put the amount. I will say 20. And",
      "start": 72.64,
      "duration": 3.68
    },
    {
      "text": "if you want to do a tiered approach, all",
      "start": 74.88,
      "duration": 2.879
    },
    {
      "text": "you have to do is click on this advanced",
      "start": 76.32,
      "duration": 3.04
    },
    {
      "text": "arrow and then you can configure the",
      "start": 77.759,
      "duration": 3.121
    },
    {
      "text": "multiple tiers. For now, I'm going to",
      "start": 79.36,
      "duration": 3.36
    },
    {
      "text": "keep it as default and click on assign",
      "start": 80.88,
      "duration": 3.36
    },
    {
      "text": "affiliate. This is the place where we",
      "start": 82.72,
      "duration": 3.36
    },
    {
      "text": "can assign affiliate to the campaign so",
      "start": 84.24,
      "duration": 3.44
    },
    {
      "text": "they can promote our program. So if you",
      "start": 86.08,
      "duration": 3.12
    },
    {
      "text": "have the contact saved, you just come",
      "start": 87.68,
      "duration": 3.2
    },
    {
      "text": "over here, search for the contact and",
      "start": 89.2,
      "duration": 3.36
    },
    {
      "text": "then come down here and click on finish.",
      "start": 90.88,
      "duration": 3.599
    },
    {
      "text": "Then you can say publish now or save as",
      "start": 92.56,
      "duration": 3.599
    },
    {
      "text": "draft. I'm going to say publish now. And",
      "start": 94.479,
      "duration": 3.201
    },
    {
      "text": "you'll see your campaign has now been",
      "start": 96.159,
      "duration": 3.041
    },
    {
      "text": "created. If you come back to the top",
      "start": 97.68,
      "duration": 3.28
    },
    {
      "text": "here and come down to affiliate, this is",
      "start": 99.2,
      "duration": 2.959
    },
    {
      "text": "where you'll see a list of all your",
      "start": 100.96,
      "duration": 2.72
    },
    {
      "text": "affiliates and what campaign they are a",
      "start": 102.159,
      "duration": 3.041
    },
    {
      "text": "part of. I'm going to manually add an",
      "start": 103.68,
      "duration": 3.04
    },
    {
      "text": "affiliate by clicking on add in the top",
      "start": 105.2,
      "duration": 3.599
    },
    {
      "text": "right corner. Say new affiliate and just",
      "start": 106.72,
      "duration": 3.6
    },
    {
      "text": "add the information. Then I'm going to",
      "start": 108.799,
      "duration": 3.201
    },
    {
      "text": "click on save. And just like that, we",
      "start": 110.32,
      "duration": 3.28
    },
    {
      "text": "will see a magic link generated, which",
      "start": 112.0,
      "duration": 2.96
    },
    {
      "text": "will be the unique link that that",
      "start": 113.6,
      "duration": 2.799
    },
    {
      "text": "affiliate can use to sign into their",
      "start": 114.96,
      "duration": 3.199
    },
    {
      "text": "portal. So, if we go back and add them",
      "start": 116.399,
      "duration": 3.601
    },
    {
      "text": "to that campaign now by clicking on the",
      "start": 118.159,
      "duration": 3.761
    },
    {
      "text": "campaign we created, click on setup and",
      "start": 120.0,
      "duration": 3.36
    },
    {
      "text": "then assign affiliate. Now, we can",
      "start": 121.92,
      "duration": 2.72
    },
    {
      "text": "choose from the affiliate that we just",
      "start": 123.36,
      "duration": 2.96
    },
    {
      "text": "created and add them to this campaign.",
      "start": 124.64,
      "duration": 3.28
    },
    {
      "text": "I'm going to click on finish, publish",
      "start": 126.32,
      "duration": 3.439
    },
    {
      "text": "now. And just like that, we added an",
      "start": 127.92,
      "duration": 3.44
    },
    {
      "text": "affiliate to the campaign. just to show",
      "start": 129.759,
      "duration": 2.961
    },
    {
      "text": "you where that link will lead to. When",
      "start": 131.36,
      "duration": 2.959
    },
    {
      "text": "the affiliate uses that link, it will",
      "start": 132.72,
      "duration": 3.12
    },
    {
      "text": "take them to the client portal where",
      "start": 134.319,
      "duration": 3.28
    },
    {
      "text": "they can set their password, sign in,",
      "start": 135.84,
      "duration": 3.28
    },
    {
      "text": "and then see all the programs they can",
      "start": 137.599,
      "duration": 3.041
    },
    {
      "text": "promote as well as the commission owed",
      "start": 139.12,
      "duration": 3.04
    },
    {
      "text": "to them. Then the final thing to show is",
      "start": 140.64,
      "duration": 3.52
    },
    {
      "text": "the payouts. If you hover over affiliate",
      "start": 142.16,
      "duration": 3.92
    },
    {
      "text": "manager and come over to payouts every",
      "start": 144.16,
      "duration": 3.6
    },
    {
      "text": "time an amount is owed to an affiliate,",
      "start": 146.08,
      "duration": 3.2
    },
    {
      "text": "that amount will show up right over here",
      "start": 147.76,
      "duration": 3.28
    },
    {
      "text": "with a button on the right hand side to",
      "start": 149.28,
      "duration": 4.0
    },
    {
      "text": "click to pay out. Agencies love referral",
      "start": 151.04,
      "duration": 3.839
    },
    {
      "text": "programs in High Lee because they keep",
      "start": 153.28,
      "duration": 3.36
    },
    {
      "text": "acquisition costs low and leverage",
      "start": 154.879,
      "duration": 3.44
    },
    {
      "text": "existing relationships. You only pay",
      "start": 156.64,
      "duration": 3.36
    },
    {
      "text": "when results come in and you can clone",
      "start": 158.319,
      "duration": 3.041
    },
    {
      "text": "offers and assets across different",
      "start": 160.0,
      "duration": 2.879
    },
    {
      "text": "client accounts. Best of all, your",
      "start": 161.36,
      "duration": 2.959
    },
    {
      "text": "partners feel valued so they keep",
      "start": 162.879,
      "duration": 2.961
    },
    {
      "text": "promoting you. So that's how High Level",
      "start": 164.319,
      "duration": 3.121
    },
    {
      "text": "helps you run a referral program. For",
      "start": 165.84,
      "duration": 3.039
    },
    {
      "text": "more information about this or other",
      "start": 167.44,
      "duration": 3.12
    },
    {
      "text": "Highle features, be sure to check out",
      "start": 168.879,
      "duration": 3.121
    },
    {
      "text": "the YouTube channel, blog, and help",
      "start": 170.56,
      "duration": 2.8
    },
    {
      "text": "docs. The links on the description",
      "start": 172.0,
      "duration": 3.04
    },
    {
      "text": "below. My name is Ben and thank you for",
      "start": 173.36,
      "duration": 3.84
    },
    {
      "text": "watching.",
      "start": 175.04,
      "duration": 2.16
    }
  ],
  "duration_seconds": 177.2,
  "language": "en",
  "is_generated": true,
  "method": "youtube-transcript-api",
  "scraped_date": "2025-11-01T16:05:58.692631",
  "word_count": 766
}